SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for app_access_log
-- ----------------------------
DROP TABLE IF EXISTS `app_access_log`;
CREATE TABLE `app_access_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` bigint(20) NOT NULL DEFAULT '0' COMMENT 'uid',
  `referer_url` varchar(255) NOT NULL DEFAULT '' COMMENT '当前访问的refer',
  `target_url` varchar(255) NOT NULL DEFAULT '' COMMENT '访问的url',
  `query_params` text NOT NULL COMMENT 'get和post参数',
  `ua` varchar(255) NOT NULL DEFAULT '' COMMENT '访问ua',
  `ip` varchar(32) NOT NULL DEFAULT '' COMMENT '访问ip',
  `note` varchar(1000) NOT NULL DEFAULT '' COMMENT 'json格式备注字段',
  `created_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_uid` (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=158 DEFAULT CHARSET=utf8 COMMENT='用户访问记录表';


-- ----------------------------
-- Table structure for app_log
-- ----------------------------
DROP TABLE IF EXISTS `app_log`;
CREATE TABLE `app_log` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `app_name` varchar(30) NOT NULL DEFAULT '' COMMENT 'app 名字',
  `err_name` varchar(50) NOT NULL DEFAULT 'NOT SET',
  `http_code` int(11) NOT NULL DEFAULT '0',
  `err_code` int(11) NOT NULL DEFAULT '0',
  `ip` varchar(20) NOT NULL,
  `ua` varchar(200) NOT NULL,
  `content` longtext NOT NULL COMMENT '日志内容',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=192 DEFAULT CHARSET=utf8 COMMENT='app错误日表';


-- ----------------------------
-- Table structure for book
-- ----------------------------
DROP TABLE IF EXISTS `book`;
CREATE TABLE `book` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `cat_id` int(11) NOT NULL DEFAULT '0' COMMENT '分类id',
  `name` varchar(100) NOT NULL DEFAULT '' COMMENT '书籍名称',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '售卖金额',
  `main_image` varchar(100) NOT NULL DEFAULT '' COMMENT '主图',
  `summary` varchar(2000) NOT NULL DEFAULT '' COMMENT '描述',
  `stock` int(11) NOT NULL DEFAULT '0' COMMENT '库存量',
  `tags` varchar(200) NOT NULL DEFAULT '' COMMENT 'tag关键字，以","连接',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态 1：有效 0：无效',
  `month_count` int(11) NOT NULL DEFAULT '0' COMMENT '月销售数量',
  `total_count` int(11) NOT NULL DEFAULT '0' COMMENT '总销售量',
  `view_count` int(11) NOT NULL DEFAULT '0' COMMENT '总浏览次数',
  `comment_count` int(11) NOT NULL DEFAULT '0' COMMENT '总评论量',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='书籍表';

-- ----------------------------
-- Records of book
-- ----------------------------
INSERT INTO `book` VALUES ('1', '1', '行之有效：IT技术团队管理之道', '7.50', '20190322/38d7f55da65a9ff365b44e95b813bf45.jpg', '<p>本书言语平实，图文结合，本着“实践经验 + 案例”的原则，由浅入深地探讨了IT技术团队管理的各个方面。</p>', '0', '管理', '1', '0', '0', '3', '0', '2019-03-22 13:40:35', '2019-03-22 13:40:35');

-- ----------------------------
-- Table structure for book_cat
-- ----------------------------
DROP TABLE IF EXISTS `book_cat`;
CREATE TABLE `book_cat` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '类别名称',
  `weight` tinyint(4) NOT NULL DEFAULT '1' COMMENT '权重',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态 1：有效 0：无效',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_name` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='书籍分类';

-- ----------------------------
-- Records of book_cat
-- ----------------------------
INSERT INTO `book_cat` VALUES ('1', '技术书籍', '1', '1', '2019-03-22 13:11:34', '2019-03-22 13:11:34');

-- ----------------------------
-- Table structure for book_sale_change_log
-- ----------------------------
DROP TABLE IF EXISTS `book_sale_change_log`;
CREATE TABLE `book_sale_change_log` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `book_id` int(11) NOT NULL DEFAULT '0' COMMENT '商品id',
  `quantity` int(11) NOT NULL DEFAULT '0' COMMENT '售卖数量',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '售卖金额',
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '售卖时间',
  PRIMARY KEY (`id`),
  KEY `idx_book_id` (`book_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='商品销售情况';

-- ----------------------------
-- Records of book_sale_change_log
-- ----------------------------

-- ----------------------------
-- Table structure for book_stock_change_log
-- ----------------------------
DROP TABLE IF EXISTS `book_stock_change_log`;
CREATE TABLE `book_stock_change_log` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `book_id` int(11) NOT NULL COMMENT '书籍商品id',
  `unit` int(11) NOT NULL DEFAULT '0' COMMENT '变更多少',
  `total_stock` int(11) NOT NULL DEFAULT '0' COMMENT '变更之后总量',
  `note` varchar(100) NOT NULL DEFAULT '' COMMENT '备注字段',
  `created_time` datetime NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_book_id` (`book_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='数据库存变更表';

-- ----------------------------
-- Records of book_stock_change_log
-- ----------------------------
INSERT INTO `book_stock_change_log` VALUES ('1', '1', '1', '1', '', '2019-03-22 13:40:35');
INSERT INTO `book_stock_change_log` VALUES ('2', '1', '-1', '0', '在线购买', '2019-03-22 13:44:37');

-- ----------------------------
-- Table structure for brand_images
-- ----------------------------
DROP TABLE IF EXISTS `brand_images`;
CREATE TABLE `brand_images` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `image_key` varchar(200) NOT NULL DEFAULT '' COMMENT '图片地址',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_image_key` (`image_key`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='品牌图片';

-- ----------------------------
-- Records of brand_images
-- ----------------------------
INSERT INTO `brand_images` VALUES ('2', '20190322/a4cbaf0c79cf7e0cbc34d43af8e745cb.jpg', '2019-03-22 07:57:39');
INSERT INTO `brand_images` VALUES ('3', '20190322/f8dc7f6cb025d2e9ae247bc9b8caba31.jpg', '2019-03-22 07:57:51');
INSERT INTO `brand_images` VALUES ('4', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 07:58:08');

-- ----------------------------
-- Table structure for brand_setting
-- ----------------------------
DROP TABLE IF EXISTS `brand_setting`;
CREATE TABLE `brand_setting` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL DEFAULT '' COMMENT '品牌名称',
  `description` varchar(2000) NOT NULL DEFAULT '' COMMENT '品牌描述',
  `address` varchar(200) NOT NULL DEFAULT '' COMMENT '公司地址',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '联系电话',
  `logo` varchar(200) NOT NULL DEFAULT '' COMMENT 'logo图片',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='品牌设置表';

-- ----------------------------
-- Records of brand_setting
-- ----------------------------
INSERT INTO `brand_setting` VALUES ('1', '测试品牌', '测试品牌', '番禺东环001号', '18818818808', '20190322/8a42b90ba2f2647e13ff06c05983ca94.jpg', '2019-03-22 11:38:13', '0000-00-00 00:00:00');

-- ----------------------------
-- Table structure for city
-- ----------------------------
DROP TABLE IF EXISTS `city`;
CREATE TABLE `city` (
  `id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `province_id` mediumint(9) NOT NULL,
  `province` varchar(20) NOT NULL,
  `province_alias_name` varchar(20) NOT NULL DEFAULT '' COMMENT '省份别名',
  `city_id` mediumint(9) NOT NULL,
  `city` varchar(20) NOT NULL,
  `area_id` int(11) NOT NULL,
  `area` varchar(20) NOT NULL,
  `region_id` tinyint(4) NOT NULL DEFAULT '0' COMMENT '区域id，0：其他 1：华北 2：东北 3：西北 4：华南 5：华中 6：西南 7：华东',
  `region_name` varchar(20) NOT NULL DEFAULT '' COMMENT '区域名称 如：华北',
  PRIMARY KEY (`id`),
  KEY `province_id` (`province_id`),
  KEY `city_id` (`city_id`),
  KEY `region_id` (`region_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of city
-- ----------------------------
INSERT INTO `city` VALUES ('110000', '北京市', '110000', '北京市', '北京', '0', '', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110101', '东城区', '110000', '北京市', '北京', '110101', '东城区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110102', '西城区', '110000', '北京市', '北京', '110102', '西城区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110105', '朝阳区', '110000', '北京市', '北京', '110105', '朝阳区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110106', '丰台区', '110000', '北京市', '北京', '110106', '丰台区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110107', '石景山区', '110000', '北京市', '北京', '110107', '石景山区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110108', '海淀区', '110000', '北京市', '北京', '110108', '海淀区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110109', '门头沟区', '110000', '北京市', '北京', '110109', '门头沟区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110111', '房山区', '110000', '北京市', '北京', '110111', '房山区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110112', '通州区', '110000', '北京市', '北京', '110112', '通州区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110113', '顺义区', '110000', '北京市', '北京', '110113', '顺义区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110114', '昌平区', '110000', '北京市', '北京', '110114', '昌平区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110115', '大兴区', '110000', '北京市', '北京', '110115', '大兴区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110116', '怀柔区', '110000', '北京市', '北京', '110116', '怀柔区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110117', '平谷区', '110000', '北京市', '北京', '110117', '平谷区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110228', '密云县', '110000', '北京市', '北京', '110228', '密云县', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('110229', '延庆县', '110000', '北京市', '北京', '110229', '延庆县', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120000', '天津市', '120000', '天津市', '天津', '0', '', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120101', '和平区', '120000', '天津市', '天津', '120101', '和平区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120102', '河东区', '120000', '天津市', '天津', '120102', '河东区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120103', '河西区', '120000', '天津市', '天津', '120103', '河西区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120104', '南开区', '120000', '天津市', '天津', '120104', '南开区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120105', '河北区', '120000', '天津市', '天津', '120105', '河北区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120106', '红桥区', '120000', '天津市', '天津', '120106', '红桥区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120110', '东丽区', '120000', '天津市', '天津', '120110', '东丽区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120111', '西青区', '120000', '天津市', '天津', '120111', '西青区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120112', '津南区', '120000', '天津市', '天津', '120112', '津南区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120113', '北辰区', '120000', '天津市', '天津', '120113', '北辰区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120114', '武清区', '120000', '天津市', '天津', '120114', '武清区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120115', '宝坻区', '120000', '天津市', '天津', '120115', '宝坻区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120116', '滨海新区', '120000', '天津市', '天津', '120116', '滨海新区', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120221', '宁河县', '120000', '天津市', '天津', '120221', '宁河县', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120223', '静海县', '120000', '天津市', '天津', '120223', '静海县', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('120225', '蓟县', '120000', '天津市', '天津', '120225', '蓟县', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130000', '河北省', '130000', '河北省', '河北', '0', '', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130100', '石家庄市', '130000', '河北省', '河北', '130100', '石家庄市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130101', '市辖区', '130000', '河北省', '河北', '130100', '石家庄市', '130101', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130102', '长安区', '130000', '河北省', '河北', '130100', '石家庄市', '130102', '长安区', '1', '华北');
INSERT INTO `city` VALUES ('130103', '桥东区', '130000', '河北省', '河北', '130100', '石家庄市', '130103', '桥东区', '1', '华北');
INSERT INTO `city` VALUES ('130104', '桥西区', '130000', '河北省', '河北', '130100', '石家庄市', '130104', '桥西区', '1', '华北');
INSERT INTO `city` VALUES ('130105', '新华区', '130000', '河北省', '河北', '130100', '石家庄市', '130105', '新华区', '1', '华北');
INSERT INTO `city` VALUES ('130107', '井陉矿区', '130000', '河北省', '河北', '130100', '石家庄市', '130107', '井陉矿区', '1', '华北');
INSERT INTO `city` VALUES ('130108', '裕华区', '130000', '河北省', '河北', '130100', '石家庄市', '130108', '裕华区', '1', '华北');
INSERT INTO `city` VALUES ('130121', '井陉县', '130000', '河北省', '河北', '130100', '石家庄市', '130121', '井陉县', '1', '华北');
INSERT INTO `city` VALUES ('130123', '正定县', '130000', '河北省', '河北', '130100', '石家庄市', '130123', '正定县', '1', '华北');
INSERT INTO `city` VALUES ('130124', '栾城县', '130000', '河北省', '河北', '130100', '石家庄市', '130124', '栾城县', '1', '华北');
INSERT INTO `city` VALUES ('130125', '行唐县', '130000', '河北省', '河北', '130100', '石家庄市', '130125', '行唐县', '1', '华北');
INSERT INTO `city` VALUES ('130126', '灵寿县', '130000', '河北省', '河北', '130100', '石家庄市', '130126', '灵寿县', '1', '华北');
INSERT INTO `city` VALUES ('130127', '高邑县', '130000', '河北省', '河北', '130100', '石家庄市', '130127', '高邑县', '1', '华北');
INSERT INTO `city` VALUES ('130128', '深泽县', '130000', '河北省', '河北', '130100', '石家庄市', '130128', '深泽县', '1', '华北');
INSERT INTO `city` VALUES ('130129', '赞皇县', '130000', '河北省', '河北', '130100', '石家庄市', '130129', '赞皇县', '1', '华北');
INSERT INTO `city` VALUES ('130130', '无极县', '130000', '河北省', '河北', '130100', '石家庄市', '130130', '无极县', '1', '华北');
INSERT INTO `city` VALUES ('130131', '平山县', '130000', '河北省', '河北', '130100', '石家庄市', '130131', '平山县', '1', '华北');
INSERT INTO `city` VALUES ('130132', '元氏县', '130000', '河北省', '河北', '130100', '石家庄市', '130132', '元氏县', '1', '华北');
INSERT INTO `city` VALUES ('130133', '赵县', '130000', '河北省', '河北', '130100', '石家庄市', '130133', '赵县', '1', '华北');
INSERT INTO `city` VALUES ('130181', '辛集市', '130000', '河北省', '河北', '130100', '石家庄市', '130181', '辛集市', '1', '华北');
INSERT INTO `city` VALUES ('130182', '藁城市', '130000', '河北省', '河北', '130100', '石家庄市', '130182', '藁城市', '1', '华北');
INSERT INTO `city` VALUES ('130183', '晋州市', '130000', '河北省', '河北', '130100', '石家庄市', '130183', '晋州市', '1', '华北');
INSERT INTO `city` VALUES ('130184', '新乐市', '130000', '河北省', '河北', '130100', '石家庄市', '130184', '新乐市', '1', '华北');
INSERT INTO `city` VALUES ('130185', '鹿泉市', '130000', '河北省', '河北', '130100', '石家庄市', '130185', '鹿泉市', '1', '华北');
INSERT INTO `city` VALUES ('130200', '唐山市', '130000', '河北省', '河北', '130200', '唐山市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130201', '市辖区', '130000', '河北省', '河北', '130200', '唐山市', '130201', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130202', '路南区', '130000', '河北省', '河北', '130200', '唐山市', '130202', '路南区', '1', '华北');
INSERT INTO `city` VALUES ('130203', '路北区', '130000', '河北省', '河北', '130200', '唐山市', '130203', '路北区', '1', '华北');
INSERT INTO `city` VALUES ('130204', '古冶区', '130000', '河北省', '河北', '130200', '唐山市', '130204', '古冶区', '1', '华北');
INSERT INTO `city` VALUES ('130205', '开平区', '130000', '河北省', '河北', '130200', '唐山市', '130205', '开平区', '1', '华北');
INSERT INTO `city` VALUES ('130207', '丰南区', '130000', '河北省', '河北', '130200', '唐山市', '130207', '丰南区', '1', '华北');
INSERT INTO `city` VALUES ('130208', '丰润区', '130000', '河北省', '河北', '130200', '唐山市', '130208', '丰润区', '1', '华北');
INSERT INTO `city` VALUES ('130209', '曹妃甸区', '130000', '河北省', '河北', '130200', '唐山市', '130209', '曹妃甸区', '1', '华北');
INSERT INTO `city` VALUES ('130223', '滦县', '130000', '河北省', '河北', '130200', '唐山市', '130223', '滦县', '1', '华北');
INSERT INTO `city` VALUES ('130224', '滦南县', '130000', '河北省', '河北', '130200', '唐山市', '130224', '滦南县', '1', '华北');
INSERT INTO `city` VALUES ('130225', '乐亭县', '130000', '河北省', '河北', '130200', '唐山市', '130225', '乐亭县', '1', '华北');
INSERT INTO `city` VALUES ('130227', '迁西县', '130000', '河北省', '河北', '130200', '唐山市', '130227', '迁西县', '1', '华北');
INSERT INTO `city` VALUES ('130229', '玉田县', '130000', '河北省', '河北', '130200', '唐山市', '130229', '玉田县', '1', '华北');
INSERT INTO `city` VALUES ('130281', '遵化市', '130000', '河北省', '河北', '130200', '唐山市', '130281', '遵化市', '1', '华北');
INSERT INTO `city` VALUES ('130283', '迁安市', '130000', '河北省', '河北', '130200', '唐山市', '130283', '迁安市', '1', '华北');
INSERT INTO `city` VALUES ('130300', '秦皇岛市', '130000', '河北省', '河北', '130300', '秦皇岛市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130301', '市辖区', '130000', '河北省', '河北', '130300', '秦皇岛市', '130301', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130302', '海港区', '130000', '河北省', '河北', '130300', '秦皇岛市', '130302', '海港区', '1', '华北');
INSERT INTO `city` VALUES ('130303', '山海关区', '130000', '河北省', '河北', '130300', '秦皇岛市', '130303', '山海关区', '1', '华北');
INSERT INTO `city` VALUES ('130304', '北戴河区', '130000', '河北省', '河北', '130300', '秦皇岛市', '130304', '北戴河区', '1', '华北');
INSERT INTO `city` VALUES ('130321', '青龙满族自治县', '130000', '河北省', '河北', '130300', '秦皇岛市', '130321', '青龙满族自治县', '1', '华北');
INSERT INTO `city` VALUES ('130322', '昌黎县', '130000', '河北省', '河北', '130300', '秦皇岛市', '130322', '昌黎县', '1', '华北');
INSERT INTO `city` VALUES ('130323', '抚宁县', '130000', '河北省', '河北', '130300', '秦皇岛市', '130323', '抚宁县', '1', '华北');
INSERT INTO `city` VALUES ('130324', '卢龙县', '130000', '河北省', '河北', '130300', '秦皇岛市', '130324', '卢龙县', '1', '华北');
INSERT INTO `city` VALUES ('130400', '邯郸市', '130000', '河北省', '河北', '130400', '邯郸市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130401', '市辖区', '130000', '河北省', '河北', '130400', '邯郸市', '130401', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130402', '邯山区', '130000', '河北省', '河北', '130400', '邯郸市', '130402', '邯山区', '1', '华北');
INSERT INTO `city` VALUES ('130403', '丛台区', '130000', '河北省', '河北', '130400', '邯郸市', '130403', '丛台区', '1', '华北');
INSERT INTO `city` VALUES ('130404', '复兴区', '130000', '河北省', '河北', '130400', '邯郸市', '130404', '复兴区', '1', '华北');
INSERT INTO `city` VALUES ('130406', '峰峰矿区', '130000', '河北省', '河北', '130400', '邯郸市', '130406', '峰峰矿区', '1', '华北');
INSERT INTO `city` VALUES ('130421', '邯郸县', '130000', '河北省', '河北', '130400', '邯郸市', '130421', '邯郸县', '1', '华北');
INSERT INTO `city` VALUES ('130423', '临漳县', '130000', '河北省', '河北', '130400', '邯郸市', '130423', '临漳县', '1', '华北');
INSERT INTO `city` VALUES ('130424', '成安县', '130000', '河北省', '河北', '130400', '邯郸市', '130424', '成安县', '1', '华北');
INSERT INTO `city` VALUES ('130425', '大名县', '130000', '河北省', '河北', '130400', '邯郸市', '130425', '大名县', '1', '华北');
INSERT INTO `city` VALUES ('130426', '涉县', '130000', '河北省', '河北', '130400', '邯郸市', '130426', '涉县', '1', '华北');
INSERT INTO `city` VALUES ('130427', '磁县', '130000', '河北省', '河北', '130400', '邯郸市', '130427', '磁县', '1', '华北');
INSERT INTO `city` VALUES ('130428', '肥乡县', '130000', '河北省', '河北', '130400', '邯郸市', '130428', '肥乡县', '1', '华北');
INSERT INTO `city` VALUES ('130429', '永年县', '130000', '河北省', '河北', '130400', '邯郸市', '130429', '永年县', '1', '华北');
INSERT INTO `city` VALUES ('130430', '邱县', '130000', '河北省', '河北', '130400', '邯郸市', '130430', '邱县', '1', '华北');
INSERT INTO `city` VALUES ('130431', '鸡泽县', '130000', '河北省', '河北', '130400', '邯郸市', '130431', '鸡泽县', '1', '华北');
INSERT INTO `city` VALUES ('130432', '广平县', '130000', '河北省', '河北', '130400', '邯郸市', '130432', '广平县', '1', '华北');
INSERT INTO `city` VALUES ('130433', '馆陶县', '130000', '河北省', '河北', '130400', '邯郸市', '130433', '馆陶县', '1', '华北');
INSERT INTO `city` VALUES ('130434', '魏县', '130000', '河北省', '河北', '130400', '邯郸市', '130434', '魏县', '1', '华北');
INSERT INTO `city` VALUES ('130435', '曲周县', '130000', '河北省', '河北', '130400', '邯郸市', '130435', '曲周县', '1', '华北');
INSERT INTO `city` VALUES ('130481', '武安市', '130000', '河北省', '河北', '130400', '邯郸市', '130481', '武安市', '1', '华北');
INSERT INTO `city` VALUES ('130500', '邢台市', '130000', '河北省', '河北', '130500', '邢台市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130501', '市辖区', '130000', '河北省', '河北', '130500', '邢台市', '130501', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130502', '桥东区', '130000', '河北省', '河北', '130500', '邢台市', '130502', '桥东区', '1', '华北');
INSERT INTO `city` VALUES ('130503', '桥西区', '130000', '河北省', '河北', '130500', '邢台市', '130503', '桥西区', '1', '华北');
INSERT INTO `city` VALUES ('130521', '邢台县', '130000', '河北省', '河北', '130500', '邢台市', '130521', '邢台县', '1', '华北');
INSERT INTO `city` VALUES ('130522', '临城县', '130000', '河北省', '河北', '130500', '邢台市', '130522', '临城县', '1', '华北');
INSERT INTO `city` VALUES ('130523', '内丘县', '130000', '河北省', '河北', '130500', '邢台市', '130523', '内丘县', '1', '华北');
INSERT INTO `city` VALUES ('130524', '柏乡县', '130000', '河北省', '河北', '130500', '邢台市', '130524', '柏乡县', '1', '华北');
INSERT INTO `city` VALUES ('130525', '隆尧县', '130000', '河北省', '河北', '130500', '邢台市', '130525', '隆尧县', '1', '华北');
INSERT INTO `city` VALUES ('130526', '任县', '130000', '河北省', '河北', '130500', '邢台市', '130526', '任县', '1', '华北');
INSERT INTO `city` VALUES ('130527', '南和县', '130000', '河北省', '河北', '130500', '邢台市', '130527', '南和县', '1', '华北');
INSERT INTO `city` VALUES ('130528', '宁晋县', '130000', '河北省', '河北', '130500', '邢台市', '130528', '宁晋县', '1', '华北');
INSERT INTO `city` VALUES ('130529', '巨鹿县', '130000', '河北省', '河北', '130500', '邢台市', '130529', '巨鹿县', '1', '华北');
INSERT INTO `city` VALUES ('130530', '新河县', '130000', '河北省', '河北', '130500', '邢台市', '130530', '新河县', '1', '华北');
INSERT INTO `city` VALUES ('130531', '广宗县', '130000', '河北省', '河北', '130500', '邢台市', '130531', '广宗县', '1', '华北');
INSERT INTO `city` VALUES ('130532', '平乡县', '130000', '河北省', '河北', '130500', '邢台市', '130532', '平乡县', '1', '华北');
INSERT INTO `city` VALUES ('130533', '威县', '130000', '河北省', '河北', '130500', '邢台市', '130533', '威县', '1', '华北');
INSERT INTO `city` VALUES ('130534', '清河县', '130000', '河北省', '河北', '130500', '邢台市', '130534', '清河县', '1', '华北');
INSERT INTO `city` VALUES ('130535', '临西县', '130000', '河北省', '河北', '130500', '邢台市', '130535', '临西县', '1', '华北');
INSERT INTO `city` VALUES ('130581', '南宫市', '130000', '河北省', '河北', '130500', '邢台市', '130581', '南宫市', '1', '华北');
INSERT INTO `city` VALUES ('130582', '沙河市', '130000', '河北省', '河北', '130500', '邢台市', '130582', '沙河市', '1', '华北');
INSERT INTO `city` VALUES ('130600', '保定市', '130000', '河北省', '河北', '130600', '保定市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130601', '市辖区', '130000', '河北省', '河北', '130600', '保定市', '130601', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130602', '新市区', '130000', '河北省', '河北', '130600', '保定市', '130602', '新市区', '1', '华北');
INSERT INTO `city` VALUES ('130603', '北市区', '130000', '河北省', '河北', '130600', '保定市', '130603', '北市区', '1', '华北');
INSERT INTO `city` VALUES ('130604', '南市区', '130000', '河北省', '河北', '130600', '保定市', '130604', '南市区', '1', '华北');
INSERT INTO `city` VALUES ('130621', '满城县', '130000', '河北省', '河北', '130600', '保定市', '130621', '满城县', '1', '华北');
INSERT INTO `city` VALUES ('130622', '清苑县', '130000', '河北省', '河北', '130600', '保定市', '130622', '清苑县', '1', '华北');
INSERT INTO `city` VALUES ('130623', '涞水县', '130000', '河北省', '河北', '130600', '保定市', '130623', '涞水县', '1', '华北');
INSERT INTO `city` VALUES ('130624', '阜平县', '130000', '河北省', '河北', '130600', '保定市', '130624', '阜平县', '1', '华北');
INSERT INTO `city` VALUES ('130625', '徐水县', '130000', '河北省', '河北', '130600', '保定市', '130625', '徐水县', '1', '华北');
INSERT INTO `city` VALUES ('130626', '定兴县', '130000', '河北省', '河北', '130600', '保定市', '130626', '定兴县', '1', '华北');
INSERT INTO `city` VALUES ('130627', '唐县', '130000', '河北省', '河北', '130600', '保定市', '130627', '唐县', '1', '华北');
INSERT INTO `city` VALUES ('130628', '高阳县', '130000', '河北省', '河北', '130600', '保定市', '130628', '高阳县', '1', '华北');
INSERT INTO `city` VALUES ('130629', '容城县', '130000', '河北省', '河北', '130600', '保定市', '130629', '容城县', '1', '华北');
INSERT INTO `city` VALUES ('130630', '涞源县', '130000', '河北省', '河北', '130600', '保定市', '130630', '涞源县', '1', '华北');
INSERT INTO `city` VALUES ('130631', '望都县', '130000', '河北省', '河北', '130600', '保定市', '130631', '望都县', '1', '华北');
INSERT INTO `city` VALUES ('130632', '安新县', '130000', '河北省', '河北', '130600', '保定市', '130632', '安新县', '1', '华北');
INSERT INTO `city` VALUES ('130633', '易县', '130000', '河北省', '河北', '130600', '保定市', '130633', '易县', '1', '华北');
INSERT INTO `city` VALUES ('130634', '曲阳县', '130000', '河北省', '河北', '130600', '保定市', '130634', '曲阳县', '1', '华北');
INSERT INTO `city` VALUES ('130635', '蠡县', '130000', '河北省', '河北', '130600', '保定市', '130635', '蠡县', '1', '华北');
INSERT INTO `city` VALUES ('130636', '顺平县', '130000', '河北省', '河北', '130600', '保定市', '130636', '顺平县', '1', '华北');
INSERT INTO `city` VALUES ('130637', '博野县', '130000', '河北省', '河北', '130600', '保定市', '130637', '博野县', '1', '华北');
INSERT INTO `city` VALUES ('130638', '雄县', '130000', '河北省', '河北', '130600', '保定市', '130638', '雄县', '1', '华北');
INSERT INTO `city` VALUES ('130681', '涿州市', '130000', '河北省', '河北', '130600', '保定市', '130681', '涿州市', '1', '华北');
INSERT INTO `city` VALUES ('130682', '定州市', '130000', '河北省', '河北', '130600', '保定市', '130682', '定州市', '1', '华北');
INSERT INTO `city` VALUES ('130683', '安国市', '130000', '河北省', '河北', '130600', '保定市', '130683', '安国市', '1', '华北');
INSERT INTO `city` VALUES ('130684', '高碑店市', '130000', '河北省', '河北', '130600', '保定市', '130684', '高碑店市', '1', '华北');
INSERT INTO `city` VALUES ('130700', '张家口市', '130000', '河北省', '河北', '130700', '张家口市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130701', '市辖区', '130000', '河北省', '河北', '130700', '张家口市', '130701', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130702', '桥东区', '130000', '河北省', '河北', '130700', '张家口市', '130702', '桥东区', '1', '华北');
INSERT INTO `city` VALUES ('130703', '桥西区', '130000', '河北省', '河北', '130700', '张家口市', '130703', '桥西区', '1', '华北');
INSERT INTO `city` VALUES ('130705', '宣化区', '130000', '河北省', '河北', '130700', '张家口市', '130705', '宣化区', '1', '华北');
INSERT INTO `city` VALUES ('130706', '下花园区', '130000', '河北省', '河北', '130700', '张家口市', '130706', '下花园区', '1', '华北');
INSERT INTO `city` VALUES ('130721', '宣化县', '130000', '河北省', '河北', '130700', '张家口市', '130721', '宣化县', '1', '华北');
INSERT INTO `city` VALUES ('130722', '张北县', '130000', '河北省', '河北', '130700', '张家口市', '130722', '张北县', '1', '华北');
INSERT INTO `city` VALUES ('130723', '康保县', '130000', '河北省', '河北', '130700', '张家口市', '130723', '康保县', '1', '华北');
INSERT INTO `city` VALUES ('130724', '沽源县', '130000', '河北省', '河北', '130700', '张家口市', '130724', '沽源县', '1', '华北');
INSERT INTO `city` VALUES ('130725', '尚义县', '130000', '河北省', '河北', '130700', '张家口市', '130725', '尚义县', '1', '华北');
INSERT INTO `city` VALUES ('130726', '蔚县', '130000', '河北省', '河北', '130700', '张家口市', '130726', '蔚县', '1', '华北');
INSERT INTO `city` VALUES ('130727', '阳原县', '130000', '河北省', '河北', '130700', '张家口市', '130727', '阳原县', '1', '华北');
INSERT INTO `city` VALUES ('130728', '怀安县', '130000', '河北省', '河北', '130700', '张家口市', '130728', '怀安县', '1', '华北');
INSERT INTO `city` VALUES ('130729', '万全县', '130000', '河北省', '河北', '130700', '张家口市', '130729', '万全县', '1', '华北');
INSERT INTO `city` VALUES ('130730', '怀来县', '130000', '河北省', '河北', '130700', '张家口市', '130730', '怀来县', '1', '华北');
INSERT INTO `city` VALUES ('130731', '涿鹿县', '130000', '河北省', '河北', '130700', '张家口市', '130731', '涿鹿县', '1', '华北');
INSERT INTO `city` VALUES ('130732', '赤城县', '130000', '河北省', '河北', '130700', '张家口市', '130732', '赤城县', '1', '华北');
INSERT INTO `city` VALUES ('130733', '崇礼县', '130000', '河北省', '河北', '130700', '张家口市', '130733', '崇礼县', '1', '华北');
INSERT INTO `city` VALUES ('130800', '承德市', '130000', '河北省', '河北', '130800', '承德市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130801', '市辖区', '130000', '河北省', '河北', '130800', '承德市', '130801', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130802', '双桥区', '130000', '河北省', '河北', '130800', '承德市', '130802', '双桥区', '1', '华北');
INSERT INTO `city` VALUES ('130803', '双滦区', '130000', '河北省', '河北', '130800', '承德市', '130803', '双滦区', '1', '华北');
INSERT INTO `city` VALUES ('130804', '鹰手营子矿区', '130000', '河北省', '河北', '130800', '承德市', '130804', '鹰手营子矿区', '1', '华北');
INSERT INTO `city` VALUES ('130821', '承德县', '130000', '河北省', '河北', '130800', '承德市', '130821', '承德县', '1', '华北');
INSERT INTO `city` VALUES ('130822', '兴隆县', '130000', '河北省', '河北', '130800', '承德市', '130822', '兴隆县', '1', '华北');
INSERT INTO `city` VALUES ('130823', '平泉县', '130000', '河北省', '河北', '130800', '承德市', '130823', '平泉县', '1', '华北');
INSERT INTO `city` VALUES ('130824', '滦平县', '130000', '河北省', '河北', '130800', '承德市', '130824', '滦平县', '1', '华北');
INSERT INTO `city` VALUES ('130825', '隆化县', '130000', '河北省', '河北', '130800', '承德市', '130825', '隆化县', '1', '华北');
INSERT INTO `city` VALUES ('130826', '丰宁满族自治县', '130000', '河北省', '河北', '130800', '承德市', '130826', '丰宁满族自治县', '1', '华北');
INSERT INTO `city` VALUES ('130827', '宽城满族自治县', '130000', '河北省', '河北', '130800', '承德市', '130827', '宽城满族自治县', '1', '华北');
INSERT INTO `city` VALUES ('130828', '围场满族蒙古族自治县', '130000', '河北省', '河北', '130800', '承德市', '130828', '围场满族蒙古族自治县', '1', '华北');
INSERT INTO `city` VALUES ('130900', '沧州市', '130000', '河北省', '河北', '130900', '沧州市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('130901', '市辖区', '130000', '河北省', '河北', '130900', '沧州市', '130901', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('130902', '新华区', '130000', '河北省', '河北', '130900', '沧州市', '130902', '新华区', '1', '华北');
INSERT INTO `city` VALUES ('130903', '运河区', '130000', '河北省', '河北', '130900', '沧州市', '130903', '运河区', '1', '华北');
INSERT INTO `city` VALUES ('130921', '沧县', '130000', '河北省', '河北', '130900', '沧州市', '130921', '沧县', '1', '华北');
INSERT INTO `city` VALUES ('130922', '青县', '130000', '河北省', '河北', '130900', '沧州市', '130922', '青县', '1', '华北');
INSERT INTO `city` VALUES ('130923', '东光县', '130000', '河北省', '河北', '130900', '沧州市', '130923', '东光县', '1', '华北');
INSERT INTO `city` VALUES ('130924', '海兴县', '130000', '河北省', '河北', '130900', '沧州市', '130924', '海兴县', '1', '华北');
INSERT INTO `city` VALUES ('130925', '盐山县', '130000', '河北省', '河北', '130900', '沧州市', '130925', '盐山县', '1', '华北');
INSERT INTO `city` VALUES ('130926', '肃宁县', '130000', '河北省', '河北', '130900', '沧州市', '130926', '肃宁县', '1', '华北');
INSERT INTO `city` VALUES ('130927', '南皮县', '130000', '河北省', '河北', '130900', '沧州市', '130927', '南皮县', '1', '华北');
INSERT INTO `city` VALUES ('130928', '吴桥县', '130000', '河北省', '河北', '130900', '沧州市', '130928', '吴桥县', '1', '华北');
INSERT INTO `city` VALUES ('130929', '献县', '130000', '河北省', '河北', '130900', '沧州市', '130929', '献县', '1', '华北');
INSERT INTO `city` VALUES ('130930', '孟村回族自治县', '130000', '河北省', '河北', '130900', '沧州市', '130930', '孟村回族自治县', '1', '华北');
INSERT INTO `city` VALUES ('130981', '泊头市', '130000', '河北省', '河北', '130900', '沧州市', '130981', '泊头市', '1', '华北');
INSERT INTO `city` VALUES ('130982', '任丘市', '130000', '河北省', '河北', '130900', '沧州市', '130982', '任丘市', '1', '华北');
INSERT INTO `city` VALUES ('130983', '黄骅市', '130000', '河北省', '河北', '130900', '沧州市', '130983', '黄骅市', '1', '华北');
INSERT INTO `city` VALUES ('130984', '河间市', '130000', '河北省', '河北', '130900', '沧州市', '130984', '河间市', '1', '华北');
INSERT INTO `city` VALUES ('131000', '廊坊市', '130000', '河北省', '河北', '131000', '廊坊市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('131001', '市辖区', '130000', '河北省', '河北', '131000', '廊坊市', '131001', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('131002', '安次区', '130000', '河北省', '河北', '131000', '廊坊市', '131002', '安次区', '1', '华北');
INSERT INTO `city` VALUES ('131003', '广阳区', '130000', '河北省', '河北', '131000', '廊坊市', '131003', '广阳区', '1', '华北');
INSERT INTO `city` VALUES ('131022', '固安县', '130000', '河北省', '河北', '131000', '廊坊市', '131022', '固安县', '1', '华北');
INSERT INTO `city` VALUES ('131023', '永清县', '130000', '河北省', '河北', '131000', '廊坊市', '131023', '永清县', '1', '华北');
INSERT INTO `city` VALUES ('131024', '香河县', '130000', '河北省', '河北', '131000', '廊坊市', '131024', '香河县', '1', '华北');
INSERT INTO `city` VALUES ('131025', '大城县', '130000', '河北省', '河北', '131000', '廊坊市', '131025', '大城县', '1', '华北');
INSERT INTO `city` VALUES ('131026', '文安县', '130000', '河北省', '河北', '131000', '廊坊市', '131026', '文安县', '1', '华北');
INSERT INTO `city` VALUES ('131028', '大厂回族自治县', '130000', '河北省', '河北', '131000', '廊坊市', '131028', '大厂回族自治县', '1', '华北');
INSERT INTO `city` VALUES ('131081', '霸州市', '130000', '河北省', '河北', '131000', '廊坊市', '131081', '霸州市', '1', '华北');
INSERT INTO `city` VALUES ('131082', '三河市', '130000', '河北省', '河北', '131000', '廊坊市', '131082', '三河市', '1', '华北');
INSERT INTO `city` VALUES ('131100', '衡水市', '130000', '河北省', '河北', '131100', '衡水市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('131101', '市辖区', '130000', '河北省', '河北', '131100', '衡水市', '131101', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('131102', '桃城区', '130000', '河北省', '河北', '131100', '衡水市', '131102', '桃城区', '1', '华北');
INSERT INTO `city` VALUES ('131121', '枣强县', '130000', '河北省', '河北', '131100', '衡水市', '131121', '枣强县', '1', '华北');
INSERT INTO `city` VALUES ('131122', '武邑县', '130000', '河北省', '河北', '131100', '衡水市', '131122', '武邑县', '1', '华北');
INSERT INTO `city` VALUES ('131123', '武强县', '130000', '河北省', '河北', '131100', '衡水市', '131123', '武强县', '1', '华北');
INSERT INTO `city` VALUES ('131124', '饶阳县', '130000', '河北省', '河北', '131100', '衡水市', '131124', '饶阳县', '1', '华北');
INSERT INTO `city` VALUES ('131125', '安平县', '130000', '河北省', '河北', '131100', '衡水市', '131125', '安平县', '1', '华北');
INSERT INTO `city` VALUES ('131126', '故城县', '130000', '河北省', '河北', '131100', '衡水市', '131126', '故城县', '1', '华北');
INSERT INTO `city` VALUES ('131127', '景县', '130000', '河北省', '河北', '131100', '衡水市', '131127', '景县', '1', '华北');
INSERT INTO `city` VALUES ('131128', '阜城县', '130000', '河北省', '河北', '131100', '衡水市', '131128', '阜城县', '1', '华北');
INSERT INTO `city` VALUES ('131181', '冀州市', '130000', '河北省', '河北', '131100', '衡水市', '131181', '冀州市', '1', '华北');
INSERT INTO `city` VALUES ('131182', '深州市', '130000', '河北省', '河北', '131100', '衡水市', '131182', '深州市', '1', '华北');
INSERT INTO `city` VALUES ('140000', '山西省', '140000', '山西省', '山西', '0', '', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140100', '太原市', '140000', '山西省', '山西', '140100', '太原市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140101', '市辖区', '140000', '山西省', '山西', '140100', '太原市', '140101', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140105', '小店区', '140000', '山西省', '山西', '140100', '太原市', '140105', '小店区', '1', '华北');
INSERT INTO `city` VALUES ('140106', '迎泽区', '140000', '山西省', '山西', '140100', '太原市', '140106', '迎泽区', '1', '华北');
INSERT INTO `city` VALUES ('140107', '杏花岭区', '140000', '山西省', '山西', '140100', '太原市', '140107', '杏花岭区', '1', '华北');
INSERT INTO `city` VALUES ('140108', '尖草坪区', '140000', '山西省', '山西', '140100', '太原市', '140108', '尖草坪区', '1', '华北');
INSERT INTO `city` VALUES ('140109', '万柏林区', '140000', '山西省', '山西', '140100', '太原市', '140109', '万柏林区', '1', '华北');
INSERT INTO `city` VALUES ('140110', '晋源区', '140000', '山西省', '山西', '140100', '太原市', '140110', '晋源区', '1', '华北');
INSERT INTO `city` VALUES ('140121', '清徐县', '140000', '山西省', '山西', '140100', '太原市', '140121', '清徐县', '1', '华北');
INSERT INTO `city` VALUES ('140122', '阳曲县', '140000', '山西省', '山西', '140100', '太原市', '140122', '阳曲县', '1', '华北');
INSERT INTO `city` VALUES ('140123', '娄烦县', '140000', '山西省', '山西', '140100', '太原市', '140123', '娄烦县', '1', '华北');
INSERT INTO `city` VALUES ('140181', '古交市', '140000', '山西省', '山西', '140100', '太原市', '140181', '古交市', '1', '华北');
INSERT INTO `city` VALUES ('140200', '大同市', '140000', '山西省', '山西', '140200', '大同市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140201', '市辖区', '140000', '山西省', '山西', '140200', '大同市', '140201', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140202', '城区', '140000', '山西省', '山西', '140200', '大同市', '140202', '城区', '1', '华北');
INSERT INTO `city` VALUES ('140203', '矿区', '140000', '山西省', '山西', '140200', '大同市', '140203', '矿区', '1', '华北');
INSERT INTO `city` VALUES ('140211', '南郊区', '140000', '山西省', '山西', '140200', '大同市', '140211', '南郊区', '1', '华北');
INSERT INTO `city` VALUES ('140212', '新荣区', '140000', '山西省', '山西', '140200', '大同市', '140212', '新荣区', '1', '华北');
INSERT INTO `city` VALUES ('140221', '阳高县', '140000', '山西省', '山西', '140200', '大同市', '140221', '阳高县', '1', '华北');
INSERT INTO `city` VALUES ('140222', '天镇县', '140000', '山西省', '山西', '140200', '大同市', '140222', '天镇县', '1', '华北');
INSERT INTO `city` VALUES ('140223', '广灵县', '140000', '山西省', '山西', '140200', '大同市', '140223', '广灵县', '1', '华北');
INSERT INTO `city` VALUES ('140224', '灵丘县', '140000', '山西省', '山西', '140200', '大同市', '140224', '灵丘县', '1', '华北');
INSERT INTO `city` VALUES ('140225', '浑源县', '140000', '山西省', '山西', '140200', '大同市', '140225', '浑源县', '1', '华北');
INSERT INTO `city` VALUES ('140226', '左云县', '140000', '山西省', '山西', '140200', '大同市', '140226', '左云县', '1', '华北');
INSERT INTO `city` VALUES ('140227', '大同县', '140000', '山西省', '山西', '140200', '大同市', '140227', '大同县', '1', '华北');
INSERT INTO `city` VALUES ('140300', '阳泉市', '140000', '山西省', '山西', '140300', '阳泉市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140301', '市辖区', '140000', '山西省', '山西', '140300', '阳泉市', '140301', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140302', '城区', '140000', '山西省', '山西', '140300', '阳泉市', '140302', '城区', '1', '华北');
INSERT INTO `city` VALUES ('140303', '矿区', '140000', '山西省', '山西', '140300', '阳泉市', '140303', '矿区', '1', '华北');
INSERT INTO `city` VALUES ('140311', '郊区', '140000', '山西省', '山西', '140300', '阳泉市', '140311', '郊区', '1', '华北');
INSERT INTO `city` VALUES ('140321', '平定县', '140000', '山西省', '山西', '140300', '阳泉市', '140321', '平定县', '1', '华北');
INSERT INTO `city` VALUES ('140322', '盂县', '140000', '山西省', '山西', '140300', '阳泉市', '140322', '盂县', '1', '华北');
INSERT INTO `city` VALUES ('140400', '长治市', '140000', '山西省', '山西', '140400', '长治市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140401', '市辖区', '140000', '山西省', '山西', '140400', '长治市', '140401', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140402', '城区', '140000', '山西省', '山西', '140400', '长治市', '140402', '城区', '1', '华北');
INSERT INTO `city` VALUES ('140411', '郊区', '140000', '山西省', '山西', '140400', '长治市', '140411', '郊区', '1', '华北');
INSERT INTO `city` VALUES ('140421', '长治县', '140000', '山西省', '山西', '140400', '长治市', '140421', '长治县', '1', '华北');
INSERT INTO `city` VALUES ('140423', '襄垣县', '140000', '山西省', '山西', '140400', '长治市', '140423', '襄垣县', '1', '华北');
INSERT INTO `city` VALUES ('140424', '屯留县', '140000', '山西省', '山西', '140400', '长治市', '140424', '屯留县', '1', '华北');
INSERT INTO `city` VALUES ('140425', '平顺县', '140000', '山西省', '山西', '140400', '长治市', '140425', '平顺县', '1', '华北');
INSERT INTO `city` VALUES ('140426', '黎城县', '140000', '山西省', '山西', '140400', '长治市', '140426', '黎城县', '1', '华北');
INSERT INTO `city` VALUES ('140427', '壶关县', '140000', '山西省', '山西', '140400', '长治市', '140427', '壶关县', '1', '华北');
INSERT INTO `city` VALUES ('140428', '长子县', '140000', '山西省', '山西', '140400', '长治市', '140428', '长子县', '1', '华北');
INSERT INTO `city` VALUES ('140429', '武乡县', '140000', '山西省', '山西', '140400', '长治市', '140429', '武乡县', '1', '华北');
INSERT INTO `city` VALUES ('140430', '沁县', '140000', '山西省', '山西', '140400', '长治市', '140430', '沁县', '1', '华北');
INSERT INTO `city` VALUES ('140431', '沁源县', '140000', '山西省', '山西', '140400', '长治市', '140431', '沁源县', '1', '华北');
INSERT INTO `city` VALUES ('140481', '潞城市', '140000', '山西省', '山西', '140400', '长治市', '140481', '潞城市', '1', '华北');
INSERT INTO `city` VALUES ('140500', '晋城市', '140000', '山西省', '山西', '140500', '晋城市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140501', '市辖区', '140000', '山西省', '山西', '140500', '晋城市', '140501', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140502', '城区', '140000', '山西省', '山西', '140500', '晋城市', '140502', '城区', '1', '华北');
INSERT INTO `city` VALUES ('140521', '沁水县', '140000', '山西省', '山西', '140500', '晋城市', '140521', '沁水县', '1', '华北');
INSERT INTO `city` VALUES ('140522', '阳城县', '140000', '山西省', '山西', '140500', '晋城市', '140522', '阳城县', '1', '华北');
INSERT INTO `city` VALUES ('140524', '陵川县', '140000', '山西省', '山西', '140500', '晋城市', '140524', '陵川县', '1', '华北');
INSERT INTO `city` VALUES ('140525', '泽州县', '140000', '山西省', '山西', '140500', '晋城市', '140525', '泽州县', '1', '华北');
INSERT INTO `city` VALUES ('140581', '高平市', '140000', '山西省', '山西', '140500', '晋城市', '140581', '高平市', '1', '华北');
INSERT INTO `city` VALUES ('140600', '朔州市', '140000', '山西省', '山西', '140600', '朔州市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140601', '市辖区', '140000', '山西省', '山西', '140600', '朔州市', '140601', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140602', '朔城区', '140000', '山西省', '山西', '140600', '朔州市', '140602', '朔城区', '1', '华北');
INSERT INTO `city` VALUES ('140603', '平鲁区', '140000', '山西省', '山西', '140600', '朔州市', '140603', '平鲁区', '1', '华北');
INSERT INTO `city` VALUES ('140621', '山阴县', '140000', '山西省', '山西', '140600', '朔州市', '140621', '山阴县', '1', '华北');
INSERT INTO `city` VALUES ('140622', '应县', '140000', '山西省', '山西', '140600', '朔州市', '140622', '应县', '1', '华北');
INSERT INTO `city` VALUES ('140623', '右玉县', '140000', '山西省', '山西', '140600', '朔州市', '140623', '右玉县', '1', '华北');
INSERT INTO `city` VALUES ('140624', '怀仁县', '140000', '山西省', '山西', '140600', '朔州市', '140624', '怀仁县', '1', '华北');
INSERT INTO `city` VALUES ('140700', '晋中市', '140000', '山西省', '山西', '140700', '晋中市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140701', '市辖区', '140000', '山西省', '山西', '140700', '晋中市', '140701', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140702', '榆次区', '140000', '山西省', '山西', '140700', '晋中市', '140702', '榆次区', '1', '华北');
INSERT INTO `city` VALUES ('140721', '榆社县', '140000', '山西省', '山西', '140700', '晋中市', '140721', '榆社县', '1', '华北');
INSERT INTO `city` VALUES ('140722', '左权县', '140000', '山西省', '山西', '140700', '晋中市', '140722', '左权县', '1', '华北');
INSERT INTO `city` VALUES ('140723', '和顺县', '140000', '山西省', '山西', '140700', '晋中市', '140723', '和顺县', '1', '华北');
INSERT INTO `city` VALUES ('140724', '昔阳县', '140000', '山西省', '山西', '140700', '晋中市', '140724', '昔阳县', '1', '华北');
INSERT INTO `city` VALUES ('140725', '寿阳县', '140000', '山西省', '山西', '140700', '晋中市', '140725', '寿阳县', '1', '华北');
INSERT INTO `city` VALUES ('140726', '太谷县', '140000', '山西省', '山西', '140700', '晋中市', '140726', '太谷县', '1', '华北');
INSERT INTO `city` VALUES ('140727', '祁县', '140000', '山西省', '山西', '140700', '晋中市', '140727', '祁县', '1', '华北');
INSERT INTO `city` VALUES ('140728', '平遥县', '140000', '山西省', '山西', '140700', '晋中市', '140728', '平遥县', '1', '华北');
INSERT INTO `city` VALUES ('140729', '灵石县', '140000', '山西省', '山西', '140700', '晋中市', '140729', '灵石县', '1', '华北');
INSERT INTO `city` VALUES ('140781', '介休市', '140000', '山西省', '山西', '140700', '晋中市', '140781', '介休市', '1', '华北');
INSERT INTO `city` VALUES ('140800', '运城市', '140000', '山西省', '山西', '140800', '运城市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140801', '市辖区', '140000', '山西省', '山西', '140800', '运城市', '140801', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140802', '盐湖区', '140000', '山西省', '山西', '140800', '运城市', '140802', '盐湖区', '1', '华北');
INSERT INTO `city` VALUES ('140821', '临猗县', '140000', '山西省', '山西', '140800', '运城市', '140821', '临猗县', '1', '华北');
INSERT INTO `city` VALUES ('140822', '万荣县', '140000', '山西省', '山西', '140800', '运城市', '140822', '万荣县', '1', '华北');
INSERT INTO `city` VALUES ('140823', '闻喜县', '140000', '山西省', '山西', '140800', '运城市', '140823', '闻喜县', '1', '华北');
INSERT INTO `city` VALUES ('140824', '稷山县', '140000', '山西省', '山西', '140800', '运城市', '140824', '稷山县', '1', '华北');
INSERT INTO `city` VALUES ('140825', '新绛县', '140000', '山西省', '山西', '140800', '运城市', '140825', '新绛县', '1', '华北');
INSERT INTO `city` VALUES ('140826', '绛县', '140000', '山西省', '山西', '140800', '运城市', '140826', '绛县', '1', '华北');
INSERT INTO `city` VALUES ('140827', '垣曲县', '140000', '山西省', '山西', '140800', '运城市', '140827', '垣曲县', '1', '华北');
INSERT INTO `city` VALUES ('140828', '夏县', '140000', '山西省', '山西', '140800', '运城市', '140828', '夏县', '1', '华北');
INSERT INTO `city` VALUES ('140829', '平陆县', '140000', '山西省', '山西', '140800', '运城市', '140829', '平陆县', '1', '华北');
INSERT INTO `city` VALUES ('140830', '芮城县', '140000', '山西省', '山西', '140800', '运城市', '140830', '芮城县', '1', '华北');
INSERT INTO `city` VALUES ('140881', '永济市', '140000', '山西省', '山西', '140800', '运城市', '140881', '永济市', '1', '华北');
INSERT INTO `city` VALUES ('140882', '河津市', '140000', '山西省', '山西', '140800', '运城市', '140882', '河津市', '1', '华北');
INSERT INTO `city` VALUES ('140900', '忻州市', '140000', '山西省', '山西', '140900', '忻州市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('140901', '市辖区', '140000', '山西省', '山西', '140900', '忻州市', '140901', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('140902', '忻府区', '140000', '山西省', '山西', '140900', '忻州市', '140902', '忻府区', '1', '华北');
INSERT INTO `city` VALUES ('140921', '定襄县', '140000', '山西省', '山西', '140900', '忻州市', '140921', '定襄县', '1', '华北');
INSERT INTO `city` VALUES ('140922', '五台县', '140000', '山西省', '山西', '140900', '忻州市', '140922', '五台县', '1', '华北');
INSERT INTO `city` VALUES ('140923', '代县', '140000', '山西省', '山西', '140900', '忻州市', '140923', '代县', '1', '华北');
INSERT INTO `city` VALUES ('140924', '繁峙县', '140000', '山西省', '山西', '140900', '忻州市', '140924', '繁峙县', '1', '华北');
INSERT INTO `city` VALUES ('140925', '宁武县', '140000', '山西省', '山西', '140900', '忻州市', '140925', '宁武县', '1', '华北');
INSERT INTO `city` VALUES ('140926', '静乐县', '140000', '山西省', '山西', '140900', '忻州市', '140926', '静乐县', '1', '华北');
INSERT INTO `city` VALUES ('140927', '神池县', '140000', '山西省', '山西', '140900', '忻州市', '140927', '神池县', '1', '华北');
INSERT INTO `city` VALUES ('140928', '五寨县', '140000', '山西省', '山西', '140900', '忻州市', '140928', '五寨县', '1', '华北');
INSERT INTO `city` VALUES ('140929', '岢岚县', '140000', '山西省', '山西', '140900', '忻州市', '140929', '岢岚县', '1', '华北');
INSERT INTO `city` VALUES ('140930', '河曲县', '140000', '山西省', '山西', '140900', '忻州市', '140930', '河曲县', '1', '华北');
INSERT INTO `city` VALUES ('140931', '保德县', '140000', '山西省', '山西', '140900', '忻州市', '140931', '保德县', '1', '华北');
INSERT INTO `city` VALUES ('140932', '偏关县', '140000', '山西省', '山西', '140900', '忻州市', '140932', '偏关县', '1', '华北');
INSERT INTO `city` VALUES ('140981', '原平市', '140000', '山西省', '山西', '140900', '忻州市', '140981', '原平市', '1', '华北');
INSERT INTO `city` VALUES ('141000', '临汾市', '140000', '山西省', '山西', '141000', '临汾市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('141001', '市辖区', '140000', '山西省', '山西', '141000', '临汾市', '141001', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('141002', '尧都区', '140000', '山西省', '山西', '141000', '临汾市', '141002', '尧都区', '1', '华北');
INSERT INTO `city` VALUES ('141021', '曲沃县', '140000', '山西省', '山西', '141000', '临汾市', '141021', '曲沃县', '1', '华北');
INSERT INTO `city` VALUES ('141022', '翼城县', '140000', '山西省', '山西', '141000', '临汾市', '141022', '翼城县', '1', '华北');
INSERT INTO `city` VALUES ('141023', '襄汾县', '140000', '山西省', '山西', '141000', '临汾市', '141023', '襄汾县', '1', '华北');
INSERT INTO `city` VALUES ('141024', '洪洞县', '140000', '山西省', '山西', '141000', '临汾市', '141024', '洪洞县', '1', '华北');
INSERT INTO `city` VALUES ('141025', '古县', '140000', '山西省', '山西', '141000', '临汾市', '141025', '古县', '1', '华北');
INSERT INTO `city` VALUES ('141026', '安泽县', '140000', '山西省', '山西', '141000', '临汾市', '141026', '安泽县', '1', '华北');
INSERT INTO `city` VALUES ('141027', '浮山县', '140000', '山西省', '山西', '141000', '临汾市', '141027', '浮山县', '1', '华北');
INSERT INTO `city` VALUES ('141028', '吉县', '140000', '山西省', '山西', '141000', '临汾市', '141028', '吉县', '1', '华北');
INSERT INTO `city` VALUES ('141029', '乡宁县', '140000', '山西省', '山西', '141000', '临汾市', '141029', '乡宁县', '1', '华北');
INSERT INTO `city` VALUES ('141030', '大宁县', '140000', '山西省', '山西', '141000', '临汾市', '141030', '大宁县', '1', '华北');
INSERT INTO `city` VALUES ('141031', '隰县', '140000', '山西省', '山西', '141000', '临汾市', '141031', '隰县', '1', '华北');
INSERT INTO `city` VALUES ('141032', '永和县', '140000', '山西省', '山西', '141000', '临汾市', '141032', '永和县', '1', '华北');
INSERT INTO `city` VALUES ('141033', '蒲县', '140000', '山西省', '山西', '141000', '临汾市', '141033', '蒲县', '1', '华北');
INSERT INTO `city` VALUES ('141034', '汾西县', '140000', '山西省', '山西', '141000', '临汾市', '141034', '汾西县', '1', '华北');
INSERT INTO `city` VALUES ('141081', '侯马市', '140000', '山西省', '山西', '141000', '临汾市', '141081', '侯马市', '1', '华北');
INSERT INTO `city` VALUES ('141082', '霍州市', '140000', '山西省', '山西', '141000', '临汾市', '141082', '霍州市', '1', '华北');
INSERT INTO `city` VALUES ('141100', '吕梁市', '140000', '山西省', '山西', '141100', '吕梁市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('141101', '市辖区', '140000', '山西省', '山西', '141100', '吕梁市', '141101', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('141102', '离石区', '140000', '山西省', '山西', '141100', '吕梁市', '141102', '离石区', '1', '华北');
INSERT INTO `city` VALUES ('141121', '文水县', '140000', '山西省', '山西', '141100', '吕梁市', '141121', '文水县', '1', '华北');
INSERT INTO `city` VALUES ('141122', '交城县', '140000', '山西省', '山西', '141100', '吕梁市', '141122', '交城县', '1', '华北');
INSERT INTO `city` VALUES ('141123', '兴县', '140000', '山西省', '山西', '141100', '吕梁市', '141123', '兴县', '1', '华北');
INSERT INTO `city` VALUES ('141124', '临县', '140000', '山西省', '山西', '141100', '吕梁市', '141124', '临县', '1', '华北');
INSERT INTO `city` VALUES ('141125', '柳林县', '140000', '山西省', '山西', '141100', '吕梁市', '141125', '柳林县', '1', '华北');
INSERT INTO `city` VALUES ('141126', '石楼县', '140000', '山西省', '山西', '141100', '吕梁市', '141126', '石楼县', '1', '华北');
INSERT INTO `city` VALUES ('141127', '岚县', '140000', '山西省', '山西', '141100', '吕梁市', '141127', '岚县', '1', '华北');
INSERT INTO `city` VALUES ('141128', '方山县', '140000', '山西省', '山西', '141100', '吕梁市', '141128', '方山县', '1', '华北');
INSERT INTO `city` VALUES ('141129', '中阳县', '140000', '山西省', '山西', '141100', '吕梁市', '141129', '中阳县', '1', '华北');
INSERT INTO `city` VALUES ('141130', '交口县', '140000', '山西省', '山西', '141100', '吕梁市', '141130', '交口县', '1', '华北');
INSERT INTO `city` VALUES ('141181', '孝义市', '140000', '山西省', '山西', '141100', '吕梁市', '141181', '孝义市', '1', '华北');
INSERT INTO `city` VALUES ('141182', '汾阳市', '140000', '山西省', '山西', '141100', '吕梁市', '141182', '汾阳市', '1', '华北');
INSERT INTO `city` VALUES ('150000', '内蒙古自治区', '150000', '内蒙古自治区', '内蒙古', '0', '', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150100', '呼和浩特市', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150101', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150101', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150102', '新城区', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150102', '新城区', '1', '华北');
INSERT INTO `city` VALUES ('150103', '回民区', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150103', '回民区', '1', '华北');
INSERT INTO `city` VALUES ('150104', '玉泉区', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150104', '玉泉区', '1', '华北');
INSERT INTO `city` VALUES ('150105', '赛罕区', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150105', '赛罕区', '1', '华北');
INSERT INTO `city` VALUES ('150121', '土默特左旗', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150121', '土默特左旗', '1', '华北');
INSERT INTO `city` VALUES ('150122', '托克托县', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150122', '托克托县', '1', '华北');
INSERT INTO `city` VALUES ('150123', '和林格尔县', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150123', '和林格尔县', '1', '华北');
INSERT INTO `city` VALUES ('150124', '清水河县', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150124', '清水河县', '1', '华北');
INSERT INTO `city` VALUES ('150125', '武川县', '150000', '内蒙古自治区', '内蒙古', '150100', '呼和浩特市', '150125', '武川县', '1', '华北');
INSERT INTO `city` VALUES ('150200', '包头市', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150201', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150201', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150202', '东河区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150202', '东河区', '1', '华北');
INSERT INTO `city` VALUES ('150203', '昆都仑区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150203', '昆都仑区', '1', '华北');
INSERT INTO `city` VALUES ('150204', '青山区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150204', '青山区', '1', '华北');
INSERT INTO `city` VALUES ('150205', '石拐区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150205', '石拐区', '1', '华北');
INSERT INTO `city` VALUES ('150206', '白云鄂博矿区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150206', '白云鄂博矿区', '1', '华北');
INSERT INTO `city` VALUES ('150207', '九原区', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150207', '九原区', '1', '华北');
INSERT INTO `city` VALUES ('150221', '土默特右旗', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150221', '土默特右旗', '1', '华北');
INSERT INTO `city` VALUES ('150222', '固阳县', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150222', '固阳县', '1', '华北');
INSERT INTO `city` VALUES ('150223', '达尔罕茂明安联合旗', '150000', '内蒙古自治区', '内蒙古', '150200', '包头市', '150223', '达尔罕茂明安联合旗', '1', '华北');
INSERT INTO `city` VALUES ('150300', '乌海市', '150000', '内蒙古自治区', '内蒙古', '150300', '乌海市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150301', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150300', '乌海市', '150301', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150302', '海勃湾区', '150000', '内蒙古自治区', '内蒙古', '150300', '乌海市', '150302', '海勃湾区', '1', '华北');
INSERT INTO `city` VALUES ('150303', '海南区', '150000', '内蒙古自治区', '内蒙古', '150300', '乌海市', '150303', '海南区', '1', '华北');
INSERT INTO `city` VALUES ('150304', '乌达区', '150000', '内蒙古自治区', '内蒙古', '150300', '乌海市', '150304', '乌达区', '1', '华北');
INSERT INTO `city` VALUES ('150400', '赤峰市', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150401', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150401', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150402', '红山区', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150402', '红山区', '1', '华北');
INSERT INTO `city` VALUES ('150403', '元宝山区', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150403', '元宝山区', '1', '华北');
INSERT INTO `city` VALUES ('150404', '松山区', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150404', '松山区', '1', '华北');
INSERT INTO `city` VALUES ('150421', '阿鲁科尔沁旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150421', '阿鲁科尔沁旗', '1', '华北');
INSERT INTO `city` VALUES ('150422', '巴林左旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150422', '巴林左旗', '1', '华北');
INSERT INTO `city` VALUES ('150423', '巴林右旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150423', '巴林右旗', '1', '华北');
INSERT INTO `city` VALUES ('150424', '林西县', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150424', '林西县', '1', '华北');
INSERT INTO `city` VALUES ('150425', '克什克腾旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150425', '克什克腾旗', '1', '华北');
INSERT INTO `city` VALUES ('150426', '翁牛特旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150426', '翁牛特旗', '1', '华北');
INSERT INTO `city` VALUES ('150428', '喀喇沁旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150428', '喀喇沁旗', '1', '华北');
INSERT INTO `city` VALUES ('150429', '宁城县', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150429', '宁城县', '1', '华北');
INSERT INTO `city` VALUES ('150430', '敖汉旗', '150000', '内蒙古自治区', '内蒙古', '150400', '赤峰市', '150430', '敖汉旗', '1', '华北');
INSERT INTO `city` VALUES ('150500', '通辽市', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150501', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150501', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150502', '科尔沁区', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150502', '科尔沁区', '1', '华北');
INSERT INTO `city` VALUES ('150521', '科尔沁左翼中旗', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150521', '科尔沁左翼中旗', '1', '华北');
INSERT INTO `city` VALUES ('150522', '科尔沁左翼后旗', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150522', '科尔沁左翼后旗', '1', '华北');
INSERT INTO `city` VALUES ('150523', '开鲁县', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150523', '开鲁县', '1', '华北');
INSERT INTO `city` VALUES ('150524', '库伦旗', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150524', '库伦旗', '1', '华北');
INSERT INTO `city` VALUES ('150525', '奈曼旗', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150525', '奈曼旗', '1', '华北');
INSERT INTO `city` VALUES ('150526', '扎鲁特旗', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150526', '扎鲁特旗', '1', '华北');
INSERT INTO `city` VALUES ('150581', '霍林郭勒市', '150000', '内蒙古自治区', '内蒙古', '150500', '通辽市', '150581', '霍林郭勒市', '1', '华北');
INSERT INTO `city` VALUES ('150600', '鄂尔多斯市', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150601', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150601', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150602', '东胜区', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150602', '东胜区', '1', '华北');
INSERT INTO `city` VALUES ('150621', '达拉特旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150621', '达拉特旗', '1', '华北');
INSERT INTO `city` VALUES ('150622', '准格尔旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150622', '准格尔旗', '1', '华北');
INSERT INTO `city` VALUES ('150623', '鄂托克前旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150623', '鄂托克前旗', '1', '华北');
INSERT INTO `city` VALUES ('150624', '鄂托克旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150624', '鄂托克旗', '1', '华北');
INSERT INTO `city` VALUES ('150625', '杭锦旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150625', '杭锦旗', '1', '华北');
INSERT INTO `city` VALUES ('150626', '乌审旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150626', '乌审旗', '1', '华北');
INSERT INTO `city` VALUES ('150627', '伊金霍洛旗', '150000', '内蒙古自治区', '内蒙古', '150600', '鄂尔多斯市', '150627', '伊金霍洛旗', '1', '华北');
INSERT INTO `city` VALUES ('150700', '呼伦贝尔市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150701', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150701', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150702', '海拉尔区', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150702', '海拉尔区', '1', '华北');
INSERT INTO `city` VALUES ('150703', '扎赉诺尔区', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150703', '扎赉诺尔区', '1', '华北');
INSERT INTO `city` VALUES ('150721', '阿荣旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150721', '阿荣旗', '1', '华北');
INSERT INTO `city` VALUES ('150722', '莫力达瓦达斡尔族自治旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150722', '莫力达瓦达斡尔族自治旗', '1', '华北');
INSERT INTO `city` VALUES ('150723', '鄂伦春自治旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150723', '鄂伦春自治旗', '1', '华北');
INSERT INTO `city` VALUES ('150724', '鄂温克族自治旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150724', '鄂温克族自治旗', '1', '华北');
INSERT INTO `city` VALUES ('150725', '陈巴尔虎旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150725', '陈巴尔虎旗', '1', '华北');
INSERT INTO `city` VALUES ('150726', '新巴尔虎左旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150726', '新巴尔虎左旗', '1', '华北');
INSERT INTO `city` VALUES ('150727', '新巴尔虎右旗', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150727', '新巴尔虎右旗', '1', '华北');
INSERT INTO `city` VALUES ('150781', '满洲里市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150781', '满洲里市', '1', '华北');
INSERT INTO `city` VALUES ('150782', '牙克石市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150782', '牙克石市', '1', '华北');
INSERT INTO `city` VALUES ('150783', '扎兰屯市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150783', '扎兰屯市', '1', '华北');
INSERT INTO `city` VALUES ('150784', '额尔古纳市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150784', '额尔古纳市', '1', '华北');
INSERT INTO `city` VALUES ('150785', '根河市', '150000', '内蒙古自治区', '内蒙古', '150700', '呼伦贝尔市', '150785', '根河市', '1', '华北');
INSERT INTO `city` VALUES ('150800', '巴彦淖尔市', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150801', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150801', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150802', '临河区', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150802', '临河区', '1', '华北');
INSERT INTO `city` VALUES ('150821', '五原县', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150821', '五原县', '1', '华北');
INSERT INTO `city` VALUES ('150822', '磴口县', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150822', '磴口县', '1', '华北');
INSERT INTO `city` VALUES ('150823', '乌拉特前旗', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150823', '乌拉特前旗', '1', '华北');
INSERT INTO `city` VALUES ('150824', '乌拉特中旗', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150824', '乌拉特中旗', '1', '华北');
INSERT INTO `city` VALUES ('150825', '乌拉特后旗', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150825', '乌拉特后旗', '1', '华北');
INSERT INTO `city` VALUES ('150826', '杭锦后旗', '150000', '内蒙古自治区', '内蒙古', '150800', '巴彦淖尔市', '150826', '杭锦后旗', '1', '华北');
INSERT INTO `city` VALUES ('150900', '乌兰察布市', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('150901', '市辖区', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150901', '市辖区', '1', '华北');
INSERT INTO `city` VALUES ('150902', '集宁区', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150902', '集宁区', '1', '华北');
INSERT INTO `city` VALUES ('150921', '卓资县', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150921', '卓资县', '1', '华北');
INSERT INTO `city` VALUES ('150922', '化德县', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150922', '化德县', '1', '华北');
INSERT INTO `city` VALUES ('150923', '商都县', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150923', '商都县', '1', '华北');
INSERT INTO `city` VALUES ('150924', '兴和县', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150924', '兴和县', '1', '华北');
INSERT INTO `city` VALUES ('150925', '凉城县', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150925', '凉城县', '1', '华北');
INSERT INTO `city` VALUES ('150926', '察哈尔右翼前旗', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150926', '察哈尔右翼前旗', '1', '华北');
INSERT INTO `city` VALUES ('150927', '察哈尔右翼中旗', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150927', '察哈尔右翼中旗', '1', '华北');
INSERT INTO `city` VALUES ('150928', '察哈尔右翼后旗', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150928', '察哈尔右翼后旗', '1', '华北');
INSERT INTO `city` VALUES ('150929', '四子王旗', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150929', '四子王旗', '1', '华北');
INSERT INTO `city` VALUES ('150981', '丰镇市', '150000', '内蒙古自治区', '内蒙古', '150900', '乌兰察布市', '150981', '丰镇市', '1', '华北');
INSERT INTO `city` VALUES ('152200', '兴安盟', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('152201', '乌兰浩特市', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152201', '乌兰浩特市', '1', '华北');
INSERT INTO `city` VALUES ('152202', '阿尔山市', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152202', '阿尔山市', '1', '华北');
INSERT INTO `city` VALUES ('152221', '科尔沁右翼前旗', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152221', '科尔沁右翼前旗', '1', '华北');
INSERT INTO `city` VALUES ('152222', '科尔沁右翼中旗', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152222', '科尔沁右翼中旗', '1', '华北');
INSERT INTO `city` VALUES ('152223', '扎赉特旗', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152223', '扎赉特旗', '1', '华北');
INSERT INTO `city` VALUES ('152224', '突泉县', '150000', '内蒙古自治区', '内蒙古', '152200', '兴安盟', '152224', '突泉县', '1', '华北');
INSERT INTO `city` VALUES ('152500', '锡林郭勒盟', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('152501', '二连浩特市', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152501', '二连浩特市', '1', '华北');
INSERT INTO `city` VALUES ('152502', '锡林浩特市', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152502', '锡林浩特市', '1', '华北');
INSERT INTO `city` VALUES ('152522', '阿巴嘎旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152522', '阿巴嘎旗', '1', '华北');
INSERT INTO `city` VALUES ('152523', '苏尼特左旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152523', '苏尼特左旗', '1', '华北');
INSERT INTO `city` VALUES ('152524', '苏尼特右旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152524', '苏尼特右旗', '1', '华北');
INSERT INTO `city` VALUES ('152525', '东乌珠穆沁旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152525', '东乌珠穆沁旗', '1', '华北');
INSERT INTO `city` VALUES ('152526', '西乌珠穆沁旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152526', '西乌珠穆沁旗', '1', '华北');
INSERT INTO `city` VALUES ('152527', '太仆寺旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152527', '太仆寺旗', '1', '华北');
INSERT INTO `city` VALUES ('152528', '镶黄旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152528', '镶黄旗', '1', '华北');
INSERT INTO `city` VALUES ('152529', '正镶白旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152529', '正镶白旗', '1', '华北');
INSERT INTO `city` VALUES ('152530', '正蓝旗', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152530', '正蓝旗', '1', '华北');
INSERT INTO `city` VALUES ('152531', '多伦县', '150000', '内蒙古自治区', '内蒙古', '152500', '锡林郭勒盟', '152531', '多伦县', '1', '华北');
INSERT INTO `city` VALUES ('152900', '阿拉善盟', '150000', '内蒙古自治区', '内蒙古', '152900', '阿拉善盟', '0', '', '1', '华北');
INSERT INTO `city` VALUES ('152921', '阿拉善左旗', '150000', '内蒙古自治区', '内蒙古', '152900', '阿拉善盟', '152921', '阿拉善左旗', '1', '华北');
INSERT INTO `city` VALUES ('152922', '阿拉善右旗', '150000', '内蒙古自治区', '内蒙古', '152900', '阿拉善盟', '152922', '阿拉善右旗', '1', '华北');
INSERT INTO `city` VALUES ('152923', '额济纳旗', '150000', '内蒙古自治区', '内蒙古', '152900', '阿拉善盟', '152923', '额济纳旗', '1', '华北');
INSERT INTO `city` VALUES ('210000', '辽宁省', '210000', '辽宁省', '辽宁', '0', '', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210100', '沈阳市', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210101', '市辖区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210101', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210102', '和平区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210102', '和平区', '2', '东北');
INSERT INTO `city` VALUES ('210103', '沈河区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210103', '沈河区', '2', '东北');
INSERT INTO `city` VALUES ('210104', '大东区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210104', '大东区', '2', '东北');
INSERT INTO `city` VALUES ('210105', '皇姑区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210105', '皇姑区', '2', '东北');
INSERT INTO `city` VALUES ('210106', '铁西区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210106', '铁西区', '2', '东北');
INSERT INTO `city` VALUES ('210111', '苏家屯区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210111', '苏家屯区', '2', '东北');
INSERT INTO `city` VALUES ('210112', '东陵区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210112', '东陵区', '2', '东北');
INSERT INTO `city` VALUES ('210113', '沈北新区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210113', '沈北新区', '2', '东北');
INSERT INTO `city` VALUES ('210114', '于洪区', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210114', '于洪区', '2', '东北');
INSERT INTO `city` VALUES ('210122', '辽中县', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210122', '辽中县', '2', '东北');
INSERT INTO `city` VALUES ('210123', '康平县', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210123', '康平县', '2', '东北');
INSERT INTO `city` VALUES ('210124', '法库县', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210124', '法库县', '2', '东北');
INSERT INTO `city` VALUES ('210181', '新民市', '210000', '辽宁省', '辽宁', '210100', '沈阳市', '210181', '新民市', '2', '东北');
INSERT INTO `city` VALUES ('210200', '大连市', '210000', '辽宁省', '辽宁', '210200', '大连市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210201', '市辖区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210201', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210202', '中山区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210202', '中山区', '2', '东北');
INSERT INTO `city` VALUES ('210203', '西岗区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210203', '西岗区', '2', '东北');
INSERT INTO `city` VALUES ('210204', '沙河口区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210204', '沙河口区', '2', '东北');
INSERT INTO `city` VALUES ('210211', '甘井子区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210211', '甘井子区', '2', '东北');
INSERT INTO `city` VALUES ('210212', '旅顺口区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210212', '旅顺口区', '2', '东北');
INSERT INTO `city` VALUES ('210213', '金州区', '210000', '辽宁省', '辽宁', '210200', '大连市', '210213', '金州区', '2', '东北');
INSERT INTO `city` VALUES ('210224', '长海县', '210000', '辽宁省', '辽宁', '210200', '大连市', '210224', '长海县', '2', '东北');
INSERT INTO `city` VALUES ('210281', '瓦房店市', '210000', '辽宁省', '辽宁', '210200', '大连市', '210281', '瓦房店市', '2', '东北');
INSERT INTO `city` VALUES ('210282', '普兰店市', '210000', '辽宁省', '辽宁', '210200', '大连市', '210282', '普兰店市', '2', '东北');
INSERT INTO `city` VALUES ('210283', '庄河市', '210000', '辽宁省', '辽宁', '210200', '大连市', '210283', '庄河市', '2', '东北');
INSERT INTO `city` VALUES ('210300', '鞍山市', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210301', '市辖区', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210301', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210302', '铁东区', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210302', '铁东区', '2', '东北');
INSERT INTO `city` VALUES ('210303', '铁西区', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210303', '铁西区', '2', '东北');
INSERT INTO `city` VALUES ('210304', '立山区', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210304', '立山区', '2', '东北');
INSERT INTO `city` VALUES ('210311', '千山区', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210311', '千山区', '2', '东北');
INSERT INTO `city` VALUES ('210321', '台安县', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210321', '台安县', '2', '东北');
INSERT INTO `city` VALUES ('210323', '岫岩满族自治县', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210323', '岫岩满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210381', '海城市', '210000', '辽宁省', '辽宁', '210300', '鞍山市', '210381', '海城市', '2', '东北');
INSERT INTO `city` VALUES ('210400', '抚顺市', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210401', '市辖区', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210401', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210402', '新抚区', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210402', '新抚区', '2', '东北');
INSERT INTO `city` VALUES ('210403', '东洲区', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210403', '东洲区', '2', '东北');
INSERT INTO `city` VALUES ('210404', '望花区', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210404', '望花区', '2', '东北');
INSERT INTO `city` VALUES ('210411', '顺城区', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210411', '顺城区', '2', '东北');
INSERT INTO `city` VALUES ('210421', '抚顺县', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210421', '抚顺县', '2', '东北');
INSERT INTO `city` VALUES ('210422', '新宾满族自治县', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210422', '新宾满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210423', '清原满族自治县', '210000', '辽宁省', '辽宁', '210400', '抚顺市', '210423', '清原满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210500', '本溪市', '210000', '辽宁省', '辽宁', '210500', '本溪市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210501', '市辖区', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210501', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210502', '平山区', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210502', '平山区', '2', '东北');
INSERT INTO `city` VALUES ('210503', '溪湖区', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210503', '溪湖区', '2', '东北');
INSERT INTO `city` VALUES ('210504', '明山区', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210504', '明山区', '2', '东北');
INSERT INTO `city` VALUES ('210505', '南芬区', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210505', '南芬区', '2', '东北');
INSERT INTO `city` VALUES ('210521', '本溪满族自治县', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210521', '本溪满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210522', '桓仁满族自治县', '210000', '辽宁省', '辽宁', '210500', '本溪市', '210522', '桓仁满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210600', '丹东市', '210000', '辽宁省', '辽宁', '210600', '丹东市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210601', '市辖区', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210601', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210602', '元宝区', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210602', '元宝区', '2', '东北');
INSERT INTO `city` VALUES ('210603', '振兴区', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210603', '振兴区', '2', '东北');
INSERT INTO `city` VALUES ('210604', '振安区', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210604', '振安区', '2', '东北');
INSERT INTO `city` VALUES ('210624', '宽甸满族自治县', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210624', '宽甸满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210681', '东港市', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210681', '东港市', '2', '东北');
INSERT INTO `city` VALUES ('210682', '凤城市', '210000', '辽宁省', '辽宁', '210600', '丹东市', '210682', '凤城市', '2', '东北');
INSERT INTO `city` VALUES ('210700', '锦州市', '210000', '辽宁省', '辽宁', '210700', '锦州市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210701', '市辖区', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210701', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210702', '古塔区', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210702', '古塔区', '2', '东北');
INSERT INTO `city` VALUES ('210703', '凌河区', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210703', '凌河区', '2', '东北');
INSERT INTO `city` VALUES ('210711', '太和区', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210711', '太和区', '2', '东北');
INSERT INTO `city` VALUES ('210726', '黑山县', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210726', '黑山县', '2', '东北');
INSERT INTO `city` VALUES ('210727', '义县', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210727', '义县', '2', '东北');
INSERT INTO `city` VALUES ('210781', '凌海市', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210781', '凌海市', '2', '东北');
INSERT INTO `city` VALUES ('210782', '北镇市', '210000', '辽宁省', '辽宁', '210700', '锦州市', '210782', '北镇市', '2', '东北');
INSERT INTO `city` VALUES ('210800', '营口市', '210000', '辽宁省', '辽宁', '210800', '营口市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210801', '市辖区', '210000', '辽宁省', '辽宁', '210800', '营口市', '210801', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210802', '站前区', '210000', '辽宁省', '辽宁', '210800', '营口市', '210802', '站前区', '2', '东北');
INSERT INTO `city` VALUES ('210803', '西市区', '210000', '辽宁省', '辽宁', '210800', '营口市', '210803', '西市区', '2', '东北');
INSERT INTO `city` VALUES ('210804', '鲅鱼圈区', '210000', '辽宁省', '辽宁', '210800', '营口市', '210804', '鲅鱼圈区', '2', '东北');
INSERT INTO `city` VALUES ('210811', '老边区', '210000', '辽宁省', '辽宁', '210800', '营口市', '210811', '老边区', '2', '东北');
INSERT INTO `city` VALUES ('210881', '盖州市', '210000', '辽宁省', '辽宁', '210800', '营口市', '210881', '盖州市', '2', '东北');
INSERT INTO `city` VALUES ('210882', '大石桥市', '210000', '辽宁省', '辽宁', '210800', '营口市', '210882', '大石桥市', '2', '东北');
INSERT INTO `city` VALUES ('210900', '阜新市', '210000', '辽宁省', '辽宁', '210900', '阜新市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('210901', '市辖区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210901', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('210902', '海州区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210902', '海州区', '2', '东北');
INSERT INTO `city` VALUES ('210903', '新邱区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210903', '新邱区', '2', '东北');
INSERT INTO `city` VALUES ('210904', '太平区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210904', '太平区', '2', '东北');
INSERT INTO `city` VALUES ('210905', '清河门区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210905', '清河门区', '2', '东北');
INSERT INTO `city` VALUES ('210911', '细河区', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210911', '细河区', '2', '东北');
INSERT INTO `city` VALUES ('210921', '阜新蒙古族自治县', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210921', '阜新蒙古族自治县', '2', '东北');
INSERT INTO `city` VALUES ('210922', '彰武县', '210000', '辽宁省', '辽宁', '210900', '阜新市', '210922', '彰武县', '2', '东北');
INSERT INTO `city` VALUES ('211000', '辽阳市', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('211001', '市辖区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211001', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('211002', '白塔区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211002', '白塔区', '2', '东北');
INSERT INTO `city` VALUES ('211003', '文圣区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211003', '文圣区', '2', '东北');
INSERT INTO `city` VALUES ('211004', '宏伟区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211004', '宏伟区', '2', '东北');
INSERT INTO `city` VALUES ('211005', '弓长岭区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211005', '弓长岭区', '2', '东北');
INSERT INTO `city` VALUES ('211011', '太子河区', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211011', '太子河区', '2', '东北');
INSERT INTO `city` VALUES ('211021', '辽阳县', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211021', '辽阳县', '2', '东北');
INSERT INTO `city` VALUES ('211081', '灯塔市', '210000', '辽宁省', '辽宁', '211000', '辽阳市', '211081', '灯塔市', '2', '东北');
INSERT INTO `city` VALUES ('211100', '盘锦市', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('211101', '市辖区', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '211101', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('211102', '双台子区', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '211102', '双台子区', '2', '东北');
INSERT INTO `city` VALUES ('211103', '兴隆台区', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '211103', '兴隆台区', '2', '东北');
INSERT INTO `city` VALUES ('211121', '大洼县', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '211121', '大洼县', '2', '东北');
INSERT INTO `city` VALUES ('211122', '盘山县', '210000', '辽宁省', '辽宁', '211100', '盘锦市', '211122', '盘山县', '2', '东北');
INSERT INTO `city` VALUES ('211200', '铁岭市', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('211201', '市辖区', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211201', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('211202', '银州区', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211202', '银州区', '2', '东北');
INSERT INTO `city` VALUES ('211204', '清河区', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211204', '清河区', '2', '东北');
INSERT INTO `city` VALUES ('211221', '铁岭县', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211221', '铁岭县', '2', '东北');
INSERT INTO `city` VALUES ('211223', '西丰县', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211223', '西丰县', '2', '东北');
INSERT INTO `city` VALUES ('211224', '昌图县', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211224', '昌图县', '2', '东北');
INSERT INTO `city` VALUES ('211281', '调兵山市', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211281', '调兵山市', '2', '东北');
INSERT INTO `city` VALUES ('211282', '开原市', '210000', '辽宁省', '辽宁', '211200', '铁岭市', '211282', '开原市', '2', '东北');
INSERT INTO `city` VALUES ('211300', '朝阳市', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('211301', '市辖区', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211301', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('211302', '双塔区', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211302', '双塔区', '2', '东北');
INSERT INTO `city` VALUES ('211303', '龙城区', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211303', '龙城区', '2', '东北');
INSERT INTO `city` VALUES ('211321', '朝阳县', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211321', '朝阳县', '2', '东北');
INSERT INTO `city` VALUES ('211322', '建平县', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211322', '建平县', '2', '东北');
INSERT INTO `city` VALUES ('211324', '喀喇沁左翼蒙古族自治县', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211324', '喀喇沁左翼蒙古族自治县', '2', '东北');
INSERT INTO `city` VALUES ('211381', '北票市', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211381', '北票市', '2', '东北');
INSERT INTO `city` VALUES ('211382', '凌源市', '210000', '辽宁省', '辽宁', '211300', '朝阳市', '211382', '凌源市', '2', '东北');
INSERT INTO `city` VALUES ('211400', '葫芦岛市', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('211401', '市辖区', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211401', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('211402', '连山区', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211402', '连山区', '2', '东北');
INSERT INTO `city` VALUES ('211403', '龙港区', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211403', '龙港区', '2', '东北');
INSERT INTO `city` VALUES ('211404', '南票区', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211404', '南票区', '2', '东北');
INSERT INTO `city` VALUES ('211421', '绥中县', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211421', '绥中县', '2', '东北');
INSERT INTO `city` VALUES ('211422', '建昌县', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211422', '建昌县', '2', '东北');
INSERT INTO `city` VALUES ('211481', '兴城市', '210000', '辽宁省', '辽宁', '211400', '葫芦岛市', '211481', '兴城市', '2', '东北');
INSERT INTO `city` VALUES ('220000', '吉林省', '220000', '吉林省', '吉林', '0', '', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220100', '长春市', '220000', '吉林省', '吉林', '220100', '长春市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220101', '市辖区', '220000', '吉林省', '吉林', '220100', '长春市', '220101', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220102', '南关区', '220000', '吉林省', '吉林', '220100', '长春市', '220102', '南关区', '2', '东北');
INSERT INTO `city` VALUES ('220103', '宽城区', '220000', '吉林省', '吉林', '220100', '长春市', '220103', '宽城区', '2', '东北');
INSERT INTO `city` VALUES ('220104', '朝阳区', '220000', '吉林省', '吉林', '220100', '长春市', '220104', '朝阳区', '2', '东北');
INSERT INTO `city` VALUES ('220105', '二道区', '220000', '吉林省', '吉林', '220100', '长春市', '220105', '二道区', '2', '东北');
INSERT INTO `city` VALUES ('220106', '绿园区', '220000', '吉林省', '吉林', '220100', '长春市', '220106', '绿园区', '2', '东北');
INSERT INTO `city` VALUES ('220112', '双阳区', '220000', '吉林省', '吉林', '220100', '长春市', '220112', '双阳区', '2', '东北');
INSERT INTO `city` VALUES ('220122', '农安县', '220000', '吉林省', '吉林', '220100', '长春市', '220122', '农安县', '2', '东北');
INSERT INTO `city` VALUES ('220181', '九台市', '220000', '吉林省', '吉林', '220100', '长春市', '220181', '九台市', '2', '东北');
INSERT INTO `city` VALUES ('220182', '榆树市', '220000', '吉林省', '吉林', '220100', '长春市', '220182', '榆树市', '2', '东北');
INSERT INTO `city` VALUES ('220183', '德惠市', '220000', '吉林省', '吉林', '220100', '长春市', '220183', '德惠市', '2', '东北');
INSERT INTO `city` VALUES ('220200', '吉林市', '220000', '吉林省', '吉林', '220200', '吉林市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220201', '市辖区', '220000', '吉林省', '吉林', '220200', '吉林市', '220201', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220202', '昌邑区', '220000', '吉林省', '吉林', '220200', '吉林市', '220202', '昌邑区', '2', '东北');
INSERT INTO `city` VALUES ('220203', '龙潭区', '220000', '吉林省', '吉林', '220200', '吉林市', '220203', '龙潭区', '2', '东北');
INSERT INTO `city` VALUES ('220204', '船营区', '220000', '吉林省', '吉林', '220200', '吉林市', '220204', '船营区', '2', '东北');
INSERT INTO `city` VALUES ('220211', '丰满区', '220000', '吉林省', '吉林', '220200', '吉林市', '220211', '丰满区', '2', '东北');
INSERT INTO `city` VALUES ('220221', '永吉县', '220000', '吉林省', '吉林', '220200', '吉林市', '220221', '永吉县', '2', '东北');
INSERT INTO `city` VALUES ('220281', '蛟河市', '220000', '吉林省', '吉林', '220200', '吉林市', '220281', '蛟河市', '2', '东北');
INSERT INTO `city` VALUES ('220282', '桦甸市', '220000', '吉林省', '吉林', '220200', '吉林市', '220282', '桦甸市', '2', '东北');
INSERT INTO `city` VALUES ('220283', '舒兰市', '220000', '吉林省', '吉林', '220200', '吉林市', '220283', '舒兰市', '2', '东北');
INSERT INTO `city` VALUES ('220284', '磐石市', '220000', '吉林省', '吉林', '220200', '吉林市', '220284', '磐石市', '2', '东北');
INSERT INTO `city` VALUES ('220300', '四平市', '220000', '吉林省', '吉林', '220300', '四平市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220301', '市辖区', '220000', '吉林省', '吉林', '220300', '四平市', '220301', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220302', '铁西区', '220000', '吉林省', '吉林', '220300', '四平市', '220302', '铁西区', '2', '东北');
INSERT INTO `city` VALUES ('220303', '铁东区', '220000', '吉林省', '吉林', '220300', '四平市', '220303', '铁东区', '2', '东北');
INSERT INTO `city` VALUES ('220322', '梨树县', '220000', '吉林省', '吉林', '220300', '四平市', '220322', '梨树县', '2', '东北');
INSERT INTO `city` VALUES ('220323', '伊通满族自治县', '220000', '吉林省', '吉林', '220300', '四平市', '220323', '伊通满族自治县', '2', '东北');
INSERT INTO `city` VALUES ('220381', '公主岭市', '220000', '吉林省', '吉林', '220300', '四平市', '220381', '公主岭市', '2', '东北');
INSERT INTO `city` VALUES ('220382', '双辽市', '220000', '吉林省', '吉林', '220300', '四平市', '220382', '双辽市', '2', '东北');
INSERT INTO `city` VALUES ('220400', '辽源市', '220000', '吉林省', '吉林', '220400', '辽源市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220401', '市辖区', '220000', '吉林省', '吉林', '220400', '辽源市', '220401', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220402', '龙山区', '220000', '吉林省', '吉林', '220400', '辽源市', '220402', '龙山区', '2', '东北');
INSERT INTO `city` VALUES ('220403', '西安区', '220000', '吉林省', '吉林', '220400', '辽源市', '220403', '西安区', '2', '东北');
INSERT INTO `city` VALUES ('220421', '东丰县', '220000', '吉林省', '吉林', '220400', '辽源市', '220421', '东丰县', '2', '东北');
INSERT INTO `city` VALUES ('220422', '东辽县', '220000', '吉林省', '吉林', '220400', '辽源市', '220422', '东辽县', '2', '东北');
INSERT INTO `city` VALUES ('220500', '通化市', '220000', '吉林省', '吉林', '220500', '通化市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220501', '市辖区', '220000', '吉林省', '吉林', '220500', '通化市', '220501', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220502', '东昌区', '220000', '吉林省', '吉林', '220500', '通化市', '220502', '东昌区', '2', '东北');
INSERT INTO `city` VALUES ('220503', '二道江区', '220000', '吉林省', '吉林', '220500', '通化市', '220503', '二道江区', '2', '东北');
INSERT INTO `city` VALUES ('220521', '通化县', '220000', '吉林省', '吉林', '220500', '通化市', '220521', '通化县', '2', '东北');
INSERT INTO `city` VALUES ('220523', '辉南县', '220000', '吉林省', '吉林', '220500', '通化市', '220523', '辉南县', '2', '东北');
INSERT INTO `city` VALUES ('220524', '柳河县', '220000', '吉林省', '吉林', '220500', '通化市', '220524', '柳河县', '2', '东北');
INSERT INTO `city` VALUES ('220581', '梅河口市', '220000', '吉林省', '吉林', '220500', '通化市', '220581', '梅河口市', '2', '东北');
INSERT INTO `city` VALUES ('220582', '集安市', '220000', '吉林省', '吉林', '220500', '通化市', '220582', '集安市', '2', '东北');
INSERT INTO `city` VALUES ('220600', '白山市', '220000', '吉林省', '吉林', '220600', '白山市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220601', '市辖区', '220000', '吉林省', '吉林', '220600', '白山市', '220601', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220602', '浑江区', '220000', '吉林省', '吉林', '220600', '白山市', '220602', '浑江区', '2', '东北');
INSERT INTO `city` VALUES ('220605', '江源区', '220000', '吉林省', '吉林', '220600', '白山市', '220605', '江源区', '2', '东北');
INSERT INTO `city` VALUES ('220621', '抚松县', '220000', '吉林省', '吉林', '220600', '白山市', '220621', '抚松县', '2', '东北');
INSERT INTO `city` VALUES ('220622', '靖宇县', '220000', '吉林省', '吉林', '220600', '白山市', '220622', '靖宇县', '2', '东北');
INSERT INTO `city` VALUES ('220623', '长白朝鲜族自治县', '220000', '吉林省', '吉林', '220600', '白山市', '220623', '长白朝鲜族自治县', '2', '东北');
INSERT INTO `city` VALUES ('220681', '临江市', '220000', '吉林省', '吉林', '220600', '白山市', '220681', '临江市', '2', '东北');
INSERT INTO `city` VALUES ('220700', '松原市', '220000', '吉林省', '吉林', '220700', '松原市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220701', '市辖区', '220000', '吉林省', '吉林', '220700', '松原市', '220701', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220702', '宁江区', '220000', '吉林省', '吉林', '220700', '松原市', '220702', '宁江区', '2', '东北');
INSERT INTO `city` VALUES ('220721', '前郭尔罗斯蒙古族自治县', '220000', '吉林省', '吉林', '220700', '松原市', '220721', '前郭尔罗斯蒙古族自治县', '2', '东北');
INSERT INTO `city` VALUES ('220722', '长岭县', '220000', '吉林省', '吉林', '220700', '松原市', '220722', '长岭县', '2', '东北');
INSERT INTO `city` VALUES ('220723', '乾安县', '220000', '吉林省', '吉林', '220700', '松原市', '220723', '乾安县', '2', '东北');
INSERT INTO `city` VALUES ('220781', '扶余市', '220000', '吉林省', '吉林', '220700', '松原市', '220781', '扶余市', '2', '东北');
INSERT INTO `city` VALUES ('220800', '白城市', '220000', '吉林省', '吉林', '220800', '白城市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('220801', '市辖区', '220000', '吉林省', '吉林', '220800', '白城市', '220801', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('220802', '洮北区', '220000', '吉林省', '吉林', '220800', '白城市', '220802', '洮北区', '2', '东北');
INSERT INTO `city` VALUES ('220821', '镇赉县', '220000', '吉林省', '吉林', '220800', '白城市', '220821', '镇赉县', '2', '东北');
INSERT INTO `city` VALUES ('220822', '通榆县', '220000', '吉林省', '吉林', '220800', '白城市', '220822', '通榆县', '2', '东北');
INSERT INTO `city` VALUES ('220881', '洮南市', '220000', '吉林省', '吉林', '220800', '白城市', '220881', '洮南市', '2', '东北');
INSERT INTO `city` VALUES ('220882', '大安市', '220000', '吉林省', '吉林', '220800', '白城市', '220882', '大安市', '2', '东北');
INSERT INTO `city` VALUES ('222400', '延边朝鲜族自治州', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('222401', '延吉市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222401', '延吉市', '2', '东北');
INSERT INTO `city` VALUES ('222402', '图们市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222402', '图们市', '2', '东北');
INSERT INTO `city` VALUES ('222403', '敦化市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222403', '敦化市', '2', '东北');
INSERT INTO `city` VALUES ('222404', '珲春市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222404', '珲春市', '2', '东北');
INSERT INTO `city` VALUES ('222405', '龙井市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222405', '龙井市', '2', '东北');
INSERT INTO `city` VALUES ('222406', '和龙市', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222406', '和龙市', '2', '东北');
INSERT INTO `city` VALUES ('222424', '汪清县', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222424', '汪清县', '2', '东北');
INSERT INTO `city` VALUES ('222426', '安图县', '220000', '吉林省', '吉林', '222400', '延边朝鲜族自治州', '222426', '安图县', '2', '东北');
INSERT INTO `city` VALUES ('230000', '黑龙江省', '230000', '黑龙江省', '黑龙江', '0', '', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230100', '哈尔滨市', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230101', '市辖区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230101', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230102', '道里区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230102', '道里区', '2', '东北');
INSERT INTO `city` VALUES ('230103', '南岗区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230103', '南岗区', '2', '东北');
INSERT INTO `city` VALUES ('230104', '道外区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230104', '道外区', '2', '东北');
INSERT INTO `city` VALUES ('230108', '平房区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230108', '平房区', '2', '东北');
INSERT INTO `city` VALUES ('230109', '松北区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230109', '松北区', '2', '东北');
INSERT INTO `city` VALUES ('230110', '香坊区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230110', '香坊区', '2', '东北');
INSERT INTO `city` VALUES ('230111', '呼兰区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230111', '呼兰区', '2', '东北');
INSERT INTO `city` VALUES ('230112', '阿城区', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230112', '阿城区', '2', '东北');
INSERT INTO `city` VALUES ('230123', '依兰县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230123', '依兰县', '2', '东北');
INSERT INTO `city` VALUES ('230124', '方正县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230124', '方正县', '2', '东北');
INSERT INTO `city` VALUES ('230125', '宾县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230125', '宾县', '2', '东北');
INSERT INTO `city` VALUES ('230126', '巴彦县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230126', '巴彦县', '2', '东北');
INSERT INTO `city` VALUES ('230127', '木兰县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230127', '木兰县', '2', '东北');
INSERT INTO `city` VALUES ('230128', '通河县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230128', '通河县', '2', '东北');
INSERT INTO `city` VALUES ('230129', '延寿县', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230129', '延寿县', '2', '东北');
INSERT INTO `city` VALUES ('230182', '双城市', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230182', '双城市', '2', '东北');
INSERT INTO `city` VALUES ('230183', '尚志市', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230183', '尚志市', '2', '东北');
INSERT INTO `city` VALUES ('230184', '五常市', '230000', '黑龙江省', '黑龙江', '230100', '哈尔滨市', '230184', '五常市', '2', '东北');
INSERT INTO `city` VALUES ('230200', '齐齐哈尔市', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230201', '市辖区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230201', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230202', '龙沙区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230202', '龙沙区', '2', '东北');
INSERT INTO `city` VALUES ('230203', '建华区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230203', '建华区', '2', '东北');
INSERT INTO `city` VALUES ('230204', '铁锋区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230204', '铁锋区', '2', '东北');
INSERT INTO `city` VALUES ('230205', '昂昂溪区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230205', '昂昂溪区', '2', '东北');
INSERT INTO `city` VALUES ('230206', '富拉尔基区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230206', '富拉尔基区', '2', '东北');
INSERT INTO `city` VALUES ('230207', '碾子山区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230207', '碾子山区', '2', '东北');
INSERT INTO `city` VALUES ('230208', '梅里斯达斡尔族区', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230208', '梅里斯达斡尔族区', '2', '东北');
INSERT INTO `city` VALUES ('230221', '龙江县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230221', '龙江县', '2', '东北');
INSERT INTO `city` VALUES ('230223', '依安县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230223', '依安县', '2', '东北');
INSERT INTO `city` VALUES ('230224', '泰来县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230224', '泰来县', '2', '东北');
INSERT INTO `city` VALUES ('230225', '甘南县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230225', '甘南县', '2', '东北');
INSERT INTO `city` VALUES ('230227', '富裕县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230227', '富裕县', '2', '东北');
INSERT INTO `city` VALUES ('230229', '克山县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230229', '克山县', '2', '东北');
INSERT INTO `city` VALUES ('230230', '克东县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230230', '克东县', '2', '东北');
INSERT INTO `city` VALUES ('230231', '拜泉县', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230231', '拜泉县', '2', '东北');
INSERT INTO `city` VALUES ('230281', '讷河市', '230000', '黑龙江省', '黑龙江', '230200', '齐齐哈尔市', '230281', '讷河市', '2', '东北');
INSERT INTO `city` VALUES ('230300', '鸡西市', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230301', '市辖区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230301', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230302', '鸡冠区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230302', '鸡冠区', '2', '东北');
INSERT INTO `city` VALUES ('230303', '恒山区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230303', '恒山区', '2', '东北');
INSERT INTO `city` VALUES ('230304', '滴道区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230304', '滴道区', '2', '东北');
INSERT INTO `city` VALUES ('230305', '梨树区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230305', '梨树区', '2', '东北');
INSERT INTO `city` VALUES ('230306', '城子河区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230306', '城子河区', '2', '东北');
INSERT INTO `city` VALUES ('230307', '麻山区', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230307', '麻山区', '2', '东北');
INSERT INTO `city` VALUES ('230321', '鸡东县', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230321', '鸡东县', '2', '东北');
INSERT INTO `city` VALUES ('230381', '虎林市', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230381', '虎林市', '2', '东北');
INSERT INTO `city` VALUES ('230382', '密山市', '230000', '黑龙江省', '黑龙江', '230300', '鸡西市', '230382', '密山市', '2', '东北');
INSERT INTO `city` VALUES ('230400', '鹤岗市', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230401', '市辖区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230401', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230402', '向阳区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230402', '向阳区', '2', '东北');
INSERT INTO `city` VALUES ('230403', '工农区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230403', '工农区', '2', '东北');
INSERT INTO `city` VALUES ('230404', '南山区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230404', '南山区', '2', '东北');
INSERT INTO `city` VALUES ('230405', '兴安区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230405', '兴安区', '2', '东北');
INSERT INTO `city` VALUES ('230406', '东山区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230406', '东山区', '2', '东北');
INSERT INTO `city` VALUES ('230407', '兴山区', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230407', '兴山区', '2', '东北');
INSERT INTO `city` VALUES ('230421', '萝北县', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230421', '萝北县', '2', '东北');
INSERT INTO `city` VALUES ('230422', '绥滨县', '230000', '黑龙江省', '黑龙江', '230400', '鹤岗市', '230422', '绥滨县', '2', '东北');
INSERT INTO `city` VALUES ('230500', '双鸭山市', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230501', '市辖区', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230501', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230502', '尖山区', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230502', '尖山区', '2', '东北');
INSERT INTO `city` VALUES ('230503', '岭东区', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230503', '岭东区', '2', '东北');
INSERT INTO `city` VALUES ('230505', '四方台区', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230505', '四方台区', '2', '东北');
INSERT INTO `city` VALUES ('230506', '宝山区', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230506', '宝山区', '2', '东北');
INSERT INTO `city` VALUES ('230521', '集贤县', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230521', '集贤县', '2', '东北');
INSERT INTO `city` VALUES ('230522', '友谊县', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230522', '友谊县', '2', '东北');
INSERT INTO `city` VALUES ('230523', '宝清县', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230523', '宝清县', '2', '东北');
INSERT INTO `city` VALUES ('230524', '饶河县', '230000', '黑龙江省', '黑龙江', '230500', '双鸭山市', '230524', '饶河县', '2', '东北');
INSERT INTO `city` VALUES ('230600', '大庆市', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230601', '市辖区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230601', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230602', '萨尔图区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230602', '萨尔图区', '2', '东北');
INSERT INTO `city` VALUES ('230603', '龙凤区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230603', '龙凤区', '2', '东北');
INSERT INTO `city` VALUES ('230604', '让胡路区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230604', '让胡路区', '2', '东北');
INSERT INTO `city` VALUES ('230605', '红岗区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230605', '红岗区', '2', '东北');
INSERT INTO `city` VALUES ('230606', '大同区', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230606', '大同区', '2', '东北');
INSERT INTO `city` VALUES ('230621', '肇州县', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230621', '肇州县', '2', '东北');
INSERT INTO `city` VALUES ('230622', '肇源县', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230622', '肇源县', '2', '东北');
INSERT INTO `city` VALUES ('230623', '林甸县', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230623', '林甸县', '2', '东北');
INSERT INTO `city` VALUES ('230624', '杜尔伯特蒙古族自治县', '230000', '黑龙江省', '黑龙江', '230600', '大庆市', '230624', '杜尔伯特蒙古族自治县', '2', '东北');
INSERT INTO `city` VALUES ('230700', '伊春市', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230701', '市辖区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230701', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230702', '伊春区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230702', '伊春区', '2', '东北');
INSERT INTO `city` VALUES ('230703', '南岔区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230703', '南岔区', '2', '东北');
INSERT INTO `city` VALUES ('230704', '友好区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230704', '友好区', '2', '东北');
INSERT INTO `city` VALUES ('230705', '西林区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230705', '西林区', '2', '东北');
INSERT INTO `city` VALUES ('230706', '翠峦区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230706', '翠峦区', '2', '东北');
INSERT INTO `city` VALUES ('230707', '新青区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230707', '新青区', '2', '东北');
INSERT INTO `city` VALUES ('230708', '美溪区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230708', '美溪区', '2', '东北');
INSERT INTO `city` VALUES ('230709', '金山屯区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230709', '金山屯区', '2', '东北');
INSERT INTO `city` VALUES ('230710', '五营区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230710', '五营区', '2', '东北');
INSERT INTO `city` VALUES ('230711', '乌马河区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230711', '乌马河区', '2', '东北');
INSERT INTO `city` VALUES ('230712', '汤旺河区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230712', '汤旺河区', '2', '东北');
INSERT INTO `city` VALUES ('230713', '带岭区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230713', '带岭区', '2', '东北');
INSERT INTO `city` VALUES ('230714', '乌伊岭区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230714', '乌伊岭区', '2', '东北');
INSERT INTO `city` VALUES ('230715', '红星区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230715', '红星区', '2', '东北');
INSERT INTO `city` VALUES ('230716', '上甘岭区', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230716', '上甘岭区', '2', '东北');
INSERT INTO `city` VALUES ('230722', '嘉荫县', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230722', '嘉荫县', '2', '东北');
INSERT INTO `city` VALUES ('230781', '铁力市', '230000', '黑龙江省', '黑龙江', '230700', '伊春市', '230781', '铁力市', '2', '东北');
INSERT INTO `city` VALUES ('230800', '佳木斯市', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230801', '市辖区', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230801', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230803', '向阳区', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230803', '向阳区', '2', '东北');
INSERT INTO `city` VALUES ('230804', '前进区', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230804', '前进区', '2', '东北');
INSERT INTO `city` VALUES ('230805', '东风区', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230805', '东风区', '2', '东北');
INSERT INTO `city` VALUES ('230811', '郊区', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230811', '郊区', '2', '东北');
INSERT INTO `city` VALUES ('230822', '桦南县', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230822', '桦南县', '2', '东北');
INSERT INTO `city` VALUES ('230826', '桦川县', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230826', '桦川县', '2', '东北');
INSERT INTO `city` VALUES ('230828', '汤原县', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230828', '汤原县', '2', '东北');
INSERT INTO `city` VALUES ('230833', '抚远县', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230833', '抚远县', '2', '东北');
INSERT INTO `city` VALUES ('230881', '同江市', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230881', '同江市', '2', '东北');
INSERT INTO `city` VALUES ('230882', '富锦市', '230000', '黑龙江省', '黑龙江', '230800', '佳木斯市', '230882', '富锦市', '2', '东北');
INSERT INTO `city` VALUES ('230900', '七台河市', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('230901', '市辖区', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '230901', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('230902', '新兴区', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '230902', '新兴区', '2', '东北');
INSERT INTO `city` VALUES ('230903', '桃山区', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '230903', '桃山区', '2', '东北');
INSERT INTO `city` VALUES ('230904', '茄子河区', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '230904', '茄子河区', '2', '东北');
INSERT INTO `city` VALUES ('230921', '勃利县', '230000', '黑龙江省', '黑龙江', '230900', '七台河市', '230921', '勃利县', '2', '东北');
INSERT INTO `city` VALUES ('231000', '牡丹江市', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('231001', '市辖区', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231001', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('231002', '东安区', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231002', '东安区', '2', '东北');
INSERT INTO `city` VALUES ('231003', '阳明区', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231003', '阳明区', '2', '东北');
INSERT INTO `city` VALUES ('231004', '爱民区', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231004', '爱民区', '2', '东北');
INSERT INTO `city` VALUES ('231005', '西安区', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231005', '西安区', '2', '东北');
INSERT INTO `city` VALUES ('231024', '东宁县', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231024', '东宁县', '2', '东北');
INSERT INTO `city` VALUES ('231025', '林口县', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231025', '林口县', '2', '东北');
INSERT INTO `city` VALUES ('231081', '绥芬河市', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231081', '绥芬河市', '2', '东北');
INSERT INTO `city` VALUES ('231083', '海林市', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231083', '海林市', '2', '东北');
INSERT INTO `city` VALUES ('231084', '宁安市', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231084', '宁安市', '2', '东北');
INSERT INTO `city` VALUES ('231085', '穆棱市', '230000', '黑龙江省', '黑龙江', '231000', '牡丹江市', '231085', '穆棱市', '2', '东北');
INSERT INTO `city` VALUES ('231100', '黑河市', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('231101', '市辖区', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231101', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('231102', '爱辉区', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231102', '爱辉区', '2', '东北');
INSERT INTO `city` VALUES ('231121', '嫩江县', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231121', '嫩江县', '2', '东北');
INSERT INTO `city` VALUES ('231123', '逊克县', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231123', '逊克县', '2', '东北');
INSERT INTO `city` VALUES ('231124', '孙吴县', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231124', '孙吴县', '2', '东北');
INSERT INTO `city` VALUES ('231181', '北安市', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231181', '北安市', '2', '东北');
INSERT INTO `city` VALUES ('231182', '五大连池市', '230000', '黑龙江省', '黑龙江', '231100', '黑河市', '231182', '五大连池市', '2', '东北');
INSERT INTO `city` VALUES ('231200', '绥化市', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('231201', '市辖区', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231201', '市辖区', '2', '东北');
INSERT INTO `city` VALUES ('231202', '北林区', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231202', '北林区', '2', '东北');
INSERT INTO `city` VALUES ('231221', '望奎县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231221', '望奎县', '2', '东北');
INSERT INTO `city` VALUES ('231222', '兰西县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231222', '兰西县', '2', '东北');
INSERT INTO `city` VALUES ('231223', '青冈县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231223', '青冈县', '2', '东北');
INSERT INTO `city` VALUES ('231224', '庆安县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231224', '庆安县', '2', '东北');
INSERT INTO `city` VALUES ('231225', '明水县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231225', '明水县', '2', '东北');
INSERT INTO `city` VALUES ('231226', '绥棱县', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231226', '绥棱县', '2', '东北');
INSERT INTO `city` VALUES ('231281', '安达市', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231281', '安达市', '2', '东北');
INSERT INTO `city` VALUES ('231282', '肇东市', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231282', '肇东市', '2', '东北');
INSERT INTO `city` VALUES ('231283', '海伦市', '230000', '黑龙江省', '黑龙江', '231200', '绥化市', '231283', '海伦市', '2', '东北');
INSERT INTO `city` VALUES ('232700', '大兴安岭地区', '230000', '黑龙江省', '黑龙江', '232700', '大兴安岭地区', '0', '', '2', '东北');
INSERT INTO `city` VALUES ('232721', '呼玛县', '230000', '黑龙江省', '黑龙江', '232700', '大兴安岭地区', '232721', '呼玛县', '2', '东北');
INSERT INTO `city` VALUES ('232722', '塔河县', '230000', '黑龙江省', '黑龙江', '232700', '大兴安岭地区', '232722', '塔河县', '2', '东北');
INSERT INTO `city` VALUES ('232723', '漠河县', '230000', '黑龙江省', '黑龙江', '232700', '大兴安岭地区', '232723', '漠河县', '2', '东北');
INSERT INTO `city` VALUES ('310000', '上海市', '310000', '上海市', '上海', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310101', '黄浦区', '310000', '上海市', '上海', '310101', '黄浦区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310104', '徐汇区', '310000', '上海市', '上海', '310104', '徐汇区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310105', '长宁区', '310000', '上海市', '上海', '310105', '长宁区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310106', '静安区', '310000', '上海市', '上海', '310106', '静安区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310107', '普陀区', '310000', '上海市', '上海', '310107', '普陀区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310108', '闸北区', '310000', '上海市', '上海', '310108', '闸北区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310109', '虹口区', '310000', '上海市', '上海', '310109', '虹口区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310110', '杨浦区', '310000', '上海市', '上海', '310110', '杨浦区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310112', '闵行区', '310000', '上海市', '上海', '310112', '闵行区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310113', '宝山区', '310000', '上海市', '上海', '310113', '宝山区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310114', '嘉定区', '310000', '上海市', '上海', '310114', '嘉定区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310115', '浦东新区', '310000', '上海市', '上海', '310115', '浦东新区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310116', '金山区', '310000', '上海市', '上海', '310116', '金山区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310117', '松江区', '310000', '上海市', '上海', '310117', '松江区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310118', '青浦区', '310000', '上海市', '上海', '310118', '青浦区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310120', '奉贤区', '310000', '上海市', '上海', '310120', '奉贤区', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('310230', '崇明县', '310000', '上海市', '上海', '310230', '崇明县', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320000', '江苏省', '320000', '江苏省', '江苏', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320100', '南京市', '320000', '江苏省', '江苏', '320100', '南京市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320101', '市辖区', '320000', '江苏省', '江苏', '320100', '南京市', '320101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320102', '玄武区', '320000', '江苏省', '江苏', '320100', '南京市', '320102', '玄武区', '7', '华东');
INSERT INTO `city` VALUES ('320104', '秦淮区', '320000', '江苏省', '江苏', '320100', '南京市', '320104', '秦淮区', '7', '华东');
INSERT INTO `city` VALUES ('320105', '建邺区', '320000', '江苏省', '江苏', '320100', '南京市', '320105', '建邺区', '7', '华东');
INSERT INTO `city` VALUES ('320106', '鼓楼区', '320000', '江苏省', '江苏', '320100', '南京市', '320106', '鼓楼区', '7', '华东');
INSERT INTO `city` VALUES ('320111', '浦口区', '320000', '江苏省', '江苏', '320100', '南京市', '320111', '浦口区', '7', '华东');
INSERT INTO `city` VALUES ('320113', '栖霞区', '320000', '江苏省', '江苏', '320100', '南京市', '320113', '栖霞区', '7', '华东');
INSERT INTO `city` VALUES ('320114', '雨花台区', '320000', '江苏省', '江苏', '320100', '南京市', '320114', '雨花台区', '7', '华东');
INSERT INTO `city` VALUES ('320115', '江宁区', '320000', '江苏省', '江苏', '320100', '南京市', '320115', '江宁区', '7', '华东');
INSERT INTO `city` VALUES ('320116', '六合区', '320000', '江苏省', '江苏', '320100', '南京市', '320116', '六合区', '7', '华东');
INSERT INTO `city` VALUES ('320117', '溧水区', '320000', '江苏省', '江苏', '320100', '南京市', '320117', '溧水区', '7', '华东');
INSERT INTO `city` VALUES ('320118', '高淳区', '320000', '江苏省', '江苏', '320100', '南京市', '320118', '高淳区', '7', '华东');
INSERT INTO `city` VALUES ('320200', '无锡市', '320000', '江苏省', '江苏', '320200', '无锡市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320201', '市辖区', '320000', '江苏省', '江苏', '320200', '无锡市', '320201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320202', '崇安区', '320000', '江苏省', '江苏', '320200', '无锡市', '320202', '崇安区', '7', '华东');
INSERT INTO `city` VALUES ('320203', '南长区', '320000', '江苏省', '江苏', '320200', '无锡市', '320203', '南长区', '7', '华东');
INSERT INTO `city` VALUES ('320204', '北塘区', '320000', '江苏省', '江苏', '320200', '无锡市', '320204', '北塘区', '7', '华东');
INSERT INTO `city` VALUES ('320205', '锡山区', '320000', '江苏省', '江苏', '320200', '无锡市', '320205', '锡山区', '7', '华东');
INSERT INTO `city` VALUES ('320206', '惠山区', '320000', '江苏省', '江苏', '320200', '无锡市', '320206', '惠山区', '7', '华东');
INSERT INTO `city` VALUES ('320211', '滨湖区', '320000', '江苏省', '江苏', '320200', '无锡市', '320211', '滨湖区', '7', '华东');
INSERT INTO `city` VALUES ('320281', '江阴市', '320000', '江苏省', '江苏', '320200', '无锡市', '320281', '江阴市', '7', '华东');
INSERT INTO `city` VALUES ('320282', '宜兴市', '320000', '江苏省', '江苏', '320200', '无锡市', '320282', '宜兴市', '7', '华东');
INSERT INTO `city` VALUES ('320300', '徐州市', '320000', '江苏省', '江苏', '320300', '徐州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320301', '市辖区', '320000', '江苏省', '江苏', '320300', '徐州市', '320301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320302', '鼓楼区', '320000', '江苏省', '江苏', '320300', '徐州市', '320302', '鼓楼区', '7', '华东');
INSERT INTO `city` VALUES ('320303', '云龙区', '320000', '江苏省', '江苏', '320300', '徐州市', '320303', '云龙区', '7', '华东');
INSERT INTO `city` VALUES ('320305', '贾汪区', '320000', '江苏省', '江苏', '320300', '徐州市', '320305', '贾汪区', '7', '华东');
INSERT INTO `city` VALUES ('320311', '泉山区', '320000', '江苏省', '江苏', '320300', '徐州市', '320311', '泉山区', '7', '华东');
INSERT INTO `city` VALUES ('320312', '铜山区', '320000', '江苏省', '江苏', '320300', '徐州市', '320312', '铜山区', '7', '华东');
INSERT INTO `city` VALUES ('320321', '丰县', '320000', '江苏省', '江苏', '320300', '徐州市', '320321', '丰县', '7', '华东');
INSERT INTO `city` VALUES ('320322', '沛县', '320000', '江苏省', '江苏', '320300', '徐州市', '320322', '沛县', '7', '华东');
INSERT INTO `city` VALUES ('320324', '睢宁县', '320000', '江苏省', '江苏', '320300', '徐州市', '320324', '睢宁县', '7', '华东');
INSERT INTO `city` VALUES ('320381', '新沂市', '320000', '江苏省', '江苏', '320300', '徐州市', '320381', '新沂市', '7', '华东');
INSERT INTO `city` VALUES ('320382', '邳州市', '320000', '江苏省', '江苏', '320300', '徐州市', '320382', '邳州市', '7', '华东');
INSERT INTO `city` VALUES ('320400', '常州市', '320000', '江苏省', '江苏', '320400', '常州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320401', '市辖区', '320000', '江苏省', '江苏', '320400', '常州市', '320401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320402', '天宁区', '320000', '江苏省', '江苏', '320400', '常州市', '320402', '天宁区', '7', '华东');
INSERT INTO `city` VALUES ('320404', '钟楼区', '320000', '江苏省', '江苏', '320400', '常州市', '320404', '钟楼区', '7', '华东');
INSERT INTO `city` VALUES ('320405', '戚墅堰区', '320000', '江苏省', '江苏', '320400', '常州市', '320405', '戚墅堰区', '7', '华东');
INSERT INTO `city` VALUES ('320411', '新北区', '320000', '江苏省', '江苏', '320400', '常州市', '320411', '新北区', '7', '华东');
INSERT INTO `city` VALUES ('320412', '武进区', '320000', '江苏省', '江苏', '320400', '常州市', '320412', '武进区', '7', '华东');
INSERT INTO `city` VALUES ('320481', '溧阳市', '320000', '江苏省', '江苏', '320400', '常州市', '320481', '溧阳市', '7', '华东');
INSERT INTO `city` VALUES ('320482', '金坛市', '320000', '江苏省', '江苏', '320400', '常州市', '320482', '金坛市', '7', '华东');
INSERT INTO `city` VALUES ('320500', '苏州市', '320000', '江苏省', '江苏', '320500', '苏州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320501', '市辖区', '320000', '江苏省', '江苏', '320500', '苏州市', '320501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320505', '虎丘区', '320000', '江苏省', '江苏', '320500', '苏州市', '320505', '虎丘区', '7', '华东');
INSERT INTO `city` VALUES ('320506', '吴中区', '320000', '江苏省', '江苏', '320500', '苏州市', '320506', '吴中区', '7', '华东');
INSERT INTO `city` VALUES ('320507', '相城区', '320000', '江苏省', '江苏', '320500', '苏州市', '320507', '相城区', '7', '华东');
INSERT INTO `city` VALUES ('320508', '姑苏区', '320000', '江苏省', '江苏', '320500', '苏州市', '320508', '姑苏区', '7', '华东');
INSERT INTO `city` VALUES ('320509', '吴江区', '320000', '江苏省', '江苏', '320500', '苏州市', '320509', '吴江区', '7', '华东');
INSERT INTO `city` VALUES ('320581', '常熟市', '320000', '江苏省', '江苏', '320500', '苏州市', '320581', '常熟市', '7', '华东');
INSERT INTO `city` VALUES ('320582', '张家港市', '320000', '江苏省', '江苏', '320500', '苏州市', '320582', '张家港市', '7', '华东');
INSERT INTO `city` VALUES ('320583', '昆山市', '320000', '江苏省', '江苏', '320500', '苏州市', '320583', '昆山市', '7', '华东');
INSERT INTO `city` VALUES ('320585', '太仓市', '320000', '江苏省', '江苏', '320500', '苏州市', '320585', '太仓市', '7', '华东');
INSERT INTO `city` VALUES ('320600', '南通市', '320000', '江苏省', '江苏', '320600', '南通市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320601', '市辖区', '320000', '江苏省', '江苏', '320600', '南通市', '320601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320602', '崇川区', '320000', '江苏省', '江苏', '320600', '南通市', '320602', '崇川区', '7', '华东');
INSERT INTO `city` VALUES ('320611', '港闸区', '320000', '江苏省', '江苏', '320600', '南通市', '320611', '港闸区', '7', '华东');
INSERT INTO `city` VALUES ('320612', '通州区', '320000', '江苏省', '江苏', '320600', '南通市', '320612', '通州区', '7', '华东');
INSERT INTO `city` VALUES ('320621', '海安县', '320000', '江苏省', '江苏', '320600', '南通市', '320621', '海安县', '7', '华东');
INSERT INTO `city` VALUES ('320623', '如东县', '320000', '江苏省', '江苏', '320600', '南通市', '320623', '如东县', '7', '华东');
INSERT INTO `city` VALUES ('320681', '启东市', '320000', '江苏省', '江苏', '320600', '南通市', '320681', '启东市', '7', '华东');
INSERT INTO `city` VALUES ('320682', '如皋市', '320000', '江苏省', '江苏', '320600', '南通市', '320682', '如皋市', '7', '华东');
INSERT INTO `city` VALUES ('320684', '海门市', '320000', '江苏省', '江苏', '320600', '南通市', '320684', '海门市', '7', '华东');
INSERT INTO `city` VALUES ('320700', '连云港市', '320000', '江苏省', '江苏', '320700', '连云港市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320701', '市辖区', '320000', '江苏省', '江苏', '320700', '连云港市', '320701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320703', '连云区', '320000', '江苏省', '江苏', '320700', '连云港市', '320703', '连云区', '7', '华东');
INSERT INTO `city` VALUES ('320705', '新浦区', '320000', '江苏省', '江苏', '320700', '连云港市', '320705', '新浦区', '7', '华东');
INSERT INTO `city` VALUES ('320706', '海州区', '320000', '江苏省', '江苏', '320700', '连云港市', '320706', '海州区', '7', '华东');
INSERT INTO `city` VALUES ('320721', '赣榆县', '320000', '江苏省', '江苏', '320700', '连云港市', '320721', '赣榆县', '7', '华东');
INSERT INTO `city` VALUES ('320722', '东海县', '320000', '江苏省', '江苏', '320700', '连云港市', '320722', '东海县', '7', '华东');
INSERT INTO `city` VALUES ('320723', '灌云县', '320000', '江苏省', '江苏', '320700', '连云港市', '320723', '灌云县', '7', '华东');
INSERT INTO `city` VALUES ('320724', '灌南县', '320000', '江苏省', '江苏', '320700', '连云港市', '320724', '灌南县', '7', '华东');
INSERT INTO `city` VALUES ('320800', '淮安市', '320000', '江苏省', '江苏', '320800', '淮安市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320801', '市辖区', '320000', '江苏省', '江苏', '320800', '淮安市', '320801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320802', '清河区', '320000', '江苏省', '江苏', '320800', '淮安市', '320802', '清河区', '7', '华东');
INSERT INTO `city` VALUES ('320803', '淮安区', '320000', '江苏省', '江苏', '320800', '淮安市', '320803', '淮安区', '7', '华东');
INSERT INTO `city` VALUES ('320804', '淮阴区', '320000', '江苏省', '江苏', '320800', '淮安市', '320804', '淮阴区', '7', '华东');
INSERT INTO `city` VALUES ('320811', '清浦区', '320000', '江苏省', '江苏', '320800', '淮安市', '320811', '清浦区', '7', '华东');
INSERT INTO `city` VALUES ('320826', '涟水县', '320000', '江苏省', '江苏', '320800', '淮安市', '320826', '涟水县', '7', '华东');
INSERT INTO `city` VALUES ('320829', '洪泽县', '320000', '江苏省', '江苏', '320800', '淮安市', '320829', '洪泽县', '7', '华东');
INSERT INTO `city` VALUES ('320830', '盱眙县', '320000', '江苏省', '江苏', '320800', '淮安市', '320830', '盱眙县', '7', '华东');
INSERT INTO `city` VALUES ('320831', '金湖县', '320000', '江苏省', '江苏', '320800', '淮安市', '320831', '金湖县', '7', '华东');
INSERT INTO `city` VALUES ('320900', '盐城市', '320000', '江苏省', '江苏', '320900', '盐城市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('320901', '市辖区', '320000', '江苏省', '江苏', '320900', '盐城市', '320901', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('320902', '亭湖区', '320000', '江苏省', '江苏', '320900', '盐城市', '320902', '亭湖区', '7', '华东');
INSERT INTO `city` VALUES ('320903', '盐都区', '320000', '江苏省', '江苏', '320900', '盐城市', '320903', '盐都区', '7', '华东');
INSERT INTO `city` VALUES ('320921', '响水县', '320000', '江苏省', '江苏', '320900', '盐城市', '320921', '响水县', '7', '华东');
INSERT INTO `city` VALUES ('320922', '滨海县', '320000', '江苏省', '江苏', '320900', '盐城市', '320922', '滨海县', '7', '华东');
INSERT INTO `city` VALUES ('320923', '阜宁县', '320000', '江苏省', '江苏', '320900', '盐城市', '320923', '阜宁县', '7', '华东');
INSERT INTO `city` VALUES ('320924', '射阳县', '320000', '江苏省', '江苏', '320900', '盐城市', '320924', '射阳县', '7', '华东');
INSERT INTO `city` VALUES ('320925', '建湖县', '320000', '江苏省', '江苏', '320900', '盐城市', '320925', '建湖县', '7', '华东');
INSERT INTO `city` VALUES ('320981', '东台市', '320000', '江苏省', '江苏', '320900', '盐城市', '320981', '东台市', '7', '华东');
INSERT INTO `city` VALUES ('320982', '大丰市', '320000', '江苏省', '江苏', '320900', '盐城市', '320982', '大丰市', '7', '华东');
INSERT INTO `city` VALUES ('321000', '扬州市', '320000', '江苏省', '江苏', '321000', '扬州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('321001', '市辖区', '320000', '江苏省', '江苏', '321000', '扬州市', '321001', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('321002', '广陵区', '320000', '江苏省', '江苏', '321000', '扬州市', '321002', '广陵区', '7', '华东');
INSERT INTO `city` VALUES ('321003', '邗江区', '320000', '江苏省', '江苏', '321000', '扬州市', '321003', '邗江区', '7', '华东');
INSERT INTO `city` VALUES ('321012', '江都区', '320000', '江苏省', '江苏', '321000', '扬州市', '321012', '江都区', '7', '华东');
INSERT INTO `city` VALUES ('321023', '宝应县', '320000', '江苏省', '江苏', '321000', '扬州市', '321023', '宝应县', '7', '华东');
INSERT INTO `city` VALUES ('321081', '仪征市', '320000', '江苏省', '江苏', '321000', '扬州市', '321081', '仪征市', '7', '华东');
INSERT INTO `city` VALUES ('321084', '高邮市', '320000', '江苏省', '江苏', '321000', '扬州市', '321084', '高邮市', '7', '华东');
INSERT INTO `city` VALUES ('321100', '镇江市', '320000', '江苏省', '江苏', '321100', '镇江市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('321101', '市辖区', '320000', '江苏省', '江苏', '321100', '镇江市', '321101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('321102', '京口区', '320000', '江苏省', '江苏', '321100', '镇江市', '321102', '京口区', '7', '华东');
INSERT INTO `city` VALUES ('321111', '润州区', '320000', '江苏省', '江苏', '321100', '镇江市', '321111', '润州区', '7', '华东');
INSERT INTO `city` VALUES ('321112', '丹徒区', '320000', '江苏省', '江苏', '321100', '镇江市', '321112', '丹徒区', '7', '华东');
INSERT INTO `city` VALUES ('321181', '丹阳市', '320000', '江苏省', '江苏', '321100', '镇江市', '321181', '丹阳市', '7', '华东');
INSERT INTO `city` VALUES ('321182', '扬中市', '320000', '江苏省', '江苏', '321100', '镇江市', '321182', '扬中市', '7', '华东');
INSERT INTO `city` VALUES ('321183', '句容市', '320000', '江苏省', '江苏', '321100', '镇江市', '321183', '句容市', '7', '华东');
INSERT INTO `city` VALUES ('321200', '泰州市', '320000', '江苏省', '江苏', '321200', '泰州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('321201', '市辖区', '320000', '江苏省', '江苏', '321200', '泰州市', '321201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('321202', '海陵区', '320000', '江苏省', '江苏', '321200', '泰州市', '321202', '海陵区', '7', '华东');
INSERT INTO `city` VALUES ('321203', '高港区', '320000', '江苏省', '江苏', '321200', '泰州市', '321203', '高港区', '7', '华东');
INSERT INTO `city` VALUES ('321204', '姜堰区', '320000', '江苏省', '江苏', '321200', '泰州市', '321204', '姜堰区', '7', '华东');
INSERT INTO `city` VALUES ('321281', '兴化市', '320000', '江苏省', '江苏', '321200', '泰州市', '321281', '兴化市', '7', '华东');
INSERT INTO `city` VALUES ('321282', '靖江市', '320000', '江苏省', '江苏', '321200', '泰州市', '321282', '靖江市', '7', '华东');
INSERT INTO `city` VALUES ('321283', '泰兴市', '320000', '江苏省', '江苏', '321200', '泰州市', '321283', '泰兴市', '7', '华东');
INSERT INTO `city` VALUES ('321300', '宿迁市', '320000', '江苏省', '江苏', '321300', '宿迁市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('321301', '市辖区', '320000', '江苏省', '江苏', '321300', '宿迁市', '321301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('321302', '宿城区', '320000', '江苏省', '江苏', '321300', '宿迁市', '321302', '宿城区', '7', '华东');
INSERT INTO `city` VALUES ('321311', '宿豫区', '320000', '江苏省', '江苏', '321300', '宿迁市', '321311', '宿豫区', '7', '华东');
INSERT INTO `city` VALUES ('321322', '沭阳县', '320000', '江苏省', '江苏', '321300', '宿迁市', '321322', '沭阳县', '7', '华东');
INSERT INTO `city` VALUES ('321323', '泗阳县', '320000', '江苏省', '江苏', '321300', '宿迁市', '321323', '泗阳县', '7', '华东');
INSERT INTO `city` VALUES ('321324', '泗洪县', '320000', '江苏省', '江苏', '321300', '宿迁市', '321324', '泗洪县', '7', '华东');
INSERT INTO `city` VALUES ('330000', '浙江省', '330000', '浙江省', '浙江', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330100', '杭州市', '330000', '浙江省', '浙江', '330100', '杭州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330101', '市辖区', '330000', '浙江省', '浙江', '330100', '杭州市', '330101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330102', '上城区', '330000', '浙江省', '浙江', '330100', '杭州市', '330102', '上城区', '7', '华东');
INSERT INTO `city` VALUES ('330103', '下城区', '330000', '浙江省', '浙江', '330100', '杭州市', '330103', '下城区', '7', '华东');
INSERT INTO `city` VALUES ('330104', '江干区', '330000', '浙江省', '浙江', '330100', '杭州市', '330104', '江干区', '7', '华东');
INSERT INTO `city` VALUES ('330105', '拱墅区', '330000', '浙江省', '浙江', '330100', '杭州市', '330105', '拱墅区', '7', '华东');
INSERT INTO `city` VALUES ('330106', '西湖区', '330000', '浙江省', '浙江', '330100', '杭州市', '330106', '西湖区', '7', '华东');
INSERT INTO `city` VALUES ('330108', '滨江区', '330000', '浙江省', '浙江', '330100', '杭州市', '330108', '滨江区', '7', '华东');
INSERT INTO `city` VALUES ('330109', '萧山区', '330000', '浙江省', '浙江', '330100', '杭州市', '330109', '萧山区', '7', '华东');
INSERT INTO `city` VALUES ('330110', '余杭区', '330000', '浙江省', '浙江', '330100', '杭州市', '330110', '余杭区', '7', '华东');
INSERT INTO `city` VALUES ('330122', '桐庐县', '330000', '浙江省', '浙江', '330100', '杭州市', '330122', '桐庐县', '7', '华东');
INSERT INTO `city` VALUES ('330127', '淳安县', '330000', '浙江省', '浙江', '330100', '杭州市', '330127', '淳安县', '7', '华东');
INSERT INTO `city` VALUES ('330182', '建德市', '330000', '浙江省', '浙江', '330100', '杭州市', '330182', '建德市', '7', '华东');
INSERT INTO `city` VALUES ('330183', '富阳市', '330000', '浙江省', '浙江', '330100', '杭州市', '330183', '富阳市', '7', '华东');
INSERT INTO `city` VALUES ('330185', '临安市', '330000', '浙江省', '浙江', '330100', '杭州市', '330185', '临安市', '7', '华东');
INSERT INTO `city` VALUES ('330200', '宁波市', '330000', '浙江省', '浙江', '330200', '宁波市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330201', '市辖区', '330000', '浙江省', '浙江', '330200', '宁波市', '330201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330203', '海曙区', '330000', '浙江省', '浙江', '330200', '宁波市', '330203', '海曙区', '7', '华东');
INSERT INTO `city` VALUES ('330204', '江东区', '330000', '浙江省', '浙江', '330200', '宁波市', '330204', '江东区', '7', '华东');
INSERT INTO `city` VALUES ('330205', '江北区', '330000', '浙江省', '浙江', '330200', '宁波市', '330205', '江北区', '7', '华东');
INSERT INTO `city` VALUES ('330206', '北仑区', '330000', '浙江省', '浙江', '330200', '宁波市', '330206', '北仑区', '7', '华东');
INSERT INTO `city` VALUES ('330211', '镇海区', '330000', '浙江省', '浙江', '330200', '宁波市', '330211', '镇海区', '7', '华东');
INSERT INTO `city` VALUES ('330212', '鄞州区', '330000', '浙江省', '浙江', '330200', '宁波市', '330212', '鄞州区', '7', '华东');
INSERT INTO `city` VALUES ('330225', '象山县', '330000', '浙江省', '浙江', '330200', '宁波市', '330225', '象山县', '7', '华东');
INSERT INTO `city` VALUES ('330226', '宁海县', '330000', '浙江省', '浙江', '330200', '宁波市', '330226', '宁海县', '7', '华东');
INSERT INTO `city` VALUES ('330281', '余姚市', '330000', '浙江省', '浙江', '330200', '宁波市', '330281', '余姚市', '7', '华东');
INSERT INTO `city` VALUES ('330282', '慈溪市', '330000', '浙江省', '浙江', '330200', '宁波市', '330282', '慈溪市', '7', '华东');
INSERT INTO `city` VALUES ('330283', '奉化市', '330000', '浙江省', '浙江', '330200', '宁波市', '330283', '奉化市', '7', '华东');
INSERT INTO `city` VALUES ('330300', '温州市', '330000', '浙江省', '浙江', '330300', '温州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330301', '市辖区', '330000', '浙江省', '浙江', '330300', '温州市', '330301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330302', '鹿城区', '330000', '浙江省', '浙江', '330300', '温州市', '330302', '鹿城区', '7', '华东');
INSERT INTO `city` VALUES ('330303', '龙湾区', '330000', '浙江省', '浙江', '330300', '温州市', '330303', '龙湾区', '7', '华东');
INSERT INTO `city` VALUES ('330304', '瓯海区', '330000', '浙江省', '浙江', '330300', '温州市', '330304', '瓯海区', '7', '华东');
INSERT INTO `city` VALUES ('330322', '洞头县', '330000', '浙江省', '浙江', '330300', '温州市', '330322', '洞头县', '7', '华东');
INSERT INTO `city` VALUES ('330324', '永嘉县', '330000', '浙江省', '浙江', '330300', '温州市', '330324', '永嘉县', '7', '华东');
INSERT INTO `city` VALUES ('330326', '平阳县', '330000', '浙江省', '浙江', '330300', '温州市', '330326', '平阳县', '7', '华东');
INSERT INTO `city` VALUES ('330327', '苍南县', '330000', '浙江省', '浙江', '330300', '温州市', '330327', '苍南县', '7', '华东');
INSERT INTO `city` VALUES ('330328', '文成县', '330000', '浙江省', '浙江', '330300', '温州市', '330328', '文成县', '7', '华东');
INSERT INTO `city` VALUES ('330329', '泰顺县', '330000', '浙江省', '浙江', '330300', '温州市', '330329', '泰顺县', '7', '华东');
INSERT INTO `city` VALUES ('330381', '瑞安市', '330000', '浙江省', '浙江', '330300', '温州市', '330381', '瑞安市', '7', '华东');
INSERT INTO `city` VALUES ('330382', '乐清市', '330000', '浙江省', '浙江', '330300', '温州市', '330382', '乐清市', '7', '华东');
INSERT INTO `city` VALUES ('330400', '嘉兴市', '330000', '浙江省', '浙江', '330400', '嘉兴市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330401', '市辖区', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330402', '南湖区', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330402', '南湖区', '7', '华东');
INSERT INTO `city` VALUES ('330411', '秀洲区', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330411', '秀洲区', '7', '华东');
INSERT INTO `city` VALUES ('330421', '嘉善县', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330421', '嘉善县', '7', '华东');
INSERT INTO `city` VALUES ('330424', '海盐县', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330424', '海盐县', '7', '华东');
INSERT INTO `city` VALUES ('330481', '海宁市', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330481', '海宁市', '7', '华东');
INSERT INTO `city` VALUES ('330482', '平湖市', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330482', '平湖市', '7', '华东');
INSERT INTO `city` VALUES ('330483', '桐乡市', '330000', '浙江省', '浙江', '330400', '嘉兴市', '330483', '桐乡市', '7', '华东');
INSERT INTO `city` VALUES ('330500', '湖州市', '330000', '浙江省', '浙江', '330500', '湖州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330501', '市辖区', '330000', '浙江省', '浙江', '330500', '湖州市', '330501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330502', '吴兴区', '330000', '浙江省', '浙江', '330500', '湖州市', '330502', '吴兴区', '7', '华东');
INSERT INTO `city` VALUES ('330503', '南浔区', '330000', '浙江省', '浙江', '330500', '湖州市', '330503', '南浔区', '7', '华东');
INSERT INTO `city` VALUES ('330521', '德清县', '330000', '浙江省', '浙江', '330500', '湖州市', '330521', '德清县', '7', '华东');
INSERT INTO `city` VALUES ('330522', '长兴县', '330000', '浙江省', '浙江', '330500', '湖州市', '330522', '长兴县', '7', '华东');
INSERT INTO `city` VALUES ('330523', '安吉县', '330000', '浙江省', '浙江', '330500', '湖州市', '330523', '安吉县', '7', '华东');
INSERT INTO `city` VALUES ('330600', '绍兴市', '330000', '浙江省', '浙江', '330600', '绍兴市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330601', '市辖区', '330000', '浙江省', '浙江', '330600', '绍兴市', '330601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330602', '越城区', '330000', '浙江省', '浙江', '330600', '绍兴市', '330602', '越城区', '7', '华东');
INSERT INTO `city` VALUES ('330621', '绍兴县', '330000', '浙江省', '浙江', '330600', '绍兴市', '330621', '绍兴县', '7', '华东');
INSERT INTO `city` VALUES ('330624', '新昌县', '330000', '浙江省', '浙江', '330600', '绍兴市', '330624', '新昌县', '7', '华东');
INSERT INTO `city` VALUES ('330681', '诸暨市', '330000', '浙江省', '浙江', '330600', '绍兴市', '330681', '诸暨市', '7', '华东');
INSERT INTO `city` VALUES ('330682', '上虞市', '330000', '浙江省', '浙江', '330600', '绍兴市', '330682', '上虞市', '7', '华东');
INSERT INTO `city` VALUES ('330683', '嵊州市', '330000', '浙江省', '浙江', '330600', '绍兴市', '330683', '嵊州市', '7', '华东');
INSERT INTO `city` VALUES ('330700', '金华市', '330000', '浙江省', '浙江', '330700', '金华市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330701', '市辖区', '330000', '浙江省', '浙江', '330700', '金华市', '330701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330702', '婺城区', '330000', '浙江省', '浙江', '330700', '金华市', '330702', '婺城区', '7', '华东');
INSERT INTO `city` VALUES ('330703', '金东区', '330000', '浙江省', '浙江', '330700', '金华市', '330703', '金东区', '7', '华东');
INSERT INTO `city` VALUES ('330723', '武义县', '330000', '浙江省', '浙江', '330700', '金华市', '330723', '武义县', '7', '华东');
INSERT INTO `city` VALUES ('330726', '浦江县', '330000', '浙江省', '浙江', '330700', '金华市', '330726', '浦江县', '7', '华东');
INSERT INTO `city` VALUES ('330727', '磐安县', '330000', '浙江省', '浙江', '330700', '金华市', '330727', '磐安县', '7', '华东');
INSERT INTO `city` VALUES ('330781', '兰溪市', '330000', '浙江省', '浙江', '330700', '金华市', '330781', '兰溪市', '7', '华东');
INSERT INTO `city` VALUES ('330782', '义乌市', '330000', '浙江省', '浙江', '330700', '金华市', '330782', '义乌市', '7', '华东');
INSERT INTO `city` VALUES ('330783', '东阳市', '330000', '浙江省', '浙江', '330700', '金华市', '330783', '东阳市', '7', '华东');
INSERT INTO `city` VALUES ('330784', '永康市', '330000', '浙江省', '浙江', '330700', '金华市', '330784', '永康市', '7', '华东');
INSERT INTO `city` VALUES ('330800', '衢州市', '330000', '浙江省', '浙江', '330800', '衢州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330801', '市辖区', '330000', '浙江省', '浙江', '330800', '衢州市', '330801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330802', '柯城区', '330000', '浙江省', '浙江', '330800', '衢州市', '330802', '柯城区', '7', '华东');
INSERT INTO `city` VALUES ('330803', '衢江区', '330000', '浙江省', '浙江', '330800', '衢州市', '330803', '衢江区', '7', '华东');
INSERT INTO `city` VALUES ('330822', '常山县', '330000', '浙江省', '浙江', '330800', '衢州市', '330822', '常山县', '7', '华东');
INSERT INTO `city` VALUES ('330824', '开化县', '330000', '浙江省', '浙江', '330800', '衢州市', '330824', '开化县', '7', '华东');
INSERT INTO `city` VALUES ('330825', '龙游县', '330000', '浙江省', '浙江', '330800', '衢州市', '330825', '龙游县', '7', '华东');
INSERT INTO `city` VALUES ('330881', '江山市', '330000', '浙江省', '浙江', '330800', '衢州市', '330881', '江山市', '7', '华东');
INSERT INTO `city` VALUES ('330900', '舟山市', '330000', '浙江省', '浙江', '330900', '舟山市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('330901', '市辖区', '330000', '浙江省', '浙江', '330900', '舟山市', '330901', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('330902', '定海区', '330000', '浙江省', '浙江', '330900', '舟山市', '330902', '定海区', '7', '华东');
INSERT INTO `city` VALUES ('330903', '普陀区', '330000', '浙江省', '浙江', '330900', '舟山市', '330903', '普陀区', '7', '华东');
INSERT INTO `city` VALUES ('330921', '岱山县', '330000', '浙江省', '浙江', '330900', '舟山市', '330921', '岱山县', '7', '华东');
INSERT INTO `city` VALUES ('330922', '嵊泗县', '330000', '浙江省', '浙江', '330900', '舟山市', '330922', '嵊泗县', '7', '华东');
INSERT INTO `city` VALUES ('331000', '台州市', '330000', '浙江省', '浙江', '331000', '台州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('331001', '市辖区', '330000', '浙江省', '浙江', '331000', '台州市', '331001', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('331002', '椒江区', '330000', '浙江省', '浙江', '331000', '台州市', '331002', '椒江区', '7', '华东');
INSERT INTO `city` VALUES ('331003', '黄岩区', '330000', '浙江省', '浙江', '331000', '台州市', '331003', '黄岩区', '7', '华东');
INSERT INTO `city` VALUES ('331004', '路桥区', '330000', '浙江省', '浙江', '331000', '台州市', '331004', '路桥区', '7', '华东');
INSERT INTO `city` VALUES ('331021', '玉环县', '330000', '浙江省', '浙江', '331000', '台州市', '331021', '玉环县', '7', '华东');
INSERT INTO `city` VALUES ('331022', '三门县', '330000', '浙江省', '浙江', '331000', '台州市', '331022', '三门县', '7', '华东');
INSERT INTO `city` VALUES ('331023', '天台县', '330000', '浙江省', '浙江', '331000', '台州市', '331023', '天台县', '7', '华东');
INSERT INTO `city` VALUES ('331024', '仙居县', '330000', '浙江省', '浙江', '331000', '台州市', '331024', '仙居县', '7', '华东');
INSERT INTO `city` VALUES ('331081', '温岭市', '330000', '浙江省', '浙江', '331000', '台州市', '331081', '温岭市', '7', '华东');
INSERT INTO `city` VALUES ('331082', '临海市', '330000', '浙江省', '浙江', '331000', '台州市', '331082', '临海市', '7', '华东');
INSERT INTO `city` VALUES ('331100', '丽水市', '330000', '浙江省', '浙江', '331100', '丽水市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('331101', '市辖区', '330000', '浙江省', '浙江', '331100', '丽水市', '331101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('331102', '莲都区', '330000', '浙江省', '浙江', '331100', '丽水市', '331102', '莲都区', '7', '华东');
INSERT INTO `city` VALUES ('331121', '青田县', '330000', '浙江省', '浙江', '331100', '丽水市', '331121', '青田县', '7', '华东');
INSERT INTO `city` VALUES ('331122', '缙云县', '330000', '浙江省', '浙江', '331100', '丽水市', '331122', '缙云县', '7', '华东');
INSERT INTO `city` VALUES ('331123', '遂昌县', '330000', '浙江省', '浙江', '331100', '丽水市', '331123', '遂昌县', '7', '华东');
INSERT INTO `city` VALUES ('331124', '松阳县', '330000', '浙江省', '浙江', '331100', '丽水市', '331124', '松阳县', '7', '华东');
INSERT INTO `city` VALUES ('331125', '云和县', '330000', '浙江省', '浙江', '331100', '丽水市', '331125', '云和县', '7', '华东');
INSERT INTO `city` VALUES ('331126', '庆元县', '330000', '浙江省', '浙江', '331100', '丽水市', '331126', '庆元县', '7', '华东');
INSERT INTO `city` VALUES ('331127', '景宁畲族自治县', '330000', '浙江省', '浙江', '331100', '丽水市', '331127', '景宁畲族自治县', '7', '华东');
INSERT INTO `city` VALUES ('331181', '龙泉市', '330000', '浙江省', '浙江', '331100', '丽水市', '331181', '龙泉市', '7', '华东');
INSERT INTO `city` VALUES ('340000', '安徽省', '340000', '安徽省', '安徽', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340100', '合肥市', '340000', '安徽省', '安徽', '340100', '合肥市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340101', '市辖区', '340000', '安徽省', '安徽', '340100', '合肥市', '340101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340102', '瑶海区', '340000', '安徽省', '安徽', '340100', '合肥市', '340102', '瑶海区', '7', '华东');
INSERT INTO `city` VALUES ('340103', '庐阳区', '340000', '安徽省', '安徽', '340100', '合肥市', '340103', '庐阳区', '7', '华东');
INSERT INTO `city` VALUES ('340104', '蜀山区', '340000', '安徽省', '安徽', '340100', '合肥市', '340104', '蜀山区', '7', '华东');
INSERT INTO `city` VALUES ('340111', '包河区', '340000', '安徽省', '安徽', '340100', '合肥市', '340111', '包河区', '7', '华东');
INSERT INTO `city` VALUES ('340121', '长丰县', '340000', '安徽省', '安徽', '340100', '合肥市', '340121', '长丰县', '7', '华东');
INSERT INTO `city` VALUES ('340122', '肥东县', '340000', '安徽省', '安徽', '340100', '合肥市', '340122', '肥东县', '7', '华东');
INSERT INTO `city` VALUES ('340123', '肥西县', '340000', '安徽省', '安徽', '340100', '合肥市', '340123', '肥西县', '7', '华东');
INSERT INTO `city` VALUES ('340124', '庐江县', '340000', '安徽省', '安徽', '340100', '合肥市', '340124', '庐江县', '7', '华东');
INSERT INTO `city` VALUES ('340181', '巢湖市', '340000', '安徽省', '安徽', '340100', '合肥市', '340181', '巢湖市', '7', '华东');
INSERT INTO `city` VALUES ('340200', '芜湖市', '340000', '安徽省', '安徽', '340200', '芜湖市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340201', '市辖区', '340000', '安徽省', '安徽', '340200', '芜湖市', '340201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340202', '镜湖区', '340000', '安徽省', '安徽', '340200', '芜湖市', '340202', '镜湖区', '7', '华东');
INSERT INTO `city` VALUES ('340203', '弋江区', '340000', '安徽省', '安徽', '340200', '芜湖市', '340203', '弋江区', '7', '华东');
INSERT INTO `city` VALUES ('340207', '鸠江区', '340000', '安徽省', '安徽', '340200', '芜湖市', '340207', '鸠江区', '7', '华东');
INSERT INTO `city` VALUES ('340208', '三山区', '340000', '安徽省', '安徽', '340200', '芜湖市', '340208', '三山区', '7', '华东');
INSERT INTO `city` VALUES ('340221', '芜湖县', '340000', '安徽省', '安徽', '340200', '芜湖市', '340221', '芜湖县', '7', '华东');
INSERT INTO `city` VALUES ('340222', '繁昌县', '340000', '安徽省', '安徽', '340200', '芜湖市', '340222', '繁昌县', '7', '华东');
INSERT INTO `city` VALUES ('340223', '南陵县', '340000', '安徽省', '安徽', '340200', '芜湖市', '340223', '南陵县', '7', '华东');
INSERT INTO `city` VALUES ('340225', '无为县', '340000', '安徽省', '安徽', '340200', '芜湖市', '340225', '无为县', '7', '华东');
INSERT INTO `city` VALUES ('340300', '蚌埠市', '340000', '安徽省', '安徽', '340300', '蚌埠市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340301', '市辖区', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340302', '龙子湖区', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340302', '龙子湖区', '7', '华东');
INSERT INTO `city` VALUES ('340303', '蚌山区', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340303', '蚌山区', '7', '华东');
INSERT INTO `city` VALUES ('340304', '禹会区', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340304', '禹会区', '7', '华东');
INSERT INTO `city` VALUES ('340311', '淮上区', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340311', '淮上区', '7', '华东');
INSERT INTO `city` VALUES ('340321', '怀远县', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340321', '怀远县', '7', '华东');
INSERT INTO `city` VALUES ('340322', '五河县', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340322', '五河县', '7', '华东');
INSERT INTO `city` VALUES ('340323', '固镇县', '340000', '安徽省', '安徽', '340300', '蚌埠市', '340323', '固镇县', '7', '华东');
INSERT INTO `city` VALUES ('340400', '淮南市', '340000', '安徽省', '安徽', '340400', '淮南市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340401', '市辖区', '340000', '安徽省', '安徽', '340400', '淮南市', '340401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340402', '大通区', '340000', '安徽省', '安徽', '340400', '淮南市', '340402', '大通区', '7', '华东');
INSERT INTO `city` VALUES ('340403', '田家庵区', '340000', '安徽省', '安徽', '340400', '淮南市', '340403', '田家庵区', '7', '华东');
INSERT INTO `city` VALUES ('340404', '谢家集区', '340000', '安徽省', '安徽', '340400', '淮南市', '340404', '谢家集区', '7', '华东');
INSERT INTO `city` VALUES ('340405', '八公山区', '340000', '安徽省', '安徽', '340400', '淮南市', '340405', '八公山区', '7', '华东');
INSERT INTO `city` VALUES ('340406', '潘集区', '340000', '安徽省', '安徽', '340400', '淮南市', '340406', '潘集区', '7', '华东');
INSERT INTO `city` VALUES ('340421', '凤台县', '340000', '安徽省', '安徽', '340400', '淮南市', '340421', '凤台县', '7', '华东');
INSERT INTO `city` VALUES ('340500', '马鞍山市', '340000', '安徽省', '安徽', '340500', '马鞍山市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340501', '市辖区', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340503', '花山区', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340503', '花山区', '7', '华东');
INSERT INTO `city` VALUES ('340504', '雨山区', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340504', '雨山区', '7', '华东');
INSERT INTO `city` VALUES ('340506', '博望区', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340506', '博望区', '7', '华东');
INSERT INTO `city` VALUES ('340521', '当涂县', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340521', '当涂县', '7', '华东');
INSERT INTO `city` VALUES ('340522', '含山县', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340522', '含山县', '7', '华东');
INSERT INTO `city` VALUES ('340523', '和县', '340000', '安徽省', '安徽', '340500', '马鞍山市', '340523', '和县', '7', '华东');
INSERT INTO `city` VALUES ('340600', '淮北市', '340000', '安徽省', '安徽', '340600', '淮北市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340601', '市辖区', '340000', '安徽省', '安徽', '340600', '淮北市', '340601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340602', '杜集区', '340000', '安徽省', '安徽', '340600', '淮北市', '340602', '杜集区', '7', '华东');
INSERT INTO `city` VALUES ('340603', '相山区', '340000', '安徽省', '安徽', '340600', '淮北市', '340603', '相山区', '7', '华东');
INSERT INTO `city` VALUES ('340604', '烈山区', '340000', '安徽省', '安徽', '340600', '淮北市', '340604', '烈山区', '7', '华东');
INSERT INTO `city` VALUES ('340621', '濉溪县', '340000', '安徽省', '安徽', '340600', '淮北市', '340621', '濉溪县', '7', '华东');
INSERT INTO `city` VALUES ('340700', '铜陵市', '340000', '安徽省', '安徽', '340700', '铜陵市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340701', '市辖区', '340000', '安徽省', '安徽', '340700', '铜陵市', '340701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340702', '铜官山区', '340000', '安徽省', '安徽', '340700', '铜陵市', '340702', '铜官山区', '7', '华东');
INSERT INTO `city` VALUES ('340703', '狮子山区', '340000', '安徽省', '安徽', '340700', '铜陵市', '340703', '狮子山区', '7', '华东');
INSERT INTO `city` VALUES ('340711', '郊区', '340000', '安徽省', '安徽', '340700', '铜陵市', '340711', '郊区', '7', '华东');
INSERT INTO `city` VALUES ('340721', '铜陵县', '340000', '安徽省', '安徽', '340700', '铜陵市', '340721', '铜陵县', '7', '华东');
INSERT INTO `city` VALUES ('340800', '安庆市', '340000', '安徽省', '安徽', '340800', '安庆市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('340801', '市辖区', '340000', '安徽省', '安徽', '340800', '安庆市', '340801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('340802', '迎江区', '340000', '安徽省', '安徽', '340800', '安庆市', '340802', '迎江区', '7', '华东');
INSERT INTO `city` VALUES ('340803', '大观区', '340000', '安徽省', '安徽', '340800', '安庆市', '340803', '大观区', '7', '华东');
INSERT INTO `city` VALUES ('340811', '宜秀区', '340000', '安徽省', '安徽', '340800', '安庆市', '340811', '宜秀区', '7', '华东');
INSERT INTO `city` VALUES ('340822', '怀宁县', '340000', '安徽省', '安徽', '340800', '安庆市', '340822', '怀宁县', '7', '华东');
INSERT INTO `city` VALUES ('340823', '枞阳县', '340000', '安徽省', '安徽', '340800', '安庆市', '340823', '枞阳县', '7', '华东');
INSERT INTO `city` VALUES ('340824', '潜山县', '340000', '安徽省', '安徽', '340800', '安庆市', '340824', '潜山县', '7', '华东');
INSERT INTO `city` VALUES ('340825', '太湖县', '340000', '安徽省', '安徽', '340800', '安庆市', '340825', '太湖县', '7', '华东');
INSERT INTO `city` VALUES ('340826', '宿松县', '340000', '安徽省', '安徽', '340800', '安庆市', '340826', '宿松县', '7', '华东');
INSERT INTO `city` VALUES ('340827', '望江县', '340000', '安徽省', '安徽', '340800', '安庆市', '340827', '望江县', '7', '华东');
INSERT INTO `city` VALUES ('340828', '岳西县', '340000', '安徽省', '安徽', '340800', '安庆市', '340828', '岳西县', '7', '华东');
INSERT INTO `city` VALUES ('340881', '桐城市', '340000', '安徽省', '安徽', '340800', '安庆市', '340881', '桐城市', '7', '华东');
INSERT INTO `city` VALUES ('341000', '黄山市', '340000', '安徽省', '安徽', '341000', '黄山市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341001', '市辖区', '340000', '安徽省', '安徽', '341000', '黄山市', '341001', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341002', '屯溪区', '340000', '安徽省', '安徽', '341000', '黄山市', '341002', '屯溪区', '7', '华东');
INSERT INTO `city` VALUES ('341003', '黄山区', '340000', '安徽省', '安徽', '341000', '黄山市', '341003', '黄山区', '7', '华东');
INSERT INTO `city` VALUES ('341004', '徽州区', '340000', '安徽省', '安徽', '341000', '黄山市', '341004', '徽州区', '7', '华东');
INSERT INTO `city` VALUES ('341021', '歙县', '340000', '安徽省', '安徽', '341000', '黄山市', '341021', '歙县', '7', '华东');
INSERT INTO `city` VALUES ('341022', '休宁县', '340000', '安徽省', '安徽', '341000', '黄山市', '341022', '休宁县', '7', '华东');
INSERT INTO `city` VALUES ('341023', '黟县', '340000', '安徽省', '安徽', '341000', '黄山市', '341023', '黟县', '7', '华东');
INSERT INTO `city` VALUES ('341024', '祁门县', '340000', '安徽省', '安徽', '341000', '黄山市', '341024', '祁门县', '7', '华东');
INSERT INTO `city` VALUES ('341100', '滁州市', '340000', '安徽省', '安徽', '341100', '滁州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341101', '市辖区', '340000', '安徽省', '安徽', '341100', '滁州市', '341101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341102', '琅琊区', '340000', '安徽省', '安徽', '341100', '滁州市', '341102', '琅琊区', '7', '华东');
INSERT INTO `city` VALUES ('341103', '南谯区', '340000', '安徽省', '安徽', '341100', '滁州市', '341103', '南谯区', '7', '华东');
INSERT INTO `city` VALUES ('341122', '来安县', '340000', '安徽省', '安徽', '341100', '滁州市', '341122', '来安县', '7', '华东');
INSERT INTO `city` VALUES ('341124', '全椒县', '340000', '安徽省', '安徽', '341100', '滁州市', '341124', '全椒县', '7', '华东');
INSERT INTO `city` VALUES ('341125', '定远县', '340000', '安徽省', '安徽', '341100', '滁州市', '341125', '定远县', '7', '华东');
INSERT INTO `city` VALUES ('341126', '凤阳县', '340000', '安徽省', '安徽', '341100', '滁州市', '341126', '凤阳县', '7', '华东');
INSERT INTO `city` VALUES ('341181', '天长市', '340000', '安徽省', '安徽', '341100', '滁州市', '341181', '天长市', '7', '华东');
INSERT INTO `city` VALUES ('341182', '明光市', '340000', '安徽省', '安徽', '341100', '滁州市', '341182', '明光市', '7', '华东');
INSERT INTO `city` VALUES ('341200', '阜阳市', '340000', '安徽省', '安徽', '341200', '阜阳市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341201', '市辖区', '340000', '安徽省', '安徽', '341200', '阜阳市', '341201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341202', '颍州区', '340000', '安徽省', '安徽', '341200', '阜阳市', '341202', '颍州区', '7', '华东');
INSERT INTO `city` VALUES ('341203', '颍东区', '340000', '安徽省', '安徽', '341200', '阜阳市', '341203', '颍东区', '7', '华东');
INSERT INTO `city` VALUES ('341204', '颍泉区', '340000', '安徽省', '安徽', '341200', '阜阳市', '341204', '颍泉区', '7', '华东');
INSERT INTO `city` VALUES ('341221', '临泉县', '340000', '安徽省', '安徽', '341200', '阜阳市', '341221', '临泉县', '7', '华东');
INSERT INTO `city` VALUES ('341222', '太和县', '340000', '安徽省', '安徽', '341200', '阜阳市', '341222', '太和县', '7', '华东');
INSERT INTO `city` VALUES ('341225', '阜南县', '340000', '安徽省', '安徽', '341200', '阜阳市', '341225', '阜南县', '7', '华东');
INSERT INTO `city` VALUES ('341226', '颍上县', '340000', '安徽省', '安徽', '341200', '阜阳市', '341226', '颍上县', '7', '华东');
INSERT INTO `city` VALUES ('341282', '界首市', '340000', '安徽省', '安徽', '341200', '阜阳市', '341282', '界首市', '7', '华东');
INSERT INTO `city` VALUES ('341300', '宿州市', '340000', '安徽省', '安徽', '341300', '宿州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341301', '市辖区', '340000', '安徽省', '安徽', '341300', '宿州市', '341301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341302', '埇桥区', '340000', '安徽省', '安徽', '341300', '宿州市', '341302', '埇桥区', '7', '华东');
INSERT INTO `city` VALUES ('341321', '砀山县', '340000', '安徽省', '安徽', '341300', '宿州市', '341321', '砀山县', '7', '华东');
INSERT INTO `city` VALUES ('341322', '萧县', '340000', '安徽省', '安徽', '341300', '宿州市', '341322', '萧县', '7', '华东');
INSERT INTO `city` VALUES ('341323', '灵璧县', '340000', '安徽省', '安徽', '341300', '宿州市', '341323', '灵璧县', '7', '华东');
INSERT INTO `city` VALUES ('341324', '泗县', '340000', '安徽省', '安徽', '341300', '宿州市', '341324', '泗县', '7', '华东');
INSERT INTO `city` VALUES ('341500', '六安市', '340000', '安徽省', '安徽', '341500', '六安市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341501', '市辖区', '340000', '安徽省', '安徽', '341500', '六安市', '341501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341502', '金安区', '340000', '安徽省', '安徽', '341500', '六安市', '341502', '金安区', '7', '华东');
INSERT INTO `city` VALUES ('341503', '裕安区', '340000', '安徽省', '安徽', '341500', '六安市', '341503', '裕安区', '7', '华东');
INSERT INTO `city` VALUES ('341521', '寿县', '340000', '安徽省', '安徽', '341500', '六安市', '341521', '寿县', '7', '华东');
INSERT INTO `city` VALUES ('341522', '霍邱县', '340000', '安徽省', '安徽', '341500', '六安市', '341522', '霍邱县', '7', '华东');
INSERT INTO `city` VALUES ('341523', '舒城县', '340000', '安徽省', '安徽', '341500', '六安市', '341523', '舒城县', '7', '华东');
INSERT INTO `city` VALUES ('341524', '金寨县', '340000', '安徽省', '安徽', '341500', '六安市', '341524', '金寨县', '7', '华东');
INSERT INTO `city` VALUES ('341525', '霍山县', '340000', '安徽省', '安徽', '341500', '六安市', '341525', '霍山县', '7', '华东');
INSERT INTO `city` VALUES ('341600', '亳州市', '340000', '安徽省', '安徽', '341600', '亳州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341601', '市辖区', '340000', '安徽省', '安徽', '341600', '亳州市', '341601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341602', '谯城区', '340000', '安徽省', '安徽', '341600', '亳州市', '341602', '谯城区', '7', '华东');
INSERT INTO `city` VALUES ('341621', '涡阳县', '340000', '安徽省', '安徽', '341600', '亳州市', '341621', '涡阳县', '7', '华东');
INSERT INTO `city` VALUES ('341622', '蒙城县', '340000', '安徽省', '安徽', '341600', '亳州市', '341622', '蒙城县', '7', '华东');
INSERT INTO `city` VALUES ('341623', '利辛县', '340000', '安徽省', '安徽', '341600', '亳州市', '341623', '利辛县', '7', '华东');
INSERT INTO `city` VALUES ('341700', '池州市', '340000', '安徽省', '安徽', '341700', '池州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341701', '市辖区', '340000', '安徽省', '安徽', '341700', '池州市', '341701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341702', '贵池区', '340000', '安徽省', '安徽', '341700', '池州市', '341702', '贵池区', '7', '华东');
INSERT INTO `city` VALUES ('341721', '东至县', '340000', '安徽省', '安徽', '341700', '池州市', '341721', '东至县', '7', '华东');
INSERT INTO `city` VALUES ('341722', '石台县', '340000', '安徽省', '安徽', '341700', '池州市', '341722', '石台县', '7', '华东');
INSERT INTO `city` VALUES ('341723', '青阳县', '340000', '安徽省', '安徽', '341700', '池州市', '341723', '青阳县', '7', '华东');
INSERT INTO `city` VALUES ('341800', '宣城市', '340000', '安徽省', '安徽', '341800', '宣城市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('341801', '市辖区', '340000', '安徽省', '安徽', '341800', '宣城市', '341801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('341802', '宣州区', '340000', '安徽省', '安徽', '341800', '宣城市', '341802', '宣州区', '7', '华东');
INSERT INTO `city` VALUES ('341821', '郎溪县', '340000', '安徽省', '安徽', '341800', '宣城市', '341821', '郎溪县', '7', '华东');
INSERT INTO `city` VALUES ('341822', '广德县', '340000', '安徽省', '安徽', '341800', '宣城市', '341822', '广德县', '7', '华东');
INSERT INTO `city` VALUES ('341823', '泾县', '340000', '安徽省', '安徽', '341800', '宣城市', '341823', '泾县', '7', '华东');
INSERT INTO `city` VALUES ('341824', '绩溪县', '340000', '安徽省', '安徽', '341800', '宣城市', '341824', '绩溪县', '7', '华东');
INSERT INTO `city` VALUES ('341825', '旌德县', '340000', '安徽省', '安徽', '341800', '宣城市', '341825', '旌德县', '7', '华东');
INSERT INTO `city` VALUES ('341881', '宁国市', '340000', '安徽省', '安徽', '341800', '宣城市', '341881', '宁国市', '7', '华东');
INSERT INTO `city` VALUES ('350000', '福建省', '350000', '福建省', '福建', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350100', '福州市', '350000', '福建省', '福建', '350100', '福州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350101', '市辖区', '350000', '福建省', '福建', '350100', '福州市', '350101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350102', '鼓楼区', '350000', '福建省', '福建', '350100', '福州市', '350102', '鼓楼区', '7', '华东');
INSERT INTO `city` VALUES ('350103', '台江区', '350000', '福建省', '福建', '350100', '福州市', '350103', '台江区', '7', '华东');
INSERT INTO `city` VALUES ('350104', '仓山区', '350000', '福建省', '福建', '350100', '福州市', '350104', '仓山区', '7', '华东');
INSERT INTO `city` VALUES ('350105', '马尾区', '350000', '福建省', '福建', '350100', '福州市', '350105', '马尾区', '7', '华东');
INSERT INTO `city` VALUES ('350111', '晋安区', '350000', '福建省', '福建', '350100', '福州市', '350111', '晋安区', '7', '华东');
INSERT INTO `city` VALUES ('350121', '闽侯县', '350000', '福建省', '福建', '350100', '福州市', '350121', '闽侯县', '7', '华东');
INSERT INTO `city` VALUES ('350122', '连江县', '350000', '福建省', '福建', '350100', '福州市', '350122', '连江县', '7', '华东');
INSERT INTO `city` VALUES ('350123', '罗源县', '350000', '福建省', '福建', '350100', '福州市', '350123', '罗源县', '7', '华东');
INSERT INTO `city` VALUES ('350124', '闽清县', '350000', '福建省', '福建', '350100', '福州市', '350124', '闽清县', '7', '华东');
INSERT INTO `city` VALUES ('350125', '永泰县', '350000', '福建省', '福建', '350100', '福州市', '350125', '永泰县', '7', '华东');
INSERT INTO `city` VALUES ('350128', '平潭县', '350000', '福建省', '福建', '350100', '福州市', '350128', '平潭县', '7', '华东');
INSERT INTO `city` VALUES ('350181', '福清市', '350000', '福建省', '福建', '350100', '福州市', '350181', '福清市', '7', '华东');
INSERT INTO `city` VALUES ('350182', '长乐市', '350000', '福建省', '福建', '350100', '福州市', '350182', '长乐市', '7', '华东');
INSERT INTO `city` VALUES ('350200', '厦门市', '350000', '福建省', '福建', '350200', '厦门市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350201', '市辖区', '350000', '福建省', '福建', '350200', '厦门市', '350201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350203', '思明区', '350000', '福建省', '福建', '350200', '厦门市', '350203', '思明区', '7', '华东');
INSERT INTO `city` VALUES ('350205', '海沧区', '350000', '福建省', '福建', '350200', '厦门市', '350205', '海沧区', '7', '华东');
INSERT INTO `city` VALUES ('350206', '湖里区', '350000', '福建省', '福建', '350200', '厦门市', '350206', '湖里区', '7', '华东');
INSERT INTO `city` VALUES ('350211', '集美区', '350000', '福建省', '福建', '350200', '厦门市', '350211', '集美区', '7', '华东');
INSERT INTO `city` VALUES ('350212', '同安区', '350000', '福建省', '福建', '350200', '厦门市', '350212', '同安区', '7', '华东');
INSERT INTO `city` VALUES ('350213', '翔安区', '350000', '福建省', '福建', '350200', '厦门市', '350213', '翔安区', '7', '华东');
INSERT INTO `city` VALUES ('350300', '莆田市', '350000', '福建省', '福建', '350300', '莆田市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350301', '市辖区', '350000', '福建省', '福建', '350300', '莆田市', '350301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350302', '城厢区', '350000', '福建省', '福建', '350300', '莆田市', '350302', '城厢区', '7', '华东');
INSERT INTO `city` VALUES ('350303', '涵江区', '350000', '福建省', '福建', '350300', '莆田市', '350303', '涵江区', '7', '华东');
INSERT INTO `city` VALUES ('350304', '荔城区', '350000', '福建省', '福建', '350300', '莆田市', '350304', '荔城区', '7', '华东');
INSERT INTO `city` VALUES ('350305', '秀屿区', '350000', '福建省', '福建', '350300', '莆田市', '350305', '秀屿区', '7', '华东');
INSERT INTO `city` VALUES ('350322', '仙游县', '350000', '福建省', '福建', '350300', '莆田市', '350322', '仙游县', '7', '华东');
INSERT INTO `city` VALUES ('350400', '三明市', '350000', '福建省', '福建', '350400', '三明市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350401', '市辖区', '350000', '福建省', '福建', '350400', '三明市', '350401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350402', '梅列区', '350000', '福建省', '福建', '350400', '三明市', '350402', '梅列区', '7', '华东');
INSERT INTO `city` VALUES ('350403', '三元区', '350000', '福建省', '福建', '350400', '三明市', '350403', '三元区', '7', '华东');
INSERT INTO `city` VALUES ('350421', '明溪县', '350000', '福建省', '福建', '350400', '三明市', '350421', '明溪县', '7', '华东');
INSERT INTO `city` VALUES ('350423', '清流县', '350000', '福建省', '福建', '350400', '三明市', '350423', '清流县', '7', '华东');
INSERT INTO `city` VALUES ('350424', '宁化县', '350000', '福建省', '福建', '350400', '三明市', '350424', '宁化县', '7', '华东');
INSERT INTO `city` VALUES ('350425', '大田县', '350000', '福建省', '福建', '350400', '三明市', '350425', '大田县', '7', '华东');
INSERT INTO `city` VALUES ('350426', '尤溪县', '350000', '福建省', '福建', '350400', '三明市', '350426', '尤溪县', '7', '华东');
INSERT INTO `city` VALUES ('350427', '沙县', '350000', '福建省', '福建', '350400', '三明市', '350427', '沙县', '7', '华东');
INSERT INTO `city` VALUES ('350428', '将乐县', '350000', '福建省', '福建', '350400', '三明市', '350428', '将乐县', '7', '华东');
INSERT INTO `city` VALUES ('350429', '泰宁县', '350000', '福建省', '福建', '350400', '三明市', '350429', '泰宁县', '7', '华东');
INSERT INTO `city` VALUES ('350430', '建宁县', '350000', '福建省', '福建', '350400', '三明市', '350430', '建宁县', '7', '华东');
INSERT INTO `city` VALUES ('350481', '永安市', '350000', '福建省', '福建', '350400', '三明市', '350481', '永安市', '7', '华东');
INSERT INTO `city` VALUES ('350500', '泉州市', '350000', '福建省', '福建', '350500', '泉州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350501', '市辖区', '350000', '福建省', '福建', '350500', '泉州市', '350501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350502', '鲤城区', '350000', '福建省', '福建', '350500', '泉州市', '350502', '鲤城区', '7', '华东');
INSERT INTO `city` VALUES ('350503', '丰泽区', '350000', '福建省', '福建', '350500', '泉州市', '350503', '丰泽区', '7', '华东');
INSERT INTO `city` VALUES ('350504', '洛江区', '350000', '福建省', '福建', '350500', '泉州市', '350504', '洛江区', '7', '华东');
INSERT INTO `city` VALUES ('350505', '泉港区', '350000', '福建省', '福建', '350500', '泉州市', '350505', '泉港区', '7', '华东');
INSERT INTO `city` VALUES ('350521', '惠安县', '350000', '福建省', '福建', '350500', '泉州市', '350521', '惠安县', '7', '华东');
INSERT INTO `city` VALUES ('350524', '安溪县', '350000', '福建省', '福建', '350500', '泉州市', '350524', '安溪县', '7', '华东');
INSERT INTO `city` VALUES ('350525', '永春县', '350000', '福建省', '福建', '350500', '泉州市', '350525', '永春县', '7', '华东');
INSERT INTO `city` VALUES ('350526', '德化县', '350000', '福建省', '福建', '350500', '泉州市', '350526', '德化县', '7', '华东');
INSERT INTO `city` VALUES ('350527', '金门县', '350000', '福建省', '福建', '350500', '泉州市', '350527', '金门县', '7', '华东');
INSERT INTO `city` VALUES ('350581', '石狮市', '350000', '福建省', '福建', '350500', '泉州市', '350581', '石狮市', '7', '华东');
INSERT INTO `city` VALUES ('350582', '晋江市', '350000', '福建省', '福建', '350500', '泉州市', '350582', '晋江市', '7', '华东');
INSERT INTO `city` VALUES ('350583', '南安市', '350000', '福建省', '福建', '350500', '泉州市', '350583', '南安市', '7', '华东');
INSERT INTO `city` VALUES ('350600', '漳州市', '350000', '福建省', '福建', '350600', '漳州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350601', '市辖区', '350000', '福建省', '福建', '350600', '漳州市', '350601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350602', '芗城区', '350000', '福建省', '福建', '350600', '漳州市', '350602', '芗城区', '7', '华东');
INSERT INTO `city` VALUES ('350603', '龙文区', '350000', '福建省', '福建', '350600', '漳州市', '350603', '龙文区', '7', '华东');
INSERT INTO `city` VALUES ('350622', '云霄县', '350000', '福建省', '福建', '350600', '漳州市', '350622', '云霄县', '7', '华东');
INSERT INTO `city` VALUES ('350623', '漳浦县', '350000', '福建省', '福建', '350600', '漳州市', '350623', '漳浦县', '7', '华东');
INSERT INTO `city` VALUES ('350624', '诏安县', '350000', '福建省', '福建', '350600', '漳州市', '350624', '诏安县', '7', '华东');
INSERT INTO `city` VALUES ('350625', '长泰县', '350000', '福建省', '福建', '350600', '漳州市', '350625', '长泰县', '7', '华东');
INSERT INTO `city` VALUES ('350626', '东山县', '350000', '福建省', '福建', '350600', '漳州市', '350626', '东山县', '7', '华东');
INSERT INTO `city` VALUES ('350627', '南靖县', '350000', '福建省', '福建', '350600', '漳州市', '350627', '南靖县', '7', '华东');
INSERT INTO `city` VALUES ('350628', '平和县', '350000', '福建省', '福建', '350600', '漳州市', '350628', '平和县', '7', '华东');
INSERT INTO `city` VALUES ('350629', '华安县', '350000', '福建省', '福建', '350600', '漳州市', '350629', '华安县', '7', '华东');
INSERT INTO `city` VALUES ('350681', '龙海市', '350000', '福建省', '福建', '350600', '漳州市', '350681', '龙海市', '7', '华东');
INSERT INTO `city` VALUES ('350700', '南平市', '350000', '福建省', '福建', '350700', '南平市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350701', '市辖区', '350000', '福建省', '福建', '350700', '南平市', '350701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350702', '延平区', '350000', '福建省', '福建', '350700', '南平市', '350702', '延平区', '7', '华东');
INSERT INTO `city` VALUES ('350721', '顺昌县', '350000', '福建省', '福建', '350700', '南平市', '350721', '顺昌县', '7', '华东');
INSERT INTO `city` VALUES ('350722', '浦城县', '350000', '福建省', '福建', '350700', '南平市', '350722', '浦城县', '7', '华东');
INSERT INTO `city` VALUES ('350723', '光泽县', '350000', '福建省', '福建', '350700', '南平市', '350723', '光泽县', '7', '华东');
INSERT INTO `city` VALUES ('350724', '松溪县', '350000', '福建省', '福建', '350700', '南平市', '350724', '松溪县', '7', '华东');
INSERT INTO `city` VALUES ('350725', '政和县', '350000', '福建省', '福建', '350700', '南平市', '350725', '政和县', '7', '华东');
INSERT INTO `city` VALUES ('350781', '邵武市', '350000', '福建省', '福建', '350700', '南平市', '350781', '邵武市', '7', '华东');
INSERT INTO `city` VALUES ('350782', '武夷山市', '350000', '福建省', '福建', '350700', '南平市', '350782', '武夷山市', '7', '华东');
INSERT INTO `city` VALUES ('350783', '建瓯市', '350000', '福建省', '福建', '350700', '南平市', '350783', '建瓯市', '7', '华东');
INSERT INTO `city` VALUES ('350784', '建阳市', '350000', '福建省', '福建', '350700', '南平市', '350784', '建阳市', '7', '华东');
INSERT INTO `city` VALUES ('350800', '龙岩市', '350000', '福建省', '福建', '350800', '龙岩市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350801', '市辖区', '350000', '福建省', '福建', '350800', '龙岩市', '350801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350802', '新罗区', '350000', '福建省', '福建', '350800', '龙岩市', '350802', '新罗区', '7', '华东');
INSERT INTO `city` VALUES ('350821', '长汀县', '350000', '福建省', '福建', '350800', '龙岩市', '350821', '长汀县', '7', '华东');
INSERT INTO `city` VALUES ('350822', '永定县', '350000', '福建省', '福建', '350800', '龙岩市', '350822', '永定县', '7', '华东');
INSERT INTO `city` VALUES ('350823', '上杭县', '350000', '福建省', '福建', '350800', '龙岩市', '350823', '上杭县', '7', '华东');
INSERT INTO `city` VALUES ('350824', '武平县', '350000', '福建省', '福建', '350800', '龙岩市', '350824', '武平县', '7', '华东');
INSERT INTO `city` VALUES ('350825', '连城县', '350000', '福建省', '福建', '350800', '龙岩市', '350825', '连城县', '7', '华东');
INSERT INTO `city` VALUES ('350881', '漳平市', '350000', '福建省', '福建', '350800', '龙岩市', '350881', '漳平市', '7', '华东');
INSERT INTO `city` VALUES ('350900', '宁德市', '350000', '福建省', '福建', '350900', '宁德市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('350901', '市辖区', '350000', '福建省', '福建', '350900', '宁德市', '350901', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('350902', '蕉城区', '350000', '福建省', '福建', '350900', '宁德市', '350902', '蕉城区', '7', '华东');
INSERT INTO `city` VALUES ('350921', '霞浦县', '350000', '福建省', '福建', '350900', '宁德市', '350921', '霞浦县', '7', '华东');
INSERT INTO `city` VALUES ('350922', '古田县', '350000', '福建省', '福建', '350900', '宁德市', '350922', '古田县', '7', '华东');
INSERT INTO `city` VALUES ('350923', '屏南县', '350000', '福建省', '福建', '350900', '宁德市', '350923', '屏南县', '7', '华东');
INSERT INTO `city` VALUES ('350924', '寿宁县', '350000', '福建省', '福建', '350900', '宁德市', '350924', '寿宁县', '7', '华东');
INSERT INTO `city` VALUES ('350925', '周宁县', '350000', '福建省', '福建', '350900', '宁德市', '350925', '周宁县', '7', '华东');
INSERT INTO `city` VALUES ('350926', '柘荣县', '350000', '福建省', '福建', '350900', '宁德市', '350926', '柘荣县', '7', '华东');
INSERT INTO `city` VALUES ('350981', '福安市', '350000', '福建省', '福建', '350900', '宁德市', '350981', '福安市', '7', '华东');
INSERT INTO `city` VALUES ('350982', '福鼎市', '350000', '福建省', '福建', '350900', '宁德市', '350982', '福鼎市', '7', '华东');
INSERT INTO `city` VALUES ('360000', '江西省', '360000', '江西省', '江西', '0', '', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360100', '南昌市', '360000', '江西省', '江西', '360100', '南昌市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360101', '市辖区', '360000', '江西省', '江西', '360100', '南昌市', '360101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360102', '东湖区', '360000', '江西省', '江西', '360100', '南昌市', '360102', '东湖区', '5', '华中');
INSERT INTO `city` VALUES ('360103', '西湖区', '360000', '江西省', '江西', '360100', '南昌市', '360103', '西湖区', '5', '华中');
INSERT INTO `city` VALUES ('360104', '青云谱区', '360000', '江西省', '江西', '360100', '南昌市', '360104', '青云谱区', '5', '华中');
INSERT INTO `city` VALUES ('360105', '湾里区', '360000', '江西省', '江西', '360100', '南昌市', '360105', '湾里区', '5', '华中');
INSERT INTO `city` VALUES ('360111', '青山湖区', '360000', '江西省', '江西', '360100', '南昌市', '360111', '青山湖区', '5', '华中');
INSERT INTO `city` VALUES ('360121', '南昌县', '360000', '江西省', '江西', '360100', '南昌市', '360121', '南昌县', '5', '华中');
INSERT INTO `city` VALUES ('360122', '新建县', '360000', '江西省', '江西', '360100', '南昌市', '360122', '新建县', '5', '华中');
INSERT INTO `city` VALUES ('360123', '安义县', '360000', '江西省', '江西', '360100', '南昌市', '360123', '安义县', '5', '华中');
INSERT INTO `city` VALUES ('360124', '进贤县', '360000', '江西省', '江西', '360100', '南昌市', '360124', '进贤县', '5', '华中');
INSERT INTO `city` VALUES ('360200', '景德镇市', '360000', '江西省', '江西', '360200', '景德镇市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360201', '市辖区', '360000', '江西省', '江西', '360200', '景德镇市', '360201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360202', '昌江区', '360000', '江西省', '江西', '360200', '景德镇市', '360202', '昌江区', '5', '华中');
INSERT INTO `city` VALUES ('360203', '珠山区', '360000', '江西省', '江西', '360200', '景德镇市', '360203', '珠山区', '5', '华中');
INSERT INTO `city` VALUES ('360222', '浮梁县', '360000', '江西省', '江西', '360200', '景德镇市', '360222', '浮梁县', '5', '华中');
INSERT INTO `city` VALUES ('360281', '乐平市', '360000', '江西省', '江西', '360200', '景德镇市', '360281', '乐平市', '5', '华中');
INSERT INTO `city` VALUES ('360300', '萍乡市', '360000', '江西省', '江西', '360300', '萍乡市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360301', '市辖区', '360000', '江西省', '江西', '360300', '萍乡市', '360301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360302', '安源区', '360000', '江西省', '江西', '360300', '萍乡市', '360302', '安源区', '5', '华中');
INSERT INTO `city` VALUES ('360313', '湘东区', '360000', '江西省', '江西', '360300', '萍乡市', '360313', '湘东区', '5', '华中');
INSERT INTO `city` VALUES ('360321', '莲花县', '360000', '江西省', '江西', '360300', '萍乡市', '360321', '莲花县', '5', '华中');
INSERT INTO `city` VALUES ('360322', '上栗县', '360000', '江西省', '江西', '360300', '萍乡市', '360322', '上栗县', '5', '华中');
INSERT INTO `city` VALUES ('360323', '芦溪县', '360000', '江西省', '江西', '360300', '萍乡市', '360323', '芦溪县', '5', '华中');
INSERT INTO `city` VALUES ('360400', '九江市', '360000', '江西省', '江西', '360400', '九江市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360401', '市辖区', '360000', '江西省', '江西', '360400', '九江市', '360401', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360402', '庐山区', '360000', '江西省', '江西', '360400', '九江市', '360402', '庐山区', '5', '华中');
INSERT INTO `city` VALUES ('360403', '浔阳区', '360000', '江西省', '江西', '360400', '九江市', '360403', '浔阳区', '5', '华中');
INSERT INTO `city` VALUES ('360421', '九江县', '360000', '江西省', '江西', '360400', '九江市', '360421', '九江县', '5', '华中');
INSERT INTO `city` VALUES ('360423', '武宁县', '360000', '江西省', '江西', '360400', '九江市', '360423', '武宁县', '5', '华中');
INSERT INTO `city` VALUES ('360424', '修水县', '360000', '江西省', '江西', '360400', '九江市', '360424', '修水县', '5', '华中');
INSERT INTO `city` VALUES ('360425', '永修县', '360000', '江西省', '江西', '360400', '九江市', '360425', '永修县', '5', '华中');
INSERT INTO `city` VALUES ('360426', '德安县', '360000', '江西省', '江西', '360400', '九江市', '360426', '德安县', '5', '华中');
INSERT INTO `city` VALUES ('360427', '星子县', '360000', '江西省', '江西', '360400', '九江市', '360427', '星子县', '5', '华中');
INSERT INTO `city` VALUES ('360428', '都昌县', '360000', '江西省', '江西', '360400', '九江市', '360428', '都昌县', '5', '华中');
INSERT INTO `city` VALUES ('360429', '湖口县', '360000', '江西省', '江西', '360400', '九江市', '360429', '湖口县', '5', '华中');
INSERT INTO `city` VALUES ('360430', '彭泽县', '360000', '江西省', '江西', '360400', '九江市', '360430', '彭泽县', '5', '华中');
INSERT INTO `city` VALUES ('360481', '瑞昌市', '360000', '江西省', '江西', '360400', '九江市', '360481', '瑞昌市', '5', '华中');
INSERT INTO `city` VALUES ('360482', '共青城市', '360000', '江西省', '江西', '360400', '九江市', '360482', '共青城市', '5', '华中');
INSERT INTO `city` VALUES ('360500', '新余市', '360000', '江西省', '江西', '360500', '新余市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360501', '市辖区', '360000', '江西省', '江西', '360500', '新余市', '360501', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360502', '渝水区', '360000', '江西省', '江西', '360500', '新余市', '360502', '渝水区', '5', '华中');
INSERT INTO `city` VALUES ('360521', '分宜县', '360000', '江西省', '江西', '360500', '新余市', '360521', '分宜县', '5', '华中');
INSERT INTO `city` VALUES ('360600', '鹰潭市', '360000', '江西省', '江西', '360600', '鹰潭市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360601', '市辖区', '360000', '江西省', '江西', '360600', '鹰潭市', '360601', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360602', '月湖区', '360000', '江西省', '江西', '360600', '鹰潭市', '360602', '月湖区', '5', '华中');
INSERT INTO `city` VALUES ('360622', '余江县', '360000', '江西省', '江西', '360600', '鹰潭市', '360622', '余江县', '5', '华中');
INSERT INTO `city` VALUES ('360681', '贵溪市', '360000', '江西省', '江西', '360600', '鹰潭市', '360681', '贵溪市', '5', '华中');
INSERT INTO `city` VALUES ('360700', '赣州市', '360000', '江西省', '江西', '360700', '赣州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360701', '市辖区', '360000', '江西省', '江西', '360700', '赣州市', '360701', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360702', '章贡区', '360000', '江西省', '江西', '360700', '赣州市', '360702', '章贡区', '5', '华中');
INSERT INTO `city` VALUES ('360721', '赣县', '360000', '江西省', '江西', '360700', '赣州市', '360721', '赣县', '5', '华中');
INSERT INTO `city` VALUES ('360722', '信丰县', '360000', '江西省', '江西', '360700', '赣州市', '360722', '信丰县', '5', '华中');
INSERT INTO `city` VALUES ('360723', '大余县', '360000', '江西省', '江西', '360700', '赣州市', '360723', '大余县', '5', '华中');
INSERT INTO `city` VALUES ('360724', '上犹县', '360000', '江西省', '江西', '360700', '赣州市', '360724', '上犹县', '5', '华中');
INSERT INTO `city` VALUES ('360725', '崇义县', '360000', '江西省', '江西', '360700', '赣州市', '360725', '崇义县', '5', '华中');
INSERT INTO `city` VALUES ('360726', '安远县', '360000', '江西省', '江西', '360700', '赣州市', '360726', '安远县', '5', '华中');
INSERT INTO `city` VALUES ('360727', '龙南县', '360000', '江西省', '江西', '360700', '赣州市', '360727', '龙南县', '5', '华中');
INSERT INTO `city` VALUES ('360728', '定南县', '360000', '江西省', '江西', '360700', '赣州市', '360728', '定南县', '5', '华中');
INSERT INTO `city` VALUES ('360729', '全南县', '360000', '江西省', '江西', '360700', '赣州市', '360729', '全南县', '5', '华中');
INSERT INTO `city` VALUES ('360730', '宁都县', '360000', '江西省', '江西', '360700', '赣州市', '360730', '宁都县', '5', '华中');
INSERT INTO `city` VALUES ('360731', '于都县', '360000', '江西省', '江西', '360700', '赣州市', '360731', '于都县', '5', '华中');
INSERT INTO `city` VALUES ('360732', '兴国县', '360000', '江西省', '江西', '360700', '赣州市', '360732', '兴国县', '5', '华中');
INSERT INTO `city` VALUES ('360733', '会昌县', '360000', '江西省', '江西', '360700', '赣州市', '360733', '会昌县', '5', '华中');
INSERT INTO `city` VALUES ('360734', '寻乌县', '360000', '江西省', '江西', '360700', '赣州市', '360734', '寻乌县', '5', '华中');
INSERT INTO `city` VALUES ('360735', '石城县', '360000', '江西省', '江西', '360700', '赣州市', '360735', '石城县', '5', '华中');
INSERT INTO `city` VALUES ('360781', '瑞金市', '360000', '江西省', '江西', '360700', '赣州市', '360781', '瑞金市', '5', '华中');
INSERT INTO `city` VALUES ('360782', '南康市', '360000', '江西省', '江西', '360700', '赣州市', '360782', '南康市', '5', '华中');
INSERT INTO `city` VALUES ('360800', '吉安市', '360000', '江西省', '江西', '360800', '吉安市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360801', '市辖区', '360000', '江西省', '江西', '360800', '吉安市', '360801', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360802', '吉州区', '360000', '江西省', '江西', '360800', '吉安市', '360802', '吉州区', '5', '华中');
INSERT INTO `city` VALUES ('360803', '青原区', '360000', '江西省', '江西', '360800', '吉安市', '360803', '青原区', '5', '华中');
INSERT INTO `city` VALUES ('360821', '吉安县', '360000', '江西省', '江西', '360800', '吉安市', '360821', '吉安县', '5', '华中');
INSERT INTO `city` VALUES ('360822', '吉水县', '360000', '江西省', '江西', '360800', '吉安市', '360822', '吉水县', '5', '华中');
INSERT INTO `city` VALUES ('360823', '峡江县', '360000', '江西省', '江西', '360800', '吉安市', '360823', '峡江县', '5', '华中');
INSERT INTO `city` VALUES ('360824', '新干县', '360000', '江西省', '江西', '360800', '吉安市', '360824', '新干县', '5', '华中');
INSERT INTO `city` VALUES ('360825', '永丰县', '360000', '江西省', '江西', '360800', '吉安市', '360825', '永丰县', '5', '华中');
INSERT INTO `city` VALUES ('360826', '泰和县', '360000', '江西省', '江西', '360800', '吉安市', '360826', '泰和县', '5', '华中');
INSERT INTO `city` VALUES ('360827', '遂川县', '360000', '江西省', '江西', '360800', '吉安市', '360827', '遂川县', '5', '华中');
INSERT INTO `city` VALUES ('360828', '万安县', '360000', '江西省', '江西', '360800', '吉安市', '360828', '万安县', '5', '华中');
INSERT INTO `city` VALUES ('360829', '安福县', '360000', '江西省', '江西', '360800', '吉安市', '360829', '安福县', '5', '华中');
INSERT INTO `city` VALUES ('360830', '永新县', '360000', '江西省', '江西', '360800', '吉安市', '360830', '永新县', '5', '华中');
INSERT INTO `city` VALUES ('360881', '井冈山市', '360000', '江西省', '江西', '360800', '吉安市', '360881', '井冈山市', '5', '华中');
INSERT INTO `city` VALUES ('360900', '宜春市', '360000', '江西省', '江西', '360900', '宜春市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('360901', '市辖区', '360000', '江西省', '江西', '360900', '宜春市', '360901', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('360902', '袁州区', '360000', '江西省', '江西', '360900', '宜春市', '360902', '袁州区', '5', '华中');
INSERT INTO `city` VALUES ('360921', '奉新县', '360000', '江西省', '江西', '360900', '宜春市', '360921', '奉新县', '5', '华中');
INSERT INTO `city` VALUES ('360922', '万载县', '360000', '江西省', '江西', '360900', '宜春市', '360922', '万载县', '5', '华中');
INSERT INTO `city` VALUES ('360923', '上高县', '360000', '江西省', '江西', '360900', '宜春市', '360923', '上高县', '5', '华中');
INSERT INTO `city` VALUES ('360924', '宜丰县', '360000', '江西省', '江西', '360900', '宜春市', '360924', '宜丰县', '5', '华中');
INSERT INTO `city` VALUES ('360925', '靖安县', '360000', '江西省', '江西', '360900', '宜春市', '360925', '靖安县', '5', '华中');
INSERT INTO `city` VALUES ('360926', '铜鼓县', '360000', '江西省', '江西', '360900', '宜春市', '360926', '铜鼓县', '5', '华中');
INSERT INTO `city` VALUES ('360981', '丰城市', '360000', '江西省', '江西', '360900', '宜春市', '360981', '丰城市', '5', '华中');
INSERT INTO `city` VALUES ('360982', '樟树市', '360000', '江西省', '江西', '360900', '宜春市', '360982', '樟树市', '5', '华中');
INSERT INTO `city` VALUES ('360983', '高安市', '360000', '江西省', '江西', '360900', '宜春市', '360983', '高安市', '5', '华中');
INSERT INTO `city` VALUES ('361000', '抚州市', '360000', '江西省', '江西', '361000', '抚州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('361001', '市辖区', '360000', '江西省', '江西', '361000', '抚州市', '361001', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('361002', '临川区', '360000', '江西省', '江西', '361000', '抚州市', '361002', '临川区', '5', '华中');
INSERT INTO `city` VALUES ('361021', '南城县', '360000', '江西省', '江西', '361000', '抚州市', '361021', '南城县', '5', '华中');
INSERT INTO `city` VALUES ('361022', '黎川县', '360000', '江西省', '江西', '361000', '抚州市', '361022', '黎川县', '5', '华中');
INSERT INTO `city` VALUES ('361023', '南丰县', '360000', '江西省', '江西', '361000', '抚州市', '361023', '南丰县', '5', '华中');
INSERT INTO `city` VALUES ('361024', '崇仁县', '360000', '江西省', '江西', '361000', '抚州市', '361024', '崇仁县', '5', '华中');
INSERT INTO `city` VALUES ('361025', '乐安县', '360000', '江西省', '江西', '361000', '抚州市', '361025', '乐安县', '5', '华中');
INSERT INTO `city` VALUES ('361026', '宜黄县', '360000', '江西省', '江西', '361000', '抚州市', '361026', '宜黄县', '5', '华中');
INSERT INTO `city` VALUES ('361027', '金溪县', '360000', '江西省', '江西', '361000', '抚州市', '361027', '金溪县', '5', '华中');
INSERT INTO `city` VALUES ('361028', '资溪县', '360000', '江西省', '江西', '361000', '抚州市', '361028', '资溪县', '5', '华中');
INSERT INTO `city` VALUES ('361029', '东乡县', '360000', '江西省', '江西', '361000', '抚州市', '361029', '东乡县', '5', '华中');
INSERT INTO `city` VALUES ('361030', '广昌县', '360000', '江西省', '江西', '361000', '抚州市', '361030', '广昌县', '5', '华中');
INSERT INTO `city` VALUES ('361100', '上饶市', '360000', '江西省', '江西', '361100', '上饶市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('361101', '市辖区', '360000', '江西省', '江西', '361100', '上饶市', '361101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('361102', '信州区', '360000', '江西省', '江西', '361100', '上饶市', '361102', '信州区', '5', '华中');
INSERT INTO `city` VALUES ('361121', '上饶县', '360000', '江西省', '江西', '361100', '上饶市', '361121', '上饶县', '5', '华中');
INSERT INTO `city` VALUES ('361122', '广丰县', '360000', '江西省', '江西', '361100', '上饶市', '361122', '广丰县', '5', '华中');
INSERT INTO `city` VALUES ('361123', '玉山县', '360000', '江西省', '江西', '361100', '上饶市', '361123', '玉山县', '5', '华中');
INSERT INTO `city` VALUES ('361124', '铅山县', '360000', '江西省', '江西', '361100', '上饶市', '361124', '铅山县', '5', '华中');
INSERT INTO `city` VALUES ('361125', '横峰县', '360000', '江西省', '江西', '361100', '上饶市', '361125', '横峰县', '5', '华中');
INSERT INTO `city` VALUES ('361126', '弋阳县', '360000', '江西省', '江西', '361100', '上饶市', '361126', '弋阳县', '5', '华中');
INSERT INTO `city` VALUES ('361127', '余干县', '360000', '江西省', '江西', '361100', '上饶市', '361127', '余干县', '5', '华中');
INSERT INTO `city` VALUES ('361128', '鄱阳县', '360000', '江西省', '江西', '361100', '上饶市', '361128', '鄱阳县', '5', '华中');
INSERT INTO `city` VALUES ('361129', '万年县', '360000', '江西省', '江西', '361100', '上饶市', '361129', '万年县', '5', '华中');
INSERT INTO `city` VALUES ('361130', '婺源县', '360000', '江西省', '江西', '361100', '上饶市', '361130', '婺源县', '5', '华中');
INSERT INTO `city` VALUES ('361181', '德兴市', '360000', '江西省', '江西', '361100', '上饶市', '361181', '德兴市', '5', '华中');
INSERT INTO `city` VALUES ('370000', '山东省', '370000', '山东省', '山东', '0', '', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370100', '济南市', '370000', '山东省', '山东', '370100', '济南市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370101', '市辖区', '370000', '山东省', '山东', '370100', '济南市', '370101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370102', '历下区', '370000', '山东省', '山东', '370100', '济南市', '370102', '历下区', '7', '华东');
INSERT INTO `city` VALUES ('370103', '市中区', '370000', '山东省', '山东', '370100', '济南市', '370103', '市中区', '7', '华东');
INSERT INTO `city` VALUES ('370104', '槐荫区', '370000', '山东省', '山东', '370100', '济南市', '370104', '槐荫区', '7', '华东');
INSERT INTO `city` VALUES ('370105', '天桥区', '370000', '山东省', '山东', '370100', '济南市', '370105', '天桥区', '7', '华东');
INSERT INTO `city` VALUES ('370112', '历城区', '370000', '山东省', '山东', '370100', '济南市', '370112', '历城区', '7', '华东');
INSERT INTO `city` VALUES ('370113', '长清区', '370000', '山东省', '山东', '370100', '济南市', '370113', '长清区', '7', '华东');
INSERT INTO `city` VALUES ('370124', '平阴县', '370000', '山东省', '山东', '370100', '济南市', '370124', '平阴县', '7', '华东');
INSERT INTO `city` VALUES ('370125', '济阳县', '370000', '山东省', '山东', '370100', '济南市', '370125', '济阳县', '7', '华东');
INSERT INTO `city` VALUES ('370126', '商河县', '370000', '山东省', '山东', '370100', '济南市', '370126', '商河县', '7', '华东');
INSERT INTO `city` VALUES ('370181', '章丘市', '370000', '山东省', '山东', '370100', '济南市', '370181', '章丘市', '7', '华东');
INSERT INTO `city` VALUES ('370200', '青岛市', '370000', '山东省', '山东', '370200', '青岛市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370201', '市辖区', '370000', '山东省', '山东', '370200', '青岛市', '370201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370202', '市南区', '370000', '山东省', '山东', '370200', '青岛市', '370202', '市南区', '7', '华东');
INSERT INTO `city` VALUES ('370203', '市北区', '370000', '山东省', '山东', '370200', '青岛市', '370203', '市北区', '7', '华东');
INSERT INTO `city` VALUES ('370211', '黄岛区', '370000', '山东省', '山东', '370200', '青岛市', '370211', '黄岛区', '7', '华东');
INSERT INTO `city` VALUES ('370212', '崂山区', '370000', '山东省', '山东', '370200', '青岛市', '370212', '崂山区', '7', '华东');
INSERT INTO `city` VALUES ('370213', '李沧区', '370000', '山东省', '山东', '370200', '青岛市', '370213', '李沧区', '7', '华东');
INSERT INTO `city` VALUES ('370214', '城阳区', '370000', '山东省', '山东', '370200', '青岛市', '370214', '城阳区', '7', '华东');
INSERT INTO `city` VALUES ('370281', '胶州市', '370000', '山东省', '山东', '370200', '青岛市', '370281', '胶州市', '7', '华东');
INSERT INTO `city` VALUES ('370282', '即墨市', '370000', '山东省', '山东', '370200', '青岛市', '370282', '即墨市', '7', '华东');
INSERT INTO `city` VALUES ('370283', '平度市', '370000', '山东省', '山东', '370200', '青岛市', '370283', '平度市', '7', '华东');
INSERT INTO `city` VALUES ('370285', '莱西市', '370000', '山东省', '山东', '370200', '青岛市', '370285', '莱西市', '7', '华东');
INSERT INTO `city` VALUES ('370300', '淄博市', '370000', '山东省', '山东', '370300', '淄博市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370301', '市辖区', '370000', '山东省', '山东', '370300', '淄博市', '370301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370302', '淄川区', '370000', '山东省', '山东', '370300', '淄博市', '370302', '淄川区', '7', '华东');
INSERT INTO `city` VALUES ('370303', '张店区', '370000', '山东省', '山东', '370300', '淄博市', '370303', '张店区', '7', '华东');
INSERT INTO `city` VALUES ('370304', '博山区', '370000', '山东省', '山东', '370300', '淄博市', '370304', '博山区', '7', '华东');
INSERT INTO `city` VALUES ('370305', '临淄区', '370000', '山东省', '山东', '370300', '淄博市', '370305', '临淄区', '7', '华东');
INSERT INTO `city` VALUES ('370306', '周村区', '370000', '山东省', '山东', '370300', '淄博市', '370306', '周村区', '7', '华东');
INSERT INTO `city` VALUES ('370321', '桓台县', '370000', '山东省', '山东', '370300', '淄博市', '370321', '桓台县', '7', '华东');
INSERT INTO `city` VALUES ('370322', '高青县', '370000', '山东省', '山东', '370300', '淄博市', '370322', '高青县', '7', '华东');
INSERT INTO `city` VALUES ('370323', '沂源县', '370000', '山东省', '山东', '370300', '淄博市', '370323', '沂源县', '7', '华东');
INSERT INTO `city` VALUES ('370400', '枣庄市', '370000', '山东省', '山东', '370400', '枣庄市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370401', '市辖区', '370000', '山东省', '山东', '370400', '枣庄市', '370401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370402', '市中区', '370000', '山东省', '山东', '370400', '枣庄市', '370402', '市中区', '7', '华东');
INSERT INTO `city` VALUES ('370403', '薛城区', '370000', '山东省', '山东', '370400', '枣庄市', '370403', '薛城区', '7', '华东');
INSERT INTO `city` VALUES ('370404', '峄城区', '370000', '山东省', '山东', '370400', '枣庄市', '370404', '峄城区', '7', '华东');
INSERT INTO `city` VALUES ('370405', '台儿庄区', '370000', '山东省', '山东', '370400', '枣庄市', '370405', '台儿庄区', '7', '华东');
INSERT INTO `city` VALUES ('370406', '山亭区', '370000', '山东省', '山东', '370400', '枣庄市', '370406', '山亭区', '7', '华东');
INSERT INTO `city` VALUES ('370481', '滕州市', '370000', '山东省', '山东', '370400', '枣庄市', '370481', '滕州市', '7', '华东');
INSERT INTO `city` VALUES ('370500', '东营市', '370000', '山东省', '山东', '370500', '东营市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370501', '市辖区', '370000', '山东省', '山东', '370500', '东营市', '370501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370502', '东营区', '370000', '山东省', '山东', '370500', '东营市', '370502', '东营区', '7', '华东');
INSERT INTO `city` VALUES ('370503', '河口区', '370000', '山东省', '山东', '370500', '东营市', '370503', '河口区', '7', '华东');
INSERT INTO `city` VALUES ('370521', '垦利县', '370000', '山东省', '山东', '370500', '东营市', '370521', '垦利县', '7', '华东');
INSERT INTO `city` VALUES ('370522', '利津县', '370000', '山东省', '山东', '370500', '东营市', '370522', '利津县', '7', '华东');
INSERT INTO `city` VALUES ('370523', '广饶县', '370000', '山东省', '山东', '370500', '东营市', '370523', '广饶县', '7', '华东');
INSERT INTO `city` VALUES ('370600', '烟台市', '370000', '山东省', '山东', '370600', '烟台市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370601', '市辖区', '370000', '山东省', '山东', '370600', '烟台市', '370601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370602', '芝罘区', '370000', '山东省', '山东', '370600', '烟台市', '370602', '芝罘区', '7', '华东');
INSERT INTO `city` VALUES ('370611', '福山区', '370000', '山东省', '山东', '370600', '烟台市', '370611', '福山区', '7', '华东');
INSERT INTO `city` VALUES ('370612', '牟平区', '370000', '山东省', '山东', '370600', '烟台市', '370612', '牟平区', '7', '华东');
INSERT INTO `city` VALUES ('370613', '莱山区', '370000', '山东省', '山东', '370600', '烟台市', '370613', '莱山区', '7', '华东');
INSERT INTO `city` VALUES ('370634', '长岛县', '370000', '山东省', '山东', '370600', '烟台市', '370634', '长岛县', '7', '华东');
INSERT INTO `city` VALUES ('370681', '龙口市', '370000', '山东省', '山东', '370600', '烟台市', '370681', '龙口市', '7', '华东');
INSERT INTO `city` VALUES ('370682', '莱阳市', '370000', '山东省', '山东', '370600', '烟台市', '370682', '莱阳市', '7', '华东');
INSERT INTO `city` VALUES ('370683', '莱州市', '370000', '山东省', '山东', '370600', '烟台市', '370683', '莱州市', '7', '华东');
INSERT INTO `city` VALUES ('370684', '蓬莱市', '370000', '山东省', '山东', '370600', '烟台市', '370684', '蓬莱市', '7', '华东');
INSERT INTO `city` VALUES ('370685', '招远市', '370000', '山东省', '山东', '370600', '烟台市', '370685', '招远市', '7', '华东');
INSERT INTO `city` VALUES ('370686', '栖霞市', '370000', '山东省', '山东', '370600', '烟台市', '370686', '栖霞市', '7', '华东');
INSERT INTO `city` VALUES ('370687', '海阳市', '370000', '山东省', '山东', '370600', '烟台市', '370687', '海阳市', '7', '华东');
INSERT INTO `city` VALUES ('370700', '潍坊市', '370000', '山东省', '山东', '370700', '潍坊市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370701', '市辖区', '370000', '山东省', '山东', '370700', '潍坊市', '370701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370702', '潍城区', '370000', '山东省', '山东', '370700', '潍坊市', '370702', '潍城区', '7', '华东');
INSERT INTO `city` VALUES ('370703', '寒亭区', '370000', '山东省', '山东', '370700', '潍坊市', '370703', '寒亭区', '7', '华东');
INSERT INTO `city` VALUES ('370704', '坊子区', '370000', '山东省', '山东', '370700', '潍坊市', '370704', '坊子区', '7', '华东');
INSERT INTO `city` VALUES ('370705', '奎文区', '370000', '山东省', '山东', '370700', '潍坊市', '370705', '奎文区', '7', '华东');
INSERT INTO `city` VALUES ('370724', '临朐县', '370000', '山东省', '山东', '370700', '潍坊市', '370724', '临朐县', '7', '华东');
INSERT INTO `city` VALUES ('370725', '昌乐县', '370000', '山东省', '山东', '370700', '潍坊市', '370725', '昌乐县', '7', '华东');
INSERT INTO `city` VALUES ('370781', '青州市', '370000', '山东省', '山东', '370700', '潍坊市', '370781', '青州市', '7', '华东');
INSERT INTO `city` VALUES ('370782', '诸城市', '370000', '山东省', '山东', '370700', '潍坊市', '370782', '诸城市', '7', '华东');
INSERT INTO `city` VALUES ('370783', '寿光市', '370000', '山东省', '山东', '370700', '潍坊市', '370783', '寿光市', '7', '华东');
INSERT INTO `city` VALUES ('370784', '安丘市', '370000', '山东省', '山东', '370700', '潍坊市', '370784', '安丘市', '7', '华东');
INSERT INTO `city` VALUES ('370785', '高密市', '370000', '山东省', '山东', '370700', '潍坊市', '370785', '高密市', '7', '华东');
INSERT INTO `city` VALUES ('370786', '昌邑市', '370000', '山东省', '山东', '370700', '潍坊市', '370786', '昌邑市', '7', '华东');
INSERT INTO `city` VALUES ('370800', '济宁市', '370000', '山东省', '山东', '370800', '济宁市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370801', '市辖区', '370000', '山东省', '山东', '370800', '济宁市', '370801', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370802', '市中区', '370000', '山东省', '山东', '370800', '济宁市', '370802', '市中区', '7', '华东');
INSERT INTO `city` VALUES ('370811', '任城区', '370000', '山东省', '山东', '370800', '济宁市', '370811', '任城区', '7', '华东');
INSERT INTO `city` VALUES ('370826', '微山县', '370000', '山东省', '山东', '370800', '济宁市', '370826', '微山县', '7', '华东');
INSERT INTO `city` VALUES ('370827', '鱼台县', '370000', '山东省', '山东', '370800', '济宁市', '370827', '鱼台县', '7', '华东');
INSERT INTO `city` VALUES ('370828', '金乡县', '370000', '山东省', '山东', '370800', '济宁市', '370828', '金乡县', '7', '华东');
INSERT INTO `city` VALUES ('370829', '嘉祥县', '370000', '山东省', '山东', '370800', '济宁市', '370829', '嘉祥县', '7', '华东');
INSERT INTO `city` VALUES ('370830', '汶上县', '370000', '山东省', '山东', '370800', '济宁市', '370830', '汶上县', '7', '华东');
INSERT INTO `city` VALUES ('370831', '泗水县', '370000', '山东省', '山东', '370800', '济宁市', '370831', '泗水县', '7', '华东');
INSERT INTO `city` VALUES ('370832', '梁山县', '370000', '山东省', '山东', '370800', '济宁市', '370832', '梁山县', '7', '华东');
INSERT INTO `city` VALUES ('370881', '曲阜市', '370000', '山东省', '山东', '370800', '济宁市', '370881', '曲阜市', '7', '华东');
INSERT INTO `city` VALUES ('370882', '兖州市', '370000', '山东省', '山东', '370800', '济宁市', '370882', '兖州市', '7', '华东');
INSERT INTO `city` VALUES ('370883', '邹城市', '370000', '山东省', '山东', '370800', '济宁市', '370883', '邹城市', '7', '华东');
INSERT INTO `city` VALUES ('370900', '泰安市', '370000', '山东省', '山东', '370900', '泰安市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('370901', '市辖区', '370000', '山东省', '山东', '370900', '泰安市', '370901', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('370902', '泰山区', '370000', '山东省', '山东', '370900', '泰安市', '370902', '泰山区', '7', '华东');
INSERT INTO `city` VALUES ('370911', '岱岳区', '370000', '山东省', '山东', '370900', '泰安市', '370911', '岱岳区', '7', '华东');
INSERT INTO `city` VALUES ('370921', '宁阳县', '370000', '山东省', '山东', '370900', '泰安市', '370921', '宁阳县', '7', '华东');
INSERT INTO `city` VALUES ('370923', '东平县', '370000', '山东省', '山东', '370900', '泰安市', '370923', '东平县', '7', '华东');
INSERT INTO `city` VALUES ('370982', '新泰市', '370000', '山东省', '山东', '370900', '泰安市', '370982', '新泰市', '7', '华东');
INSERT INTO `city` VALUES ('370983', '肥城市', '370000', '山东省', '山东', '370900', '泰安市', '370983', '肥城市', '7', '华东');
INSERT INTO `city` VALUES ('371000', '威海市', '370000', '山东省', '山东', '371000', '威海市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371001', '市辖区', '370000', '山东省', '山东', '371000', '威海市', '371001', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371002', '环翠区', '370000', '山东省', '山东', '371000', '威海市', '371002', '环翠区', '7', '华东');
INSERT INTO `city` VALUES ('371081', '文登市', '370000', '山东省', '山东', '371000', '威海市', '371081', '文登市', '7', '华东');
INSERT INTO `city` VALUES ('371082', '荣成市', '370000', '山东省', '山东', '371000', '威海市', '371082', '荣成市', '7', '华东');
INSERT INTO `city` VALUES ('371083', '乳山市', '370000', '山东省', '山东', '371000', '威海市', '371083', '乳山市', '7', '华东');
INSERT INTO `city` VALUES ('371100', '日照市', '370000', '山东省', '山东', '371100', '日照市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371101', '市辖区', '370000', '山东省', '山东', '371100', '日照市', '371101', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371102', '东港区', '370000', '山东省', '山东', '371100', '日照市', '371102', '东港区', '7', '华东');
INSERT INTO `city` VALUES ('371103', '岚山区', '370000', '山东省', '山东', '371100', '日照市', '371103', '岚山区', '7', '华东');
INSERT INTO `city` VALUES ('371121', '五莲县', '370000', '山东省', '山东', '371100', '日照市', '371121', '五莲县', '7', '华东');
INSERT INTO `city` VALUES ('371122', '莒县', '370000', '山东省', '山东', '371100', '日照市', '371122', '莒县', '7', '华东');
INSERT INTO `city` VALUES ('371200', '莱芜市', '370000', '山东省', '山东', '371200', '莱芜市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371201', '市辖区', '370000', '山东省', '山东', '371200', '莱芜市', '371201', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371202', '莱城区', '370000', '山东省', '山东', '371200', '莱芜市', '371202', '莱城区', '7', '华东');
INSERT INTO `city` VALUES ('371203', '钢城区', '370000', '山东省', '山东', '371200', '莱芜市', '371203', '钢城区', '7', '华东');
INSERT INTO `city` VALUES ('371300', '临沂市', '370000', '山东省', '山东', '371300', '临沂市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371301', '市辖区', '370000', '山东省', '山东', '371300', '临沂市', '371301', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371302', '兰山区', '370000', '山东省', '山东', '371300', '临沂市', '371302', '兰山区', '7', '华东');
INSERT INTO `city` VALUES ('371311', '罗庄区', '370000', '山东省', '山东', '371300', '临沂市', '371311', '罗庄区', '7', '华东');
INSERT INTO `city` VALUES ('371312', '河东区', '370000', '山东省', '山东', '371300', '临沂市', '371312', '河东区', '7', '华东');
INSERT INTO `city` VALUES ('371321', '沂南县', '370000', '山东省', '山东', '371300', '临沂市', '371321', '沂南县', '7', '华东');
INSERT INTO `city` VALUES ('371322', '郯城县', '370000', '山东省', '山东', '371300', '临沂市', '371322', '郯城县', '7', '华东');
INSERT INTO `city` VALUES ('371323', '沂水县', '370000', '山东省', '山东', '371300', '临沂市', '371323', '沂水县', '7', '华东');
INSERT INTO `city` VALUES ('371324', '苍山县', '370000', '山东省', '山东', '371300', '临沂市', '371324', '苍山县', '7', '华东');
INSERT INTO `city` VALUES ('371325', '费县', '370000', '山东省', '山东', '371300', '临沂市', '371325', '费县', '7', '华东');
INSERT INTO `city` VALUES ('371326', '平邑县', '370000', '山东省', '山东', '371300', '临沂市', '371326', '平邑县', '7', '华东');
INSERT INTO `city` VALUES ('371327', '莒南县', '370000', '山东省', '山东', '371300', '临沂市', '371327', '莒南县', '7', '华东');
INSERT INTO `city` VALUES ('371328', '蒙阴县', '370000', '山东省', '山东', '371300', '临沂市', '371328', '蒙阴县', '7', '华东');
INSERT INTO `city` VALUES ('371329', '临沭县', '370000', '山东省', '山东', '371300', '临沂市', '371329', '临沭县', '7', '华东');
INSERT INTO `city` VALUES ('371400', '德州市', '370000', '山东省', '山东', '371400', '德州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371401', '市辖区', '370000', '山东省', '山东', '371400', '德州市', '371401', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371402', '德城区', '370000', '山东省', '山东', '371400', '德州市', '371402', '德城区', '7', '华东');
INSERT INTO `city` VALUES ('371421', '陵县', '370000', '山东省', '山东', '371400', '德州市', '371421', '陵县', '7', '华东');
INSERT INTO `city` VALUES ('371422', '宁津县', '370000', '山东省', '山东', '371400', '德州市', '371422', '宁津县', '7', '华东');
INSERT INTO `city` VALUES ('371423', '庆云县', '370000', '山东省', '山东', '371400', '德州市', '371423', '庆云县', '7', '华东');
INSERT INTO `city` VALUES ('371424', '临邑县', '370000', '山东省', '山东', '371400', '德州市', '371424', '临邑县', '7', '华东');
INSERT INTO `city` VALUES ('371425', '齐河县', '370000', '山东省', '山东', '371400', '德州市', '371425', '齐河县', '7', '华东');
INSERT INTO `city` VALUES ('371426', '平原县', '370000', '山东省', '山东', '371400', '德州市', '371426', '平原县', '7', '华东');
INSERT INTO `city` VALUES ('371427', '夏津县', '370000', '山东省', '山东', '371400', '德州市', '371427', '夏津县', '7', '华东');
INSERT INTO `city` VALUES ('371428', '武城县', '370000', '山东省', '山东', '371400', '德州市', '371428', '武城县', '7', '华东');
INSERT INTO `city` VALUES ('371481', '乐陵市', '370000', '山东省', '山东', '371400', '德州市', '371481', '乐陵市', '7', '华东');
INSERT INTO `city` VALUES ('371482', '禹城市', '370000', '山东省', '山东', '371400', '德州市', '371482', '禹城市', '7', '华东');
INSERT INTO `city` VALUES ('371500', '聊城市', '370000', '山东省', '山东', '371500', '聊城市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371501', '市辖区', '370000', '山东省', '山东', '371500', '聊城市', '371501', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371502', '东昌府区', '370000', '山东省', '山东', '371500', '聊城市', '371502', '东昌府区', '7', '华东');
INSERT INTO `city` VALUES ('371521', '阳谷县', '370000', '山东省', '山东', '371500', '聊城市', '371521', '阳谷县', '7', '华东');
INSERT INTO `city` VALUES ('371522', '莘县', '370000', '山东省', '山东', '371500', '聊城市', '371522', '莘县', '7', '华东');
INSERT INTO `city` VALUES ('371523', '茌平县', '370000', '山东省', '山东', '371500', '聊城市', '371523', '茌平县', '7', '华东');
INSERT INTO `city` VALUES ('371524', '东阿县', '370000', '山东省', '山东', '371500', '聊城市', '371524', '东阿县', '7', '华东');
INSERT INTO `city` VALUES ('371525', '冠县', '370000', '山东省', '山东', '371500', '聊城市', '371525', '冠县', '7', '华东');
INSERT INTO `city` VALUES ('371526', '高唐县', '370000', '山东省', '山东', '371500', '聊城市', '371526', '高唐县', '7', '华东');
INSERT INTO `city` VALUES ('371581', '临清市', '370000', '山东省', '山东', '371500', '聊城市', '371581', '临清市', '7', '华东');
INSERT INTO `city` VALUES ('371600', '滨州市', '370000', '山东省', '山东', '371600', '滨州市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371601', '市辖区', '370000', '山东省', '山东', '371600', '滨州市', '371601', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371602', '滨城区', '370000', '山东省', '山东', '371600', '滨州市', '371602', '滨城区', '7', '华东');
INSERT INTO `city` VALUES ('371621', '惠民县', '370000', '山东省', '山东', '371600', '滨州市', '371621', '惠民县', '7', '华东');
INSERT INTO `city` VALUES ('371622', '阳信县', '370000', '山东省', '山东', '371600', '滨州市', '371622', '阳信县', '7', '华东');
INSERT INTO `city` VALUES ('371623', '无棣县', '370000', '山东省', '山东', '371600', '滨州市', '371623', '无棣县', '7', '华东');
INSERT INTO `city` VALUES ('371624', '沾化县', '370000', '山东省', '山东', '371600', '滨州市', '371624', '沾化县', '7', '华东');
INSERT INTO `city` VALUES ('371625', '博兴县', '370000', '山东省', '山东', '371600', '滨州市', '371625', '博兴县', '7', '华东');
INSERT INTO `city` VALUES ('371626', '邹平县', '370000', '山东省', '山东', '371600', '滨州市', '371626', '邹平县', '7', '华东');
INSERT INTO `city` VALUES ('371700', '菏泽市', '370000', '山东省', '山东', '371700', '菏泽市', '0', '', '7', '华东');
INSERT INTO `city` VALUES ('371701', '市辖区', '370000', '山东省', '山东', '371700', '菏泽市', '371701', '市辖区', '7', '华东');
INSERT INTO `city` VALUES ('371702', '牡丹区', '370000', '山东省', '山东', '371700', '菏泽市', '371702', '牡丹区', '7', '华东');
INSERT INTO `city` VALUES ('371721', '曹县', '370000', '山东省', '山东', '371700', '菏泽市', '371721', '曹县', '7', '华东');
INSERT INTO `city` VALUES ('371722', '单县', '370000', '山东省', '山东', '371700', '菏泽市', '371722', '单县', '7', '华东');
INSERT INTO `city` VALUES ('371723', '成武县', '370000', '山东省', '山东', '371700', '菏泽市', '371723', '成武县', '7', '华东');
INSERT INTO `city` VALUES ('371724', '巨野县', '370000', '山东省', '山东', '371700', '菏泽市', '371724', '巨野县', '7', '华东');
INSERT INTO `city` VALUES ('371725', '郓城县', '370000', '山东省', '山东', '371700', '菏泽市', '371725', '郓城县', '7', '华东');
INSERT INTO `city` VALUES ('371726', '鄄城县', '370000', '山东省', '山东', '371700', '菏泽市', '371726', '鄄城县', '7', '华东');
INSERT INTO `city` VALUES ('371727', '定陶县', '370000', '山东省', '山东', '371700', '菏泽市', '371727', '定陶县', '7', '华东');
INSERT INTO `city` VALUES ('371728', '东明县', '370000', '山东省', '山东', '371700', '菏泽市', '371728', '东明县', '7', '华东');
INSERT INTO `city` VALUES ('410000', '河南省', '410000', '河南省', '河南', '0', '', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410100', '郑州市', '410000', '河南省', '河南', '410100', '郑州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410101', '市辖区', '410000', '河南省', '河南', '410100', '郑州市', '410101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410102', '中原区', '410000', '河南省', '河南', '410100', '郑州市', '410102', '中原区', '5', '华中');
INSERT INTO `city` VALUES ('410103', '二七区', '410000', '河南省', '河南', '410100', '郑州市', '410103', '二七区', '5', '华中');
INSERT INTO `city` VALUES ('410104', '管城回族区', '410000', '河南省', '河南', '410100', '郑州市', '410104', '管城回族区', '5', '华中');
INSERT INTO `city` VALUES ('410105', '金水区', '410000', '河南省', '河南', '410100', '郑州市', '410105', '金水区', '5', '华中');
INSERT INTO `city` VALUES ('410106', '上街区', '410000', '河南省', '河南', '410100', '郑州市', '410106', '上街区', '5', '华中');
INSERT INTO `city` VALUES ('410108', '惠济区', '410000', '河南省', '河南', '410100', '郑州市', '410108', '惠济区', '5', '华中');
INSERT INTO `city` VALUES ('410122', '中牟县', '410000', '河南省', '河南', '410100', '郑州市', '410122', '中牟县', '5', '华中');
INSERT INTO `city` VALUES ('410181', '巩义市', '410000', '河南省', '河南', '410100', '郑州市', '410181', '巩义市', '5', '华中');
INSERT INTO `city` VALUES ('410182', '荥阳市', '410000', '河南省', '河南', '410100', '郑州市', '410182', '荥阳市', '5', '华中');
INSERT INTO `city` VALUES ('410183', '新密市', '410000', '河南省', '河南', '410100', '郑州市', '410183', '新密市', '5', '华中');
INSERT INTO `city` VALUES ('410184', '新郑市', '410000', '河南省', '河南', '410100', '郑州市', '410184', '新郑市', '5', '华中');
INSERT INTO `city` VALUES ('410185', '登封市', '410000', '河南省', '河南', '410100', '郑州市', '410185', '登封市', '5', '华中');
INSERT INTO `city` VALUES ('410200', '开封市', '410000', '河南省', '河南', '410200', '开封市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410201', '市辖区', '410000', '河南省', '河南', '410200', '开封市', '410201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410202', '龙亭区', '410000', '河南省', '河南', '410200', '开封市', '410202', '龙亭区', '5', '华中');
INSERT INTO `city` VALUES ('410203', '顺河回族区', '410000', '河南省', '河南', '410200', '开封市', '410203', '顺河回族区', '5', '华中');
INSERT INTO `city` VALUES ('410204', '鼓楼区', '410000', '河南省', '河南', '410200', '开封市', '410204', '鼓楼区', '5', '华中');
INSERT INTO `city` VALUES ('410205', '禹王台区', '410000', '河南省', '河南', '410200', '开封市', '410205', '禹王台区', '5', '华中');
INSERT INTO `city` VALUES ('410211', '金明区', '410000', '河南省', '河南', '410200', '开封市', '410211', '金明区', '5', '华中');
INSERT INTO `city` VALUES ('410221', '杞县', '410000', '河南省', '河南', '410200', '开封市', '410221', '杞县', '5', '华中');
INSERT INTO `city` VALUES ('410222', '通许县', '410000', '河南省', '河南', '410200', '开封市', '410222', '通许县', '5', '华中');
INSERT INTO `city` VALUES ('410223', '尉氏县', '410000', '河南省', '河南', '410200', '开封市', '410223', '尉氏县', '5', '华中');
INSERT INTO `city` VALUES ('410224', '开封县', '410000', '河南省', '河南', '410200', '开封市', '410224', '开封县', '5', '华中');
INSERT INTO `city` VALUES ('410225', '兰考县', '410000', '河南省', '河南', '410200', '开封市', '410225', '兰考县', '5', '华中');
INSERT INTO `city` VALUES ('410300', '洛阳市', '410000', '河南省', '河南', '410300', '洛阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410301', '市辖区', '410000', '河南省', '河南', '410300', '洛阳市', '410301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410302', '老城区', '410000', '河南省', '河南', '410300', '洛阳市', '410302', '老城区', '5', '华中');
INSERT INTO `city` VALUES ('410303', '西工区', '410000', '河南省', '河南', '410300', '洛阳市', '410303', '西工区', '5', '华中');
INSERT INTO `city` VALUES ('410304', '瀍河回族区', '410000', '河南省', '河南', '410300', '洛阳市', '410304', '瀍河回族区', '5', '华中');
INSERT INTO `city` VALUES ('410305', '涧西区', '410000', '河南省', '河南', '410300', '洛阳市', '410305', '涧西区', '5', '华中');
INSERT INTO `city` VALUES ('410306', '吉利区', '410000', '河南省', '河南', '410300', '洛阳市', '410306', '吉利区', '5', '华中');
INSERT INTO `city` VALUES ('410311', '洛龙区', '410000', '河南省', '河南', '410300', '洛阳市', '410311', '洛龙区', '5', '华中');
INSERT INTO `city` VALUES ('410322', '孟津县', '410000', '河南省', '河南', '410300', '洛阳市', '410322', '孟津县', '5', '华中');
INSERT INTO `city` VALUES ('410323', '新安县', '410000', '河南省', '河南', '410300', '洛阳市', '410323', '新安县', '5', '华中');
INSERT INTO `city` VALUES ('410324', '栾川县', '410000', '河南省', '河南', '410300', '洛阳市', '410324', '栾川县', '5', '华中');
INSERT INTO `city` VALUES ('410325', '嵩县', '410000', '河南省', '河南', '410300', '洛阳市', '410325', '嵩县', '5', '华中');
INSERT INTO `city` VALUES ('410326', '汝阳县', '410000', '河南省', '河南', '410300', '洛阳市', '410326', '汝阳县', '5', '华中');
INSERT INTO `city` VALUES ('410327', '宜阳县', '410000', '河南省', '河南', '410300', '洛阳市', '410327', '宜阳县', '5', '华中');
INSERT INTO `city` VALUES ('410328', '洛宁县', '410000', '河南省', '河南', '410300', '洛阳市', '410328', '洛宁县', '5', '华中');
INSERT INTO `city` VALUES ('410329', '伊川县', '410000', '河南省', '河南', '410300', '洛阳市', '410329', '伊川县', '5', '华中');
INSERT INTO `city` VALUES ('410381', '偃师市', '410000', '河南省', '河南', '410300', '洛阳市', '410381', '偃师市', '5', '华中');
INSERT INTO `city` VALUES ('410400', '平顶山市', '410000', '河南省', '河南', '410400', '平顶山市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410401', '市辖区', '410000', '河南省', '河南', '410400', '平顶山市', '410401', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410402', '新华区', '410000', '河南省', '河南', '410400', '平顶山市', '410402', '新华区', '5', '华中');
INSERT INTO `city` VALUES ('410403', '卫东区', '410000', '河南省', '河南', '410400', '平顶山市', '410403', '卫东区', '5', '华中');
INSERT INTO `city` VALUES ('410404', '石龙区', '410000', '河南省', '河南', '410400', '平顶山市', '410404', '石龙区', '5', '华中');
INSERT INTO `city` VALUES ('410411', '湛河区', '410000', '河南省', '河南', '410400', '平顶山市', '410411', '湛河区', '5', '华中');
INSERT INTO `city` VALUES ('410421', '宝丰县', '410000', '河南省', '河南', '410400', '平顶山市', '410421', '宝丰县', '5', '华中');
INSERT INTO `city` VALUES ('410422', '叶县', '410000', '河南省', '河南', '410400', '平顶山市', '410422', '叶县', '5', '华中');
INSERT INTO `city` VALUES ('410423', '鲁山县', '410000', '河南省', '河南', '410400', '平顶山市', '410423', '鲁山县', '5', '华中');
INSERT INTO `city` VALUES ('410425', '郏县', '410000', '河南省', '河南', '410400', '平顶山市', '410425', '郏县', '5', '华中');
INSERT INTO `city` VALUES ('410481', '舞钢市', '410000', '河南省', '河南', '410400', '平顶山市', '410481', '舞钢市', '5', '华中');
INSERT INTO `city` VALUES ('410482', '汝州市', '410000', '河南省', '河南', '410400', '平顶山市', '410482', '汝州市', '5', '华中');
INSERT INTO `city` VALUES ('410500', '安阳市', '410000', '河南省', '河南', '410500', '安阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410501', '市辖区', '410000', '河南省', '河南', '410500', '安阳市', '410501', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410502', '文峰区', '410000', '河南省', '河南', '410500', '安阳市', '410502', '文峰区', '5', '华中');
INSERT INTO `city` VALUES ('410503', '北关区', '410000', '河南省', '河南', '410500', '安阳市', '410503', '北关区', '5', '华中');
INSERT INTO `city` VALUES ('410505', '殷都区', '410000', '河南省', '河南', '410500', '安阳市', '410505', '殷都区', '5', '华中');
INSERT INTO `city` VALUES ('410506', '龙安区', '410000', '河南省', '河南', '410500', '安阳市', '410506', '龙安区', '5', '华中');
INSERT INTO `city` VALUES ('410522', '安阳县', '410000', '河南省', '河南', '410500', '安阳市', '410522', '安阳县', '5', '华中');
INSERT INTO `city` VALUES ('410523', '汤阴县', '410000', '河南省', '河南', '410500', '安阳市', '410523', '汤阴县', '5', '华中');
INSERT INTO `city` VALUES ('410526', '滑县', '410000', '河南省', '河南', '410500', '安阳市', '410526', '滑县', '5', '华中');
INSERT INTO `city` VALUES ('410527', '内黄县', '410000', '河南省', '河南', '410500', '安阳市', '410527', '内黄县', '5', '华中');
INSERT INTO `city` VALUES ('410581', '林州市', '410000', '河南省', '河南', '410500', '安阳市', '410581', '林州市', '5', '华中');
INSERT INTO `city` VALUES ('410600', '鹤壁市', '410000', '河南省', '河南', '410600', '鹤壁市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410601', '市辖区', '410000', '河南省', '河南', '410600', '鹤壁市', '410601', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410602', '鹤山区', '410000', '河南省', '河南', '410600', '鹤壁市', '410602', '鹤山区', '5', '华中');
INSERT INTO `city` VALUES ('410603', '山城区', '410000', '河南省', '河南', '410600', '鹤壁市', '410603', '山城区', '5', '华中');
INSERT INTO `city` VALUES ('410611', '淇滨区', '410000', '河南省', '河南', '410600', '鹤壁市', '410611', '淇滨区', '5', '华中');
INSERT INTO `city` VALUES ('410621', '浚县', '410000', '河南省', '河南', '410600', '鹤壁市', '410621', '浚县', '5', '华中');
INSERT INTO `city` VALUES ('410622', '淇县', '410000', '河南省', '河南', '410600', '鹤壁市', '410622', '淇县', '5', '华中');
INSERT INTO `city` VALUES ('410700', '新乡市', '410000', '河南省', '河南', '410700', '新乡市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410701', '市辖区', '410000', '河南省', '河南', '410700', '新乡市', '410701', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410702', '红旗区', '410000', '河南省', '河南', '410700', '新乡市', '410702', '红旗区', '5', '华中');
INSERT INTO `city` VALUES ('410703', '卫滨区', '410000', '河南省', '河南', '410700', '新乡市', '410703', '卫滨区', '5', '华中');
INSERT INTO `city` VALUES ('410704', '凤泉区', '410000', '河南省', '河南', '410700', '新乡市', '410704', '凤泉区', '5', '华中');
INSERT INTO `city` VALUES ('410711', '牧野区', '410000', '河南省', '河南', '410700', '新乡市', '410711', '牧野区', '5', '华中');
INSERT INTO `city` VALUES ('410721', '新乡县', '410000', '河南省', '河南', '410700', '新乡市', '410721', '新乡县', '5', '华中');
INSERT INTO `city` VALUES ('410724', '获嘉县', '410000', '河南省', '河南', '410700', '新乡市', '410724', '获嘉县', '5', '华中');
INSERT INTO `city` VALUES ('410725', '原阳县', '410000', '河南省', '河南', '410700', '新乡市', '410725', '原阳县', '5', '华中');
INSERT INTO `city` VALUES ('410726', '延津县', '410000', '河南省', '河南', '410700', '新乡市', '410726', '延津县', '5', '华中');
INSERT INTO `city` VALUES ('410727', '封丘县', '410000', '河南省', '河南', '410700', '新乡市', '410727', '封丘县', '5', '华中');
INSERT INTO `city` VALUES ('410728', '长垣县', '410000', '河南省', '河南', '410700', '新乡市', '410728', '长垣县', '5', '华中');
INSERT INTO `city` VALUES ('410781', '卫辉市', '410000', '河南省', '河南', '410700', '新乡市', '410781', '卫辉市', '5', '华中');
INSERT INTO `city` VALUES ('410782', '辉县市', '410000', '河南省', '河南', '410700', '新乡市', '410782', '辉县市', '5', '华中');
INSERT INTO `city` VALUES ('410800', '焦作市', '410000', '河南省', '河南', '410800', '焦作市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410801', '市辖区', '410000', '河南省', '河南', '410800', '焦作市', '410801', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410802', '解放区', '410000', '河南省', '河南', '410800', '焦作市', '410802', '解放区', '5', '华中');
INSERT INTO `city` VALUES ('410803', '中站区', '410000', '河南省', '河南', '410800', '焦作市', '410803', '中站区', '5', '华中');
INSERT INTO `city` VALUES ('410804', '马村区', '410000', '河南省', '河南', '410800', '焦作市', '410804', '马村区', '5', '华中');
INSERT INTO `city` VALUES ('410811', '山阳区', '410000', '河南省', '河南', '410800', '焦作市', '410811', '山阳区', '5', '华中');
INSERT INTO `city` VALUES ('410821', '修武县', '410000', '河南省', '河南', '410800', '焦作市', '410821', '修武县', '5', '华中');
INSERT INTO `city` VALUES ('410822', '博爱县', '410000', '河南省', '河南', '410800', '焦作市', '410822', '博爱县', '5', '华中');
INSERT INTO `city` VALUES ('410823', '武陟县', '410000', '河南省', '河南', '410800', '焦作市', '410823', '武陟县', '5', '华中');
INSERT INTO `city` VALUES ('410825', '温县', '410000', '河南省', '河南', '410800', '焦作市', '410825', '温县', '5', '华中');
INSERT INTO `city` VALUES ('410882', '沁阳市', '410000', '河南省', '河南', '410800', '焦作市', '410882', '沁阳市', '5', '华中');
INSERT INTO `city` VALUES ('410883', '孟州市', '410000', '河南省', '河南', '410800', '焦作市', '410883', '孟州市', '5', '华中');
INSERT INTO `city` VALUES ('410900', '濮阳市', '410000', '河南省', '河南', '410900', '濮阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('410901', '市辖区', '410000', '河南省', '河南', '410900', '濮阳市', '410901', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('410902', '华龙区', '410000', '河南省', '河南', '410900', '濮阳市', '410902', '华龙区', '5', '华中');
INSERT INTO `city` VALUES ('410922', '清丰县', '410000', '河南省', '河南', '410900', '濮阳市', '410922', '清丰县', '5', '华中');
INSERT INTO `city` VALUES ('410923', '南乐县', '410000', '河南省', '河南', '410900', '濮阳市', '410923', '南乐县', '5', '华中');
INSERT INTO `city` VALUES ('410926', '范县', '410000', '河南省', '河南', '410900', '濮阳市', '410926', '范县', '5', '华中');
INSERT INTO `city` VALUES ('410927', '台前县', '410000', '河南省', '河南', '410900', '濮阳市', '410927', '台前县', '5', '华中');
INSERT INTO `city` VALUES ('410928', '濮阳县', '410000', '河南省', '河南', '410900', '濮阳市', '410928', '濮阳县', '5', '华中');
INSERT INTO `city` VALUES ('411000', '许昌市', '410000', '河南省', '河南', '411000', '许昌市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411001', '市辖区', '410000', '河南省', '河南', '411000', '许昌市', '411001', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411002', '魏都区', '410000', '河南省', '河南', '411000', '许昌市', '411002', '魏都区', '5', '华中');
INSERT INTO `city` VALUES ('411023', '许昌县', '410000', '河南省', '河南', '411000', '许昌市', '411023', '许昌县', '5', '华中');
INSERT INTO `city` VALUES ('411024', '鄢陵县', '410000', '河南省', '河南', '411000', '许昌市', '411024', '鄢陵县', '5', '华中');
INSERT INTO `city` VALUES ('411025', '襄城县', '410000', '河南省', '河南', '411000', '许昌市', '411025', '襄城县', '5', '华中');
INSERT INTO `city` VALUES ('411081', '禹州市', '410000', '河南省', '河南', '411000', '许昌市', '411081', '禹州市', '5', '华中');
INSERT INTO `city` VALUES ('411082', '长葛市', '410000', '河南省', '河南', '411000', '许昌市', '411082', '长葛市', '5', '华中');
INSERT INTO `city` VALUES ('411100', '漯河市', '410000', '河南省', '河南', '411100', '漯河市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411101', '市辖区', '410000', '河南省', '河南', '411100', '漯河市', '411101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411102', '源汇区', '410000', '河南省', '河南', '411100', '漯河市', '411102', '源汇区', '5', '华中');
INSERT INTO `city` VALUES ('411103', '郾城区', '410000', '河南省', '河南', '411100', '漯河市', '411103', '郾城区', '5', '华中');
INSERT INTO `city` VALUES ('411104', '召陵区', '410000', '河南省', '河南', '411100', '漯河市', '411104', '召陵区', '5', '华中');
INSERT INTO `city` VALUES ('411121', '舞阳县', '410000', '河南省', '河南', '411100', '漯河市', '411121', '舞阳县', '5', '华中');
INSERT INTO `city` VALUES ('411122', '临颍县', '410000', '河南省', '河南', '411100', '漯河市', '411122', '临颍县', '5', '华中');
INSERT INTO `city` VALUES ('411200', '三门峡市', '410000', '河南省', '河南', '411200', '三门峡市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411201', '市辖区', '410000', '河南省', '河南', '411200', '三门峡市', '411201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411202', '湖滨区', '410000', '河南省', '河南', '411200', '三门峡市', '411202', '湖滨区', '5', '华中');
INSERT INTO `city` VALUES ('411221', '渑池县', '410000', '河南省', '河南', '411200', '三门峡市', '411221', '渑池县', '5', '华中');
INSERT INTO `city` VALUES ('411222', '陕县', '410000', '河南省', '河南', '411200', '三门峡市', '411222', '陕县', '5', '华中');
INSERT INTO `city` VALUES ('411224', '卢氏县', '410000', '河南省', '河南', '411200', '三门峡市', '411224', '卢氏县', '5', '华中');
INSERT INTO `city` VALUES ('411281', '义马市', '410000', '河南省', '河南', '411200', '三门峡市', '411281', '义马市', '5', '华中');
INSERT INTO `city` VALUES ('411282', '灵宝市', '410000', '河南省', '河南', '411200', '三门峡市', '411282', '灵宝市', '5', '华中');
INSERT INTO `city` VALUES ('411300', '南阳市', '410000', '河南省', '河南', '411300', '南阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411301', '市辖区', '410000', '河南省', '河南', '411300', '南阳市', '411301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411302', '宛城区', '410000', '河南省', '河南', '411300', '南阳市', '411302', '宛城区', '5', '华中');
INSERT INTO `city` VALUES ('411303', '卧龙区', '410000', '河南省', '河南', '411300', '南阳市', '411303', '卧龙区', '5', '华中');
INSERT INTO `city` VALUES ('411321', '南召县', '410000', '河南省', '河南', '411300', '南阳市', '411321', '南召县', '5', '华中');
INSERT INTO `city` VALUES ('411322', '方城县', '410000', '河南省', '河南', '411300', '南阳市', '411322', '方城县', '5', '华中');
INSERT INTO `city` VALUES ('411323', '西峡县', '410000', '河南省', '河南', '411300', '南阳市', '411323', '西峡县', '5', '华中');
INSERT INTO `city` VALUES ('411324', '镇平县', '410000', '河南省', '河南', '411300', '南阳市', '411324', '镇平县', '5', '华中');
INSERT INTO `city` VALUES ('411325', '内乡县', '410000', '河南省', '河南', '411300', '南阳市', '411325', '内乡县', '5', '华中');
INSERT INTO `city` VALUES ('411326', '淅川县', '410000', '河南省', '河南', '411300', '南阳市', '411326', '淅川县', '5', '华中');
INSERT INTO `city` VALUES ('411327', '社旗县', '410000', '河南省', '河南', '411300', '南阳市', '411327', '社旗县', '5', '华中');
INSERT INTO `city` VALUES ('411328', '唐河县', '410000', '河南省', '河南', '411300', '南阳市', '411328', '唐河县', '5', '华中');
INSERT INTO `city` VALUES ('411329', '新野县', '410000', '河南省', '河南', '411300', '南阳市', '411329', '新野县', '5', '华中');
INSERT INTO `city` VALUES ('411330', '桐柏县', '410000', '河南省', '河南', '411300', '南阳市', '411330', '桐柏县', '5', '华中');
INSERT INTO `city` VALUES ('411381', '邓州市', '410000', '河南省', '河南', '411300', '南阳市', '411381', '邓州市', '5', '华中');
INSERT INTO `city` VALUES ('411400', '商丘市', '410000', '河南省', '河南', '411400', '商丘市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411401', '市辖区', '410000', '河南省', '河南', '411400', '商丘市', '411401', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411402', '梁园区', '410000', '河南省', '河南', '411400', '商丘市', '411402', '梁园区', '5', '华中');
INSERT INTO `city` VALUES ('411403', '睢阳区', '410000', '河南省', '河南', '411400', '商丘市', '411403', '睢阳区', '5', '华中');
INSERT INTO `city` VALUES ('411421', '民权县', '410000', '河南省', '河南', '411400', '商丘市', '411421', '民权县', '5', '华中');
INSERT INTO `city` VALUES ('411422', '睢县', '410000', '河南省', '河南', '411400', '商丘市', '411422', '睢县', '5', '华中');
INSERT INTO `city` VALUES ('411423', '宁陵县', '410000', '河南省', '河南', '411400', '商丘市', '411423', '宁陵县', '5', '华中');
INSERT INTO `city` VALUES ('411424', '柘城县', '410000', '河南省', '河南', '411400', '商丘市', '411424', '柘城县', '5', '华中');
INSERT INTO `city` VALUES ('411425', '虞城县', '410000', '河南省', '河南', '411400', '商丘市', '411425', '虞城县', '5', '华中');
INSERT INTO `city` VALUES ('411426', '夏邑县', '410000', '河南省', '河南', '411400', '商丘市', '411426', '夏邑县', '5', '华中');
INSERT INTO `city` VALUES ('411481', '永城市', '410000', '河南省', '河南', '411400', '商丘市', '411481', '永城市', '5', '华中');
INSERT INTO `city` VALUES ('411500', '信阳市', '410000', '河南省', '河南', '411500', '信阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411501', '市辖区', '410000', '河南省', '河南', '411500', '信阳市', '411501', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411502', '浉河区', '410000', '河南省', '河南', '411500', '信阳市', '411502', '浉河区', '5', '华中');
INSERT INTO `city` VALUES ('411503', '平桥区', '410000', '河南省', '河南', '411500', '信阳市', '411503', '平桥区', '5', '华中');
INSERT INTO `city` VALUES ('411521', '罗山县', '410000', '河南省', '河南', '411500', '信阳市', '411521', '罗山县', '5', '华中');
INSERT INTO `city` VALUES ('411522', '光山县', '410000', '河南省', '河南', '411500', '信阳市', '411522', '光山县', '5', '华中');
INSERT INTO `city` VALUES ('411523', '新县', '410000', '河南省', '河南', '411500', '信阳市', '411523', '新县', '5', '华中');
INSERT INTO `city` VALUES ('411524', '商城县', '410000', '河南省', '河南', '411500', '信阳市', '411524', '商城县', '5', '华中');
INSERT INTO `city` VALUES ('411525', '固始县', '410000', '河南省', '河南', '411500', '信阳市', '411525', '固始县', '5', '华中');
INSERT INTO `city` VALUES ('411526', '潢川县', '410000', '河南省', '河南', '411500', '信阳市', '411526', '潢川县', '5', '华中');
INSERT INTO `city` VALUES ('411527', '淮滨县', '410000', '河南省', '河南', '411500', '信阳市', '411527', '淮滨县', '5', '华中');
INSERT INTO `city` VALUES ('411528', '息县', '410000', '河南省', '河南', '411500', '信阳市', '411528', '息县', '5', '华中');
INSERT INTO `city` VALUES ('411600', '周口市', '410000', '河南省', '河南', '411600', '周口市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411601', '市辖区', '410000', '河南省', '河南', '411600', '周口市', '411601', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411602', '川汇区', '410000', '河南省', '河南', '411600', '周口市', '411602', '川汇区', '5', '华中');
INSERT INTO `city` VALUES ('411621', '扶沟县', '410000', '河南省', '河南', '411600', '周口市', '411621', '扶沟县', '5', '华中');
INSERT INTO `city` VALUES ('411622', '西华县', '410000', '河南省', '河南', '411600', '周口市', '411622', '西华县', '5', '华中');
INSERT INTO `city` VALUES ('411623', '商水县', '410000', '河南省', '河南', '411600', '周口市', '411623', '商水县', '5', '华中');
INSERT INTO `city` VALUES ('411624', '沈丘县', '410000', '河南省', '河南', '411600', '周口市', '411624', '沈丘县', '5', '华中');
INSERT INTO `city` VALUES ('411625', '郸城县', '410000', '河南省', '河南', '411600', '周口市', '411625', '郸城县', '5', '华中');
INSERT INTO `city` VALUES ('411626', '淮阳县', '410000', '河南省', '河南', '411600', '周口市', '411626', '淮阳县', '5', '华中');
INSERT INTO `city` VALUES ('411627', '太康县', '410000', '河南省', '河南', '411600', '周口市', '411627', '太康县', '5', '华中');
INSERT INTO `city` VALUES ('411628', '鹿邑县', '410000', '河南省', '河南', '411600', '周口市', '411628', '鹿邑县', '5', '华中');
INSERT INTO `city` VALUES ('411681', '项城市', '410000', '河南省', '河南', '411600', '周口市', '411681', '项城市', '5', '华中');
INSERT INTO `city` VALUES ('411700', '驻马店市', '410000', '河南省', '河南', '411700', '驻马店市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('411701', '市辖区', '410000', '河南省', '河南', '411700', '驻马店市', '411701', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('411702', '驿城区', '410000', '河南省', '河南', '411700', '驻马店市', '411702', '驿城区', '5', '华中');
INSERT INTO `city` VALUES ('411721', '西平县', '410000', '河南省', '河南', '411700', '驻马店市', '411721', '西平县', '5', '华中');
INSERT INTO `city` VALUES ('411722', '上蔡县', '410000', '河南省', '河南', '411700', '驻马店市', '411722', '上蔡县', '5', '华中');
INSERT INTO `city` VALUES ('411723', '平舆县', '410000', '河南省', '河南', '411700', '驻马店市', '411723', '平舆县', '5', '华中');
INSERT INTO `city` VALUES ('411724', '正阳县', '410000', '河南省', '河南', '411700', '驻马店市', '411724', '正阳县', '5', '华中');
INSERT INTO `city` VALUES ('411725', '确山县', '410000', '河南省', '河南', '411700', '驻马店市', '411725', '确山县', '5', '华中');
INSERT INTO `city` VALUES ('411726', '泌阳县', '410000', '河南省', '河南', '411700', '驻马店市', '411726', '泌阳县', '5', '华中');
INSERT INTO `city` VALUES ('411727', '汝南县', '410000', '河南省', '河南', '411700', '驻马店市', '411727', '汝南县', '5', '华中');
INSERT INTO `city` VALUES ('411728', '遂平县', '410000', '河南省', '河南', '411700', '驻马店市', '411728', '遂平县', '5', '华中');
INSERT INTO `city` VALUES ('411729', '新蔡县', '410000', '河南省', '河南', '411700', '驻马店市', '411729', '新蔡县', '5', '华中');
INSERT INTO `city` VALUES ('419001', '济源市', '410000', '河南省', '河南', '411700', '驻马店市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420000', '湖北省', '420000', '湖北省', '湖北', '0', '', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420100', '武汉市', '420000', '湖北省', '湖北', '420100', '武汉市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420101', '市辖区', '420000', '湖北省', '湖北', '420100', '武汉市', '420101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420102', '江岸区', '420000', '湖北省', '湖北', '420100', '武汉市', '420102', '江岸区', '5', '华中');
INSERT INTO `city` VALUES ('420103', '江汉区', '420000', '湖北省', '湖北', '420100', '武汉市', '420103', '江汉区', '5', '华中');
INSERT INTO `city` VALUES ('420104', '硚口区', '420000', '湖北省', '湖北', '420100', '武汉市', '420104', '硚口区', '5', '华中');
INSERT INTO `city` VALUES ('420105', '汉阳区', '420000', '湖北省', '湖北', '420100', '武汉市', '420105', '汉阳区', '5', '华中');
INSERT INTO `city` VALUES ('420106', '武昌区', '420000', '湖北省', '湖北', '420100', '武汉市', '420106', '武昌区', '5', '华中');
INSERT INTO `city` VALUES ('420107', '青山区', '420000', '湖北省', '湖北', '420100', '武汉市', '420107', '青山区', '5', '华中');
INSERT INTO `city` VALUES ('420111', '洪山区', '420000', '湖北省', '湖北', '420100', '武汉市', '420111', '洪山区', '5', '华中');
INSERT INTO `city` VALUES ('420112', '东西湖区', '420000', '湖北省', '湖北', '420100', '武汉市', '420112', '东西湖区', '5', '华中');
INSERT INTO `city` VALUES ('420113', '汉南区', '420000', '湖北省', '湖北', '420100', '武汉市', '420113', '汉南区', '5', '华中');
INSERT INTO `city` VALUES ('420114', '蔡甸区', '420000', '湖北省', '湖北', '420100', '武汉市', '420114', '蔡甸区', '5', '华中');
INSERT INTO `city` VALUES ('420115', '江夏区', '420000', '湖北省', '湖北', '420100', '武汉市', '420115', '江夏区', '5', '华中');
INSERT INTO `city` VALUES ('420116', '黄陂区', '420000', '湖北省', '湖北', '420100', '武汉市', '420116', '黄陂区', '5', '华中');
INSERT INTO `city` VALUES ('420117', '新洲区', '420000', '湖北省', '湖北', '420100', '武汉市', '420117', '新洲区', '5', '华中');
INSERT INTO `city` VALUES ('420200', '黄石市', '420000', '湖北省', '湖北', '420200', '黄石市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420201', '市辖区', '420000', '湖北省', '湖北', '420200', '黄石市', '420201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420202', '黄石港区', '420000', '湖北省', '湖北', '420200', '黄石市', '420202', '黄石港区', '5', '华中');
INSERT INTO `city` VALUES ('420203', '西塞山区', '420000', '湖北省', '湖北', '420200', '黄石市', '420203', '西塞山区', '5', '华中');
INSERT INTO `city` VALUES ('420204', '下陆区', '420000', '湖北省', '湖北', '420200', '黄石市', '420204', '下陆区', '5', '华中');
INSERT INTO `city` VALUES ('420205', '铁山区', '420000', '湖北省', '湖北', '420200', '黄石市', '420205', '铁山区', '5', '华中');
INSERT INTO `city` VALUES ('420222', '阳新县', '420000', '湖北省', '湖北', '420200', '黄石市', '420222', '阳新县', '5', '华中');
INSERT INTO `city` VALUES ('420281', '大冶市', '420000', '湖北省', '湖北', '420200', '黄石市', '420281', '大冶市', '5', '华中');
INSERT INTO `city` VALUES ('420300', '十堰市', '420000', '湖北省', '湖北', '420300', '十堰市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420301', '市辖区', '420000', '湖北省', '湖北', '420300', '十堰市', '420301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420302', '茅箭区', '420000', '湖北省', '湖北', '420300', '十堰市', '420302', '茅箭区', '5', '华中');
INSERT INTO `city` VALUES ('420303', '张湾区', '420000', '湖北省', '湖北', '420300', '十堰市', '420303', '张湾区', '5', '华中');
INSERT INTO `city` VALUES ('420321', '郧县', '420000', '湖北省', '湖北', '420300', '十堰市', '420321', '郧县', '5', '华中');
INSERT INTO `city` VALUES ('420322', '郧西县', '420000', '湖北省', '湖北', '420300', '十堰市', '420322', '郧西县', '5', '华中');
INSERT INTO `city` VALUES ('420323', '竹山县', '420000', '湖北省', '湖北', '420300', '十堰市', '420323', '竹山县', '5', '华中');
INSERT INTO `city` VALUES ('420324', '竹溪县', '420000', '湖北省', '湖北', '420300', '十堰市', '420324', '竹溪县', '5', '华中');
INSERT INTO `city` VALUES ('420325', '房县', '420000', '湖北省', '湖北', '420300', '十堰市', '420325', '房县', '5', '华中');
INSERT INTO `city` VALUES ('420381', '丹江口市', '420000', '湖北省', '湖北', '420300', '十堰市', '420381', '丹江口市', '5', '华中');
INSERT INTO `city` VALUES ('420500', '宜昌市', '420000', '湖北省', '湖北', '420500', '宜昌市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420501', '市辖区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420501', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420502', '西陵区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420502', '西陵区', '5', '华中');
INSERT INTO `city` VALUES ('420503', '伍家岗区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420503', '伍家岗区', '5', '华中');
INSERT INTO `city` VALUES ('420504', '点军区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420504', '点军区', '5', '华中');
INSERT INTO `city` VALUES ('420505', '猇亭区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420505', '猇亭区', '5', '华中');
INSERT INTO `city` VALUES ('420506', '夷陵区', '420000', '湖北省', '湖北', '420500', '宜昌市', '420506', '夷陵区', '5', '华中');
INSERT INTO `city` VALUES ('420525', '远安县', '420000', '湖北省', '湖北', '420500', '宜昌市', '420525', '远安县', '5', '华中');
INSERT INTO `city` VALUES ('420526', '兴山县', '420000', '湖北省', '湖北', '420500', '宜昌市', '420526', '兴山县', '5', '华中');
INSERT INTO `city` VALUES ('420527', '秭归县', '420000', '湖北省', '湖北', '420500', '宜昌市', '420527', '秭归县', '5', '华中');
INSERT INTO `city` VALUES ('420528', '长阳土家族自治县', '420000', '湖北省', '湖北', '420500', '宜昌市', '420528', '长阳土家族自治县', '5', '华中');
INSERT INTO `city` VALUES ('420529', '五峰土家族自治县', '420000', '湖北省', '湖北', '420500', '宜昌市', '420529', '五峰土家族自治县', '5', '华中');
INSERT INTO `city` VALUES ('420581', '宜都市', '420000', '湖北省', '湖北', '420500', '宜昌市', '420581', '宜都市', '5', '华中');
INSERT INTO `city` VALUES ('420582', '当阳市', '420000', '湖北省', '湖北', '420500', '宜昌市', '420582', '当阳市', '5', '华中');
INSERT INTO `city` VALUES ('420583', '枝江市', '420000', '湖北省', '湖北', '420500', '宜昌市', '420583', '枝江市', '5', '华中');
INSERT INTO `city` VALUES ('420600', '襄阳市', '420000', '湖北省', '湖北', '420600', '襄阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420601', '市辖区', '420000', '湖北省', '湖北', '420600', '襄阳市', '420601', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420602', '襄城区', '420000', '湖北省', '湖北', '420600', '襄阳市', '420602', '襄城区', '5', '华中');
INSERT INTO `city` VALUES ('420606', '樊城区', '420000', '湖北省', '湖北', '420600', '襄阳市', '420606', '樊城区', '5', '华中');
INSERT INTO `city` VALUES ('420607', '襄州区', '420000', '湖北省', '湖北', '420600', '襄阳市', '420607', '襄州区', '5', '华中');
INSERT INTO `city` VALUES ('420624', '南漳县', '420000', '湖北省', '湖北', '420600', '襄阳市', '420624', '南漳县', '5', '华中');
INSERT INTO `city` VALUES ('420625', '谷城县', '420000', '湖北省', '湖北', '420600', '襄阳市', '420625', '谷城县', '5', '华中');
INSERT INTO `city` VALUES ('420626', '保康县', '420000', '湖北省', '湖北', '420600', '襄阳市', '420626', '保康县', '5', '华中');
INSERT INTO `city` VALUES ('420682', '老河口市', '420000', '湖北省', '湖北', '420600', '襄阳市', '420682', '老河口市', '5', '华中');
INSERT INTO `city` VALUES ('420683', '枣阳市', '420000', '湖北省', '湖北', '420600', '襄阳市', '420683', '枣阳市', '5', '华中');
INSERT INTO `city` VALUES ('420684', '宜城市', '420000', '湖北省', '湖北', '420600', '襄阳市', '420684', '宜城市', '5', '华中');
INSERT INTO `city` VALUES ('420700', '鄂州市', '420000', '湖北省', '湖北', '420700', '鄂州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420701', '市辖区', '420000', '湖北省', '湖北', '420700', '鄂州市', '420701', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420702', '梁子湖区', '420000', '湖北省', '湖北', '420700', '鄂州市', '420702', '梁子湖区', '5', '华中');
INSERT INTO `city` VALUES ('420703', '华容区', '420000', '湖北省', '湖北', '420700', '鄂州市', '420703', '华容区', '5', '华中');
INSERT INTO `city` VALUES ('420704', '鄂城区', '420000', '湖北省', '湖北', '420700', '鄂州市', '420704', '鄂城区', '5', '华中');
INSERT INTO `city` VALUES ('420800', '荆门市', '420000', '湖北省', '湖北', '420800', '荆门市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420801', '市辖区', '420000', '湖北省', '湖北', '420800', '荆门市', '420801', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420802', '东宝区', '420000', '湖北省', '湖北', '420800', '荆门市', '420802', '东宝区', '5', '华中');
INSERT INTO `city` VALUES ('420804', '掇刀区', '420000', '湖北省', '湖北', '420800', '荆门市', '420804', '掇刀区', '5', '华中');
INSERT INTO `city` VALUES ('420821', '京山县', '420000', '湖北省', '湖北', '420800', '荆门市', '420821', '京山县', '5', '华中');
INSERT INTO `city` VALUES ('420822', '沙洋县', '420000', '湖北省', '湖北', '420800', '荆门市', '420822', '沙洋县', '5', '华中');
INSERT INTO `city` VALUES ('420881', '钟祥市', '420000', '湖北省', '湖北', '420800', '荆门市', '420881', '钟祥市', '5', '华中');
INSERT INTO `city` VALUES ('420900', '孝感市', '420000', '湖北省', '湖北', '420900', '孝感市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('420901', '市辖区', '420000', '湖北省', '湖北', '420900', '孝感市', '420901', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('420902', '孝南区', '420000', '湖北省', '湖北', '420900', '孝感市', '420902', '孝南区', '5', '华中');
INSERT INTO `city` VALUES ('420921', '孝昌县', '420000', '湖北省', '湖北', '420900', '孝感市', '420921', '孝昌县', '5', '华中');
INSERT INTO `city` VALUES ('420922', '大悟县', '420000', '湖北省', '湖北', '420900', '孝感市', '420922', '大悟县', '5', '华中');
INSERT INTO `city` VALUES ('420923', '云梦县', '420000', '湖北省', '湖北', '420900', '孝感市', '420923', '云梦县', '5', '华中');
INSERT INTO `city` VALUES ('420981', '应城市', '420000', '湖北省', '湖北', '420900', '孝感市', '420981', '应城市', '5', '华中');
INSERT INTO `city` VALUES ('420982', '安陆市', '420000', '湖北省', '湖北', '420900', '孝感市', '420982', '安陆市', '5', '华中');
INSERT INTO `city` VALUES ('420984', '汉川市', '420000', '湖北省', '湖北', '420900', '孝感市', '420984', '汉川市', '5', '华中');
INSERT INTO `city` VALUES ('421000', '荆州市', '420000', '湖北省', '湖北', '421000', '荆州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('421001', '市辖区', '420000', '湖北省', '湖北', '421000', '荆州市', '421001', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('421002', '沙市区', '420000', '湖北省', '湖北', '421000', '荆州市', '421002', '沙市区', '5', '华中');
INSERT INTO `city` VALUES ('421003', '荆州区', '420000', '湖北省', '湖北', '421000', '荆州市', '421003', '荆州区', '5', '华中');
INSERT INTO `city` VALUES ('421022', '公安县', '420000', '湖北省', '湖北', '421000', '荆州市', '421022', '公安县', '5', '华中');
INSERT INTO `city` VALUES ('421023', '监利县', '420000', '湖北省', '湖北', '421000', '荆州市', '421023', '监利县', '5', '华中');
INSERT INTO `city` VALUES ('421024', '江陵县', '420000', '湖北省', '湖北', '421000', '荆州市', '421024', '江陵县', '5', '华中');
INSERT INTO `city` VALUES ('421081', '石首市', '420000', '湖北省', '湖北', '421000', '荆州市', '421081', '石首市', '5', '华中');
INSERT INTO `city` VALUES ('421083', '洪湖市', '420000', '湖北省', '湖北', '421000', '荆州市', '421083', '洪湖市', '5', '华中');
INSERT INTO `city` VALUES ('421087', '松滋市', '420000', '湖北省', '湖北', '421000', '荆州市', '421087', '松滋市', '5', '华中');
INSERT INTO `city` VALUES ('421100', '黄冈市', '420000', '湖北省', '湖北', '421100', '黄冈市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('421101', '市辖区', '420000', '湖北省', '湖北', '421100', '黄冈市', '421101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('421102', '黄州区', '420000', '湖北省', '湖北', '421100', '黄冈市', '421102', '黄州区', '5', '华中');
INSERT INTO `city` VALUES ('421121', '团风县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421121', '团风县', '5', '华中');
INSERT INTO `city` VALUES ('421122', '红安县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421122', '红安县', '5', '华中');
INSERT INTO `city` VALUES ('421123', '罗田县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421123', '罗田县', '5', '华中');
INSERT INTO `city` VALUES ('421124', '英山县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421124', '英山县', '5', '华中');
INSERT INTO `city` VALUES ('421125', '浠水县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421125', '浠水县', '5', '华中');
INSERT INTO `city` VALUES ('421126', '蕲春县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421126', '蕲春县', '5', '华中');
INSERT INTO `city` VALUES ('421127', '黄梅县', '420000', '湖北省', '湖北', '421100', '黄冈市', '421127', '黄梅县', '5', '华中');
INSERT INTO `city` VALUES ('421181', '麻城市', '420000', '湖北省', '湖北', '421100', '黄冈市', '421181', '麻城市', '5', '华中');
INSERT INTO `city` VALUES ('421182', '武穴市', '420000', '湖北省', '湖北', '421100', '黄冈市', '421182', '武穴市', '5', '华中');
INSERT INTO `city` VALUES ('421200', '咸宁市', '420000', '湖北省', '湖北', '421200', '咸宁市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('421201', '市辖区', '420000', '湖北省', '湖北', '421200', '咸宁市', '421201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('421202', '咸安区', '420000', '湖北省', '湖北', '421200', '咸宁市', '421202', '咸安区', '5', '华中');
INSERT INTO `city` VALUES ('421221', '嘉鱼县', '420000', '湖北省', '湖北', '421200', '咸宁市', '421221', '嘉鱼县', '5', '华中');
INSERT INTO `city` VALUES ('421222', '通城县', '420000', '湖北省', '湖北', '421200', '咸宁市', '421222', '通城县', '5', '华中');
INSERT INTO `city` VALUES ('421223', '崇阳县', '420000', '湖北省', '湖北', '421200', '咸宁市', '421223', '崇阳县', '5', '华中');
INSERT INTO `city` VALUES ('421224', '通山县', '420000', '湖北省', '湖北', '421200', '咸宁市', '421224', '通山县', '5', '华中');
INSERT INTO `city` VALUES ('421281', '赤壁市', '420000', '湖北省', '湖北', '421200', '咸宁市', '421281', '赤壁市', '5', '华中');
INSERT INTO `city` VALUES ('421300', '随州市', '420000', '湖北省', '湖北', '421300', '随州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('421301', '市辖区', '420000', '湖北省', '湖北', '421300', '随州市', '421301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('421303', '曾都区', '420000', '湖北省', '湖北', '421300', '随州市', '421303', '曾都区', '5', '华中');
INSERT INTO `city` VALUES ('421321', '随县', '420000', '湖北省', '湖北', '421300', '随州市', '421321', '随县', '5', '华中');
INSERT INTO `city` VALUES ('421381', '广水市', '420000', '湖北省', '湖北', '421300', '随州市', '421381', '广水市', '5', '华中');
INSERT INTO `city` VALUES ('422800', '恩施土家族苗族自治州', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('422801', '恩施市', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422801', '恩施市', '5', '华中');
INSERT INTO `city` VALUES ('422802', '利川市', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422802', '利川市', '5', '华中');
INSERT INTO `city` VALUES ('422822', '建始县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422822', '建始县', '5', '华中');
INSERT INTO `city` VALUES ('422823', '巴东县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422823', '巴东县', '5', '华中');
INSERT INTO `city` VALUES ('422825', '宣恩县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422825', '宣恩县', '5', '华中');
INSERT INTO `city` VALUES ('422826', '咸丰县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422826', '咸丰县', '5', '华中');
INSERT INTO `city` VALUES ('422827', '来凤县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422827', '来凤县', '5', '华中');
INSERT INTO `city` VALUES ('422828', '鹤峰县', '420000', '湖北省', '湖北', '422800', '恩施土家族苗族自治州', '422828', '鹤峰县', '5', '华中');
INSERT INTO `city` VALUES ('429000', '省直辖县级行政区划', '420000', '湖北省', '湖北', '429000', '省直辖县级行政区划', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('429004', '仙桃市', '420000', '湖北省', '湖北', '429000', '省直辖县级行政区划', '429004', '仙桃市', '5', '华中');
INSERT INTO `city` VALUES ('429005', '潜江市', '420000', '湖北省', '湖北', '429000', '省直辖县级行政区划', '429005', '潜江市', '5', '华中');
INSERT INTO `city` VALUES ('429006', '天门市', '420000', '湖北省', '湖北', '429000', '省直辖县级行政区划', '429006', '天门市', '5', '华中');
INSERT INTO `city` VALUES ('429021', '神农架林区', '420000', '湖北省', '湖北', '429000', '省直辖县级行政区划', '429021', '神农架林区', '5', '华中');
INSERT INTO `city` VALUES ('430000', '湖南省', '430000', '湖南省', '湖南', '0', '', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430100', '长沙市', '430000', '湖南省', '湖南', '430100', '长沙市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430101', '市辖区', '430000', '湖南省', '湖南', '430100', '长沙市', '430101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430102', '芙蓉区', '430000', '湖南省', '湖南', '430100', '长沙市', '430102', '芙蓉区', '5', '华中');
INSERT INTO `city` VALUES ('430103', '天心区', '430000', '湖南省', '湖南', '430100', '长沙市', '430103', '天心区', '5', '华中');
INSERT INTO `city` VALUES ('430104', '岳麓区', '430000', '湖南省', '湖南', '430100', '长沙市', '430104', '岳麓区', '5', '华中');
INSERT INTO `city` VALUES ('430105', '开福区', '430000', '湖南省', '湖南', '430100', '长沙市', '430105', '开福区', '5', '华中');
INSERT INTO `city` VALUES ('430111', '雨花区', '430000', '湖南省', '湖南', '430100', '长沙市', '430111', '雨花区', '5', '华中');
INSERT INTO `city` VALUES ('430112', '望城区', '430000', '湖南省', '湖南', '430100', '长沙市', '430112', '望城区', '5', '华中');
INSERT INTO `city` VALUES ('430121', '长沙县', '430000', '湖南省', '湖南', '430100', '长沙市', '430121', '长沙县', '5', '华中');
INSERT INTO `city` VALUES ('430124', '宁乡县', '430000', '湖南省', '湖南', '430100', '长沙市', '430124', '宁乡县', '5', '华中');
INSERT INTO `city` VALUES ('430181', '浏阳市', '430000', '湖南省', '湖南', '430100', '长沙市', '430181', '浏阳市', '5', '华中');
INSERT INTO `city` VALUES ('430200', '株洲市', '430000', '湖南省', '湖南', '430200', '株洲市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430201', '市辖区', '430000', '湖南省', '湖南', '430200', '株洲市', '430201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430202', '荷塘区', '430000', '湖南省', '湖南', '430200', '株洲市', '430202', '荷塘区', '5', '华中');
INSERT INTO `city` VALUES ('430203', '芦淞区', '430000', '湖南省', '湖南', '430200', '株洲市', '430203', '芦淞区', '5', '华中');
INSERT INTO `city` VALUES ('430204', '石峰区', '430000', '湖南省', '湖南', '430200', '株洲市', '430204', '石峰区', '5', '华中');
INSERT INTO `city` VALUES ('430211', '天元区', '430000', '湖南省', '湖南', '430200', '株洲市', '430211', '天元区', '5', '华中');
INSERT INTO `city` VALUES ('430221', '株洲县', '430000', '湖南省', '湖南', '430200', '株洲市', '430221', '株洲县', '5', '华中');
INSERT INTO `city` VALUES ('430223', '攸县', '430000', '湖南省', '湖南', '430200', '株洲市', '430223', '攸县', '5', '华中');
INSERT INTO `city` VALUES ('430224', '茶陵县', '430000', '湖南省', '湖南', '430200', '株洲市', '430224', '茶陵县', '5', '华中');
INSERT INTO `city` VALUES ('430225', '炎陵县', '430000', '湖南省', '湖南', '430200', '株洲市', '430225', '炎陵县', '5', '华中');
INSERT INTO `city` VALUES ('430281', '醴陵市', '430000', '湖南省', '湖南', '430200', '株洲市', '430281', '醴陵市', '5', '华中');
INSERT INTO `city` VALUES ('430300', '湘潭市', '430000', '湖南省', '湖南', '430300', '湘潭市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430301', '市辖区', '430000', '湖南省', '湖南', '430300', '湘潭市', '430301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430302', '雨湖区', '430000', '湖南省', '湖南', '430300', '湘潭市', '430302', '雨湖区', '5', '华中');
INSERT INTO `city` VALUES ('430304', '岳塘区', '430000', '湖南省', '湖南', '430300', '湘潭市', '430304', '岳塘区', '5', '华中');
INSERT INTO `city` VALUES ('430321', '湘潭县', '430000', '湖南省', '湖南', '430300', '湘潭市', '430321', '湘潭县', '5', '华中');
INSERT INTO `city` VALUES ('430381', '湘乡市', '430000', '湖南省', '湖南', '430300', '湘潭市', '430381', '湘乡市', '5', '华中');
INSERT INTO `city` VALUES ('430382', '韶山市', '430000', '湖南省', '湖南', '430300', '湘潭市', '430382', '韶山市', '5', '华中');
INSERT INTO `city` VALUES ('430400', '衡阳市', '430000', '湖南省', '湖南', '430400', '衡阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430401', '市辖区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430401', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430405', '珠晖区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430405', '珠晖区', '5', '华中');
INSERT INTO `city` VALUES ('430406', '雁峰区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430406', '雁峰区', '5', '华中');
INSERT INTO `city` VALUES ('430407', '石鼓区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430407', '石鼓区', '5', '华中');
INSERT INTO `city` VALUES ('430408', '蒸湘区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430408', '蒸湘区', '5', '华中');
INSERT INTO `city` VALUES ('430412', '南岳区', '430000', '湖南省', '湖南', '430400', '衡阳市', '430412', '南岳区', '5', '华中');
INSERT INTO `city` VALUES ('430421', '衡阳县', '430000', '湖南省', '湖南', '430400', '衡阳市', '430421', '衡阳县', '5', '华中');
INSERT INTO `city` VALUES ('430422', '衡南县', '430000', '湖南省', '湖南', '430400', '衡阳市', '430422', '衡南县', '5', '华中');
INSERT INTO `city` VALUES ('430423', '衡山县', '430000', '湖南省', '湖南', '430400', '衡阳市', '430423', '衡山县', '5', '华中');
INSERT INTO `city` VALUES ('430424', '衡东县', '430000', '湖南省', '湖南', '430400', '衡阳市', '430424', '衡东县', '5', '华中');
INSERT INTO `city` VALUES ('430426', '祁东县', '430000', '湖南省', '湖南', '430400', '衡阳市', '430426', '祁东县', '5', '华中');
INSERT INTO `city` VALUES ('430481', '耒阳市', '430000', '湖南省', '湖南', '430400', '衡阳市', '430481', '耒阳市', '5', '华中');
INSERT INTO `city` VALUES ('430482', '常宁市', '430000', '湖南省', '湖南', '430400', '衡阳市', '430482', '常宁市', '5', '华中');
INSERT INTO `city` VALUES ('430500', '邵阳市', '430000', '湖南省', '湖南', '430500', '邵阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430501', '市辖区', '430000', '湖南省', '湖南', '430500', '邵阳市', '430501', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430502', '双清区', '430000', '湖南省', '湖南', '430500', '邵阳市', '430502', '双清区', '5', '华中');
INSERT INTO `city` VALUES ('430503', '大祥区', '430000', '湖南省', '湖南', '430500', '邵阳市', '430503', '大祥区', '5', '华中');
INSERT INTO `city` VALUES ('430511', '北塔区', '430000', '湖南省', '湖南', '430500', '邵阳市', '430511', '北塔区', '5', '华中');
INSERT INTO `city` VALUES ('430521', '邵东县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430521', '邵东县', '5', '华中');
INSERT INTO `city` VALUES ('430522', '新邵县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430522', '新邵县', '5', '华中');
INSERT INTO `city` VALUES ('430523', '邵阳县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430523', '邵阳县', '5', '华中');
INSERT INTO `city` VALUES ('430524', '隆回县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430524', '隆回县', '5', '华中');
INSERT INTO `city` VALUES ('430525', '洞口县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430525', '洞口县', '5', '华中');
INSERT INTO `city` VALUES ('430527', '绥宁县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430527', '绥宁县', '5', '华中');
INSERT INTO `city` VALUES ('430528', '新宁县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430528', '新宁县', '5', '华中');
INSERT INTO `city` VALUES ('430529', '城步苗族自治县', '430000', '湖南省', '湖南', '430500', '邵阳市', '430529', '城步苗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('430581', '武冈市', '430000', '湖南省', '湖南', '430500', '邵阳市', '430581', '武冈市', '5', '华中');
INSERT INTO `city` VALUES ('430600', '岳阳市', '430000', '湖南省', '湖南', '430600', '岳阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430601', '市辖区', '430000', '湖南省', '湖南', '430600', '岳阳市', '430601', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430602', '岳阳楼区', '430000', '湖南省', '湖南', '430600', '岳阳市', '430602', '岳阳楼区', '5', '华中');
INSERT INTO `city` VALUES ('430603', '云溪区', '430000', '湖南省', '湖南', '430600', '岳阳市', '430603', '云溪区', '5', '华中');
INSERT INTO `city` VALUES ('430611', '君山区', '430000', '湖南省', '湖南', '430600', '岳阳市', '430611', '君山区', '5', '华中');
INSERT INTO `city` VALUES ('430621', '岳阳县', '430000', '湖南省', '湖南', '430600', '岳阳市', '430621', '岳阳县', '5', '华中');
INSERT INTO `city` VALUES ('430623', '华容县', '430000', '湖南省', '湖南', '430600', '岳阳市', '430623', '华容县', '5', '华中');
INSERT INTO `city` VALUES ('430624', '湘阴县', '430000', '湖南省', '湖南', '430600', '岳阳市', '430624', '湘阴县', '5', '华中');
INSERT INTO `city` VALUES ('430626', '平江县', '430000', '湖南省', '湖南', '430600', '岳阳市', '430626', '平江县', '5', '华中');
INSERT INTO `city` VALUES ('430681', '汨罗市', '430000', '湖南省', '湖南', '430600', '岳阳市', '430681', '汨罗市', '5', '华中');
INSERT INTO `city` VALUES ('430682', '临湘市', '430000', '湖南省', '湖南', '430600', '岳阳市', '430682', '临湘市', '5', '华中');
INSERT INTO `city` VALUES ('430700', '常德市', '430000', '湖南省', '湖南', '430700', '常德市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430701', '市辖区', '430000', '湖南省', '湖南', '430700', '常德市', '430701', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430702', '武陵区', '430000', '湖南省', '湖南', '430700', '常德市', '430702', '武陵区', '5', '华中');
INSERT INTO `city` VALUES ('430703', '鼎城区', '430000', '湖南省', '湖南', '430700', '常德市', '430703', '鼎城区', '5', '华中');
INSERT INTO `city` VALUES ('430721', '安乡县', '430000', '湖南省', '湖南', '430700', '常德市', '430721', '安乡县', '5', '华中');
INSERT INTO `city` VALUES ('430722', '汉寿县', '430000', '湖南省', '湖南', '430700', '常德市', '430722', '汉寿县', '5', '华中');
INSERT INTO `city` VALUES ('430723', '澧县', '430000', '湖南省', '湖南', '430700', '常德市', '430723', '澧县', '5', '华中');
INSERT INTO `city` VALUES ('430724', '临澧县', '430000', '湖南省', '湖南', '430700', '常德市', '430724', '临澧县', '5', '华中');
INSERT INTO `city` VALUES ('430725', '桃源县', '430000', '湖南省', '湖南', '430700', '常德市', '430725', '桃源县', '5', '华中');
INSERT INTO `city` VALUES ('430726', '石门县', '430000', '湖南省', '湖南', '430700', '常德市', '430726', '石门县', '5', '华中');
INSERT INTO `city` VALUES ('430781', '津市市', '430000', '湖南省', '湖南', '430700', '常德市', '430781', '津市市', '5', '华中');
INSERT INTO `city` VALUES ('430800', '张家界市', '430000', '湖南省', '湖南', '430800', '张家界市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430801', '市辖区', '430000', '湖南省', '湖南', '430800', '张家界市', '430801', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430802', '永定区', '430000', '湖南省', '湖南', '430800', '张家界市', '430802', '永定区', '5', '华中');
INSERT INTO `city` VALUES ('430811', '武陵源区', '430000', '湖南省', '湖南', '430800', '张家界市', '430811', '武陵源区', '5', '华中');
INSERT INTO `city` VALUES ('430821', '慈利县', '430000', '湖南省', '湖南', '430800', '张家界市', '430821', '慈利县', '5', '华中');
INSERT INTO `city` VALUES ('430822', '桑植县', '430000', '湖南省', '湖南', '430800', '张家界市', '430822', '桑植县', '5', '华中');
INSERT INTO `city` VALUES ('430900', '益阳市', '430000', '湖南省', '湖南', '430900', '益阳市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('430901', '市辖区', '430000', '湖南省', '湖南', '430900', '益阳市', '430901', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('430902', '资阳区', '430000', '湖南省', '湖南', '430900', '益阳市', '430902', '资阳区', '5', '华中');
INSERT INTO `city` VALUES ('430903', '赫山区', '430000', '湖南省', '湖南', '430900', '益阳市', '430903', '赫山区', '5', '华中');
INSERT INTO `city` VALUES ('430921', '南县', '430000', '湖南省', '湖南', '430900', '益阳市', '430921', '南县', '5', '华中');
INSERT INTO `city` VALUES ('430922', '桃江县', '430000', '湖南省', '湖南', '430900', '益阳市', '430922', '桃江县', '5', '华中');
INSERT INTO `city` VALUES ('430923', '安化县', '430000', '湖南省', '湖南', '430900', '益阳市', '430923', '安化县', '5', '华中');
INSERT INTO `city` VALUES ('430981', '沅江市', '430000', '湖南省', '湖南', '430900', '益阳市', '430981', '沅江市', '5', '华中');
INSERT INTO `city` VALUES ('431000', '郴州市', '430000', '湖南省', '湖南', '431000', '郴州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('431001', '市辖区', '430000', '湖南省', '湖南', '431000', '郴州市', '431001', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('431002', '北湖区', '430000', '湖南省', '湖南', '431000', '郴州市', '431002', '北湖区', '5', '华中');
INSERT INTO `city` VALUES ('431003', '苏仙区', '430000', '湖南省', '湖南', '431000', '郴州市', '431003', '苏仙区', '5', '华中');
INSERT INTO `city` VALUES ('431021', '桂阳县', '430000', '湖南省', '湖南', '431000', '郴州市', '431021', '桂阳县', '5', '华中');
INSERT INTO `city` VALUES ('431022', '宜章县', '430000', '湖南省', '湖南', '431000', '郴州市', '431022', '宜章县', '5', '华中');
INSERT INTO `city` VALUES ('431023', '永兴县', '430000', '湖南省', '湖南', '431000', '郴州市', '431023', '永兴县', '5', '华中');
INSERT INTO `city` VALUES ('431024', '嘉禾县', '430000', '湖南省', '湖南', '431000', '郴州市', '431024', '嘉禾县', '5', '华中');
INSERT INTO `city` VALUES ('431025', '临武县', '430000', '湖南省', '湖南', '431000', '郴州市', '431025', '临武县', '5', '华中');
INSERT INTO `city` VALUES ('431026', '汝城县', '430000', '湖南省', '湖南', '431000', '郴州市', '431026', '汝城县', '5', '华中');
INSERT INTO `city` VALUES ('431027', '桂东县', '430000', '湖南省', '湖南', '431000', '郴州市', '431027', '桂东县', '5', '华中');
INSERT INTO `city` VALUES ('431028', '安仁县', '430000', '湖南省', '湖南', '431000', '郴州市', '431028', '安仁县', '5', '华中');
INSERT INTO `city` VALUES ('431081', '资兴市', '430000', '湖南省', '湖南', '431000', '郴州市', '431081', '资兴市', '5', '华中');
INSERT INTO `city` VALUES ('431100', '永州市', '430000', '湖南省', '湖南', '431100', '永州市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('431101', '市辖区', '430000', '湖南省', '湖南', '431100', '永州市', '431101', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('431102', '零陵区', '430000', '湖南省', '湖南', '431100', '永州市', '431102', '零陵区', '5', '华中');
INSERT INTO `city` VALUES ('431103', '冷水滩区', '430000', '湖南省', '湖南', '431100', '永州市', '431103', '冷水滩区', '5', '华中');
INSERT INTO `city` VALUES ('431121', '祁阳县', '430000', '湖南省', '湖南', '431100', '永州市', '431121', '祁阳县', '5', '华中');
INSERT INTO `city` VALUES ('431122', '东安县', '430000', '湖南省', '湖南', '431100', '永州市', '431122', '东安县', '5', '华中');
INSERT INTO `city` VALUES ('431123', '双牌县', '430000', '湖南省', '湖南', '431100', '永州市', '431123', '双牌县', '5', '华中');
INSERT INTO `city` VALUES ('431124', '道县', '430000', '湖南省', '湖南', '431100', '永州市', '431124', '道县', '5', '华中');
INSERT INTO `city` VALUES ('431125', '江永县', '430000', '湖南省', '湖南', '431100', '永州市', '431125', '江永县', '5', '华中');
INSERT INTO `city` VALUES ('431126', '宁远县', '430000', '湖南省', '湖南', '431100', '永州市', '431126', '宁远县', '5', '华中');
INSERT INTO `city` VALUES ('431127', '蓝山县', '430000', '湖南省', '湖南', '431100', '永州市', '431127', '蓝山县', '5', '华中');
INSERT INTO `city` VALUES ('431128', '新田县', '430000', '湖南省', '湖南', '431100', '永州市', '431128', '新田县', '5', '华中');
INSERT INTO `city` VALUES ('431129', '江华瑶族自治县', '430000', '湖南省', '湖南', '431100', '永州市', '431129', '江华瑶族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431200', '怀化市', '430000', '湖南省', '湖南', '431200', '怀化市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('431201', '市辖区', '430000', '湖南省', '湖南', '431200', '怀化市', '431201', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('431202', '鹤城区', '430000', '湖南省', '湖南', '431200', '怀化市', '431202', '鹤城区', '5', '华中');
INSERT INTO `city` VALUES ('431221', '中方县', '430000', '湖南省', '湖南', '431200', '怀化市', '431221', '中方县', '5', '华中');
INSERT INTO `city` VALUES ('431222', '沅陵县', '430000', '湖南省', '湖南', '431200', '怀化市', '431222', '沅陵县', '5', '华中');
INSERT INTO `city` VALUES ('431223', '辰溪县', '430000', '湖南省', '湖南', '431200', '怀化市', '431223', '辰溪县', '5', '华中');
INSERT INTO `city` VALUES ('431224', '溆浦县', '430000', '湖南省', '湖南', '431200', '怀化市', '431224', '溆浦县', '5', '华中');
INSERT INTO `city` VALUES ('431225', '会同县', '430000', '湖南省', '湖南', '431200', '怀化市', '431225', '会同县', '5', '华中');
INSERT INTO `city` VALUES ('431226', '麻阳苗族自治县', '430000', '湖南省', '湖南', '431200', '怀化市', '431226', '麻阳苗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431227', '新晃侗族自治县', '430000', '湖南省', '湖南', '431200', '怀化市', '431227', '新晃侗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431228', '芷江侗族自治县', '430000', '湖南省', '湖南', '431200', '怀化市', '431228', '芷江侗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431229', '靖州苗族侗族自治县', '430000', '湖南省', '湖南', '431200', '怀化市', '431229', '靖州苗族侗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431230', '通道侗族自治县', '430000', '湖南省', '湖南', '431200', '怀化市', '431230', '通道侗族自治县', '5', '华中');
INSERT INTO `city` VALUES ('431281', '洪江市', '430000', '湖南省', '湖南', '431200', '怀化市', '431281', '洪江市', '5', '华中');
INSERT INTO `city` VALUES ('431300', '娄底市', '430000', '湖南省', '湖南', '431300', '娄底市', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('431301', '市辖区', '430000', '湖南省', '湖南', '431300', '娄底市', '431301', '市辖区', '5', '华中');
INSERT INTO `city` VALUES ('431302', '娄星区', '430000', '湖南省', '湖南', '431300', '娄底市', '431302', '娄星区', '5', '华中');
INSERT INTO `city` VALUES ('431321', '双峰县', '430000', '湖南省', '湖南', '431300', '娄底市', '431321', '双峰县', '5', '华中');
INSERT INTO `city` VALUES ('431322', '新化县', '430000', '湖南省', '湖南', '431300', '娄底市', '431322', '新化县', '5', '华中');
INSERT INTO `city` VALUES ('431381', '冷水江市', '430000', '湖南省', '湖南', '431300', '娄底市', '431381', '冷水江市', '5', '华中');
INSERT INTO `city` VALUES ('431382', '涟源市', '430000', '湖南省', '湖南', '431300', '娄底市', '431382', '涟源市', '5', '华中');
INSERT INTO `city` VALUES ('433100', '湘西土家族苗族自治州', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '0', '', '5', '华中');
INSERT INTO `city` VALUES ('433101', '吉首市', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433101', '吉首市', '5', '华中');
INSERT INTO `city` VALUES ('433122', '泸溪县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433122', '泸溪县', '5', '华中');
INSERT INTO `city` VALUES ('433123', '凤凰县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433123', '凤凰县', '5', '华中');
INSERT INTO `city` VALUES ('433124', '花垣县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433124', '花垣县', '5', '华中');
INSERT INTO `city` VALUES ('433125', '保靖县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433125', '保靖县', '5', '华中');
INSERT INTO `city` VALUES ('433126', '古丈县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433126', '古丈县', '5', '华中');
INSERT INTO `city` VALUES ('433127', '永顺县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433127', '永顺县', '5', '华中');
INSERT INTO `city` VALUES ('433130', '龙山县', '430000', '湖南省', '湖南', '433100', '湘西土家族苗族自治州', '433130', '龙山县', '5', '华中');
INSERT INTO `city` VALUES ('440000', '广东省', '440000', '广东省', '广东', '0', '', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440100', '广州市', '440000', '广东省', '广东', '440100', '广州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440101', '市辖区', '440000', '广东省', '广东', '440100', '广州市', '440101', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440103', '荔湾区', '440000', '广东省', '广东', '440100', '广州市', '440103', '荔湾区', '4', '华南');
INSERT INTO `city` VALUES ('440104', '越秀区', '440000', '广东省', '广东', '440100', '广州市', '440104', '越秀区', '4', '华南');
INSERT INTO `city` VALUES ('440105', '海珠区', '440000', '广东省', '广东', '440100', '广州市', '440105', '海珠区', '4', '华南');
INSERT INTO `city` VALUES ('440106', '天河区', '440000', '广东省', '广东', '440100', '广州市', '440106', '天河区', '4', '华南');
INSERT INTO `city` VALUES ('440111', '白云区', '440000', '广东省', '广东', '440100', '广州市', '440111', '白云区', '4', '华南');
INSERT INTO `city` VALUES ('440112', '黄埔区', '440000', '广东省', '广东', '440100', '广州市', '440112', '黄埔区', '4', '华南');
INSERT INTO `city` VALUES ('440113', '番禺区', '440000', '广东省', '广东', '440100', '广州市', '440113', '番禺区', '4', '华南');
INSERT INTO `city` VALUES ('440114', '花都区', '440000', '广东省', '广东', '440100', '广州市', '440114', '花都区', '4', '华南');
INSERT INTO `city` VALUES ('440115', '南沙区', '440000', '广东省', '广东', '440100', '广州市', '440115', '南沙区', '4', '华南');
INSERT INTO `city` VALUES ('440116', '萝岗区', '440000', '广东省', '广东', '440100', '广州市', '440116', '萝岗区', '4', '华南');
INSERT INTO `city` VALUES ('440183', '增城市', '440000', '广东省', '广东', '440100', '广州市', '440183', '增城市', '4', '华南');
INSERT INTO `city` VALUES ('440184', '从化市', '440000', '广东省', '广东', '440100', '广州市', '440184', '从化市', '4', '华南');
INSERT INTO `city` VALUES ('440200', '韶关市', '440000', '广东省', '广东', '440200', '韶关市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440201', '市辖区', '440000', '广东省', '广东', '440200', '韶关市', '440201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440203', '武江区', '440000', '广东省', '广东', '440200', '韶关市', '440203', '武江区', '4', '华南');
INSERT INTO `city` VALUES ('440204', '浈江区', '440000', '广东省', '广东', '440200', '韶关市', '440204', '浈江区', '4', '华南');
INSERT INTO `city` VALUES ('440205', '曲江区', '440000', '广东省', '广东', '440200', '韶关市', '440205', '曲江区', '4', '华南');
INSERT INTO `city` VALUES ('440222', '始兴县', '440000', '广东省', '广东', '440200', '韶关市', '440222', '始兴县', '4', '华南');
INSERT INTO `city` VALUES ('440224', '仁化县', '440000', '广东省', '广东', '440200', '韶关市', '440224', '仁化县', '4', '华南');
INSERT INTO `city` VALUES ('440229', '翁源县', '440000', '广东省', '广东', '440200', '韶关市', '440229', '翁源县', '4', '华南');
INSERT INTO `city` VALUES ('440232', '乳源瑶族自治县', '440000', '广东省', '广东', '440200', '韶关市', '440232', '乳源瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('440233', '新丰县', '440000', '广东省', '广东', '440200', '韶关市', '440233', '新丰县', '4', '华南');
INSERT INTO `city` VALUES ('440281', '乐昌市', '440000', '广东省', '广东', '440200', '韶关市', '440281', '乐昌市', '4', '华南');
INSERT INTO `city` VALUES ('440282', '南雄市', '440000', '广东省', '广东', '440200', '韶关市', '440282', '南雄市', '4', '华南');
INSERT INTO `city` VALUES ('440300', '深圳市', '440000', '广东省', '广东', '440300', '深圳市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440301', '市辖区', '440000', '广东省', '广东', '440300', '深圳市', '440301', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440303', '罗湖区', '440000', '广东省', '广东', '440300', '深圳市', '440303', '罗湖区', '4', '华南');
INSERT INTO `city` VALUES ('440304', '福田区', '440000', '广东省', '广东', '440300', '深圳市', '440304', '福田区', '4', '华南');
INSERT INTO `city` VALUES ('440305', '南山区', '440000', '广东省', '广东', '440300', '深圳市', '440305', '南山区', '4', '华南');
INSERT INTO `city` VALUES ('440306', '宝安区', '440000', '广东省', '广东', '440300', '深圳市', '440306', '宝安区', '4', '华南');
INSERT INTO `city` VALUES ('440307', '龙岗区', '440000', '广东省', '广东', '440300', '深圳市', '440307', '龙岗区', '4', '华南');
INSERT INTO `city` VALUES ('440308', '盐田区', '440000', '广东省', '广东', '440300', '深圳市', '440308', '盐田区', '4', '华南');
INSERT INTO `city` VALUES ('440400', '珠海市', '440000', '广东省', '广东', '440400', '珠海市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440401', '市辖区', '440000', '广东省', '广东', '440400', '珠海市', '440401', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440402', '香洲区', '440000', '广东省', '广东', '440400', '珠海市', '440402', '香洲区', '4', '华南');
INSERT INTO `city` VALUES ('440403', '斗门区', '440000', '广东省', '广东', '440400', '珠海市', '440403', '斗门区', '4', '华南');
INSERT INTO `city` VALUES ('440404', '金湾区', '440000', '广东省', '广东', '440400', '珠海市', '440404', '金湾区', '4', '华南');
INSERT INTO `city` VALUES ('440500', '汕头市', '440000', '广东省', '广东', '440500', '汕头市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440501', '市辖区', '440000', '广东省', '广东', '440500', '汕头市', '440501', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440507', '龙湖区', '440000', '广东省', '广东', '440500', '汕头市', '440507', '龙湖区', '4', '华南');
INSERT INTO `city` VALUES ('440511', '金平区', '440000', '广东省', '广东', '440500', '汕头市', '440511', '金平区', '4', '华南');
INSERT INTO `city` VALUES ('440512', '濠江区', '440000', '广东省', '广东', '440500', '汕头市', '440512', '濠江区', '4', '华南');
INSERT INTO `city` VALUES ('440513', '潮阳区', '440000', '广东省', '广东', '440500', '汕头市', '440513', '潮阳区', '4', '华南');
INSERT INTO `city` VALUES ('440514', '潮南区', '440000', '广东省', '广东', '440500', '汕头市', '440514', '潮南区', '4', '华南');
INSERT INTO `city` VALUES ('440515', '澄海区', '440000', '广东省', '广东', '440500', '汕头市', '440515', '澄海区', '4', '华南');
INSERT INTO `city` VALUES ('440523', '南澳县', '440000', '广东省', '广东', '440500', '汕头市', '440523', '南澳县', '4', '华南');
INSERT INTO `city` VALUES ('440600', '佛山市', '440000', '广东省', '广东', '440600', '佛山市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440601', '市辖区', '440000', '广东省', '广东', '440600', '佛山市', '440601', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440604', '禅城区', '440000', '广东省', '广东', '440600', '佛山市', '440604', '禅城区', '4', '华南');
INSERT INTO `city` VALUES ('440605', '南海区', '440000', '广东省', '广东', '440600', '佛山市', '440605', '南海区', '4', '华南');
INSERT INTO `city` VALUES ('440606', '顺德区', '440000', '广东省', '广东', '440600', '佛山市', '440606', '顺德区', '4', '华南');
INSERT INTO `city` VALUES ('440607', '三水区', '440000', '广东省', '广东', '440600', '佛山市', '440607', '三水区', '4', '华南');
INSERT INTO `city` VALUES ('440608', '高明区', '440000', '广东省', '广东', '440600', '佛山市', '440608', '高明区', '4', '华南');
INSERT INTO `city` VALUES ('440700', '江门市', '440000', '广东省', '广东', '440700', '江门市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440701', '市辖区', '440000', '广东省', '广东', '440700', '江门市', '440701', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440703', '蓬江区', '440000', '广东省', '广东', '440700', '江门市', '440703', '蓬江区', '4', '华南');
INSERT INTO `city` VALUES ('440704', '江海区', '440000', '广东省', '广东', '440700', '江门市', '440704', '江海区', '4', '华南');
INSERT INTO `city` VALUES ('440705', '新会区', '440000', '广东省', '广东', '440700', '江门市', '440705', '新会区', '4', '华南');
INSERT INTO `city` VALUES ('440781', '台山市', '440000', '广东省', '广东', '440700', '江门市', '440781', '台山市', '4', '华南');
INSERT INTO `city` VALUES ('440783', '开平市', '440000', '广东省', '广东', '440700', '江门市', '440783', '开平市', '4', '华南');
INSERT INTO `city` VALUES ('440784', '鹤山市', '440000', '广东省', '广东', '440700', '江门市', '440784', '鹤山市', '4', '华南');
INSERT INTO `city` VALUES ('440785', '恩平市', '440000', '广东省', '广东', '440700', '江门市', '440785', '恩平市', '4', '华南');
INSERT INTO `city` VALUES ('440800', '湛江市', '440000', '广东省', '广东', '440800', '湛江市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440801', '市辖区', '440000', '广东省', '广东', '440800', '湛江市', '440801', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440802', '赤坎区', '440000', '广东省', '广东', '440800', '湛江市', '440802', '赤坎区', '4', '华南');
INSERT INTO `city` VALUES ('440803', '霞山区', '440000', '广东省', '广东', '440800', '湛江市', '440803', '霞山区', '4', '华南');
INSERT INTO `city` VALUES ('440804', '坡头区', '440000', '广东省', '广东', '440800', '湛江市', '440804', '坡头区', '4', '华南');
INSERT INTO `city` VALUES ('440811', '麻章区', '440000', '广东省', '广东', '440800', '湛江市', '440811', '麻章区', '4', '华南');
INSERT INTO `city` VALUES ('440823', '遂溪县', '440000', '广东省', '广东', '440800', '湛江市', '440823', '遂溪县', '4', '华南');
INSERT INTO `city` VALUES ('440825', '徐闻县', '440000', '广东省', '广东', '440800', '湛江市', '440825', '徐闻县', '4', '华南');
INSERT INTO `city` VALUES ('440881', '廉江市', '440000', '广东省', '广东', '440800', '湛江市', '440881', '廉江市', '4', '华南');
INSERT INTO `city` VALUES ('440882', '雷州市', '440000', '广东省', '广东', '440800', '湛江市', '440882', '雷州市', '4', '华南');
INSERT INTO `city` VALUES ('440883', '吴川市', '440000', '广东省', '广东', '440800', '湛江市', '440883', '吴川市', '4', '华南');
INSERT INTO `city` VALUES ('440900', '茂名市', '440000', '广东省', '广东', '440900', '茂名市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('440901', '市辖区', '440000', '广东省', '广东', '440900', '茂名市', '440901', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('440902', '茂南区', '440000', '广东省', '广东', '440900', '茂名市', '440902', '茂南区', '4', '华南');
INSERT INTO `city` VALUES ('440903', '茂港区', '440000', '广东省', '广东', '440900', '茂名市', '440903', '茂港区', '4', '华南');
INSERT INTO `city` VALUES ('440923', '电白县', '440000', '广东省', '广东', '440900', '茂名市', '440923', '电白县', '4', '华南');
INSERT INTO `city` VALUES ('440981', '高州市', '440000', '广东省', '广东', '440900', '茂名市', '440981', '高州市', '4', '华南');
INSERT INTO `city` VALUES ('440982', '化州市', '440000', '广东省', '广东', '440900', '茂名市', '440982', '化州市', '4', '华南');
INSERT INTO `city` VALUES ('440983', '信宜市', '440000', '广东省', '广东', '440900', '茂名市', '440983', '信宜市', '4', '华南');
INSERT INTO `city` VALUES ('441200', '肇庆市', '440000', '广东省', '广东', '441200', '肇庆市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441201', '市辖区', '440000', '广东省', '广东', '441200', '肇庆市', '441201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441202', '端州区', '440000', '广东省', '广东', '441200', '肇庆市', '441202', '端州区', '4', '华南');
INSERT INTO `city` VALUES ('441203', '鼎湖区', '440000', '广东省', '广东', '441200', '肇庆市', '441203', '鼎湖区', '4', '华南');
INSERT INTO `city` VALUES ('441223', '广宁县', '440000', '广东省', '广东', '441200', '肇庆市', '441223', '广宁县', '4', '华南');
INSERT INTO `city` VALUES ('441224', '怀集县', '440000', '广东省', '广东', '441200', '肇庆市', '441224', '怀集县', '4', '华南');
INSERT INTO `city` VALUES ('441225', '封开县', '440000', '广东省', '广东', '441200', '肇庆市', '441225', '封开县', '4', '华南');
INSERT INTO `city` VALUES ('441226', '德庆县', '440000', '广东省', '广东', '441200', '肇庆市', '441226', '德庆县', '4', '华南');
INSERT INTO `city` VALUES ('441283', '高要市', '440000', '广东省', '广东', '441200', '肇庆市', '441283', '高要市', '4', '华南');
INSERT INTO `city` VALUES ('441284', '四会市', '440000', '广东省', '广东', '441200', '肇庆市', '441284', '四会市', '4', '华南');
INSERT INTO `city` VALUES ('441300', '惠州市', '440000', '广东省', '广东', '441300', '惠州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441301', '市辖区', '440000', '广东省', '广东', '441300', '惠州市', '441301', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441302', '惠城区', '440000', '广东省', '广东', '441300', '惠州市', '441302', '惠城区', '4', '华南');
INSERT INTO `city` VALUES ('441303', '惠阳区', '440000', '广东省', '广东', '441300', '惠州市', '441303', '惠阳区', '4', '华南');
INSERT INTO `city` VALUES ('441322', '博罗县', '440000', '广东省', '广东', '441300', '惠州市', '441322', '博罗县', '4', '华南');
INSERT INTO `city` VALUES ('441323', '惠东县', '440000', '广东省', '广东', '441300', '惠州市', '441323', '惠东县', '4', '华南');
INSERT INTO `city` VALUES ('441324', '龙门县', '440000', '广东省', '广东', '441300', '惠州市', '441324', '龙门县', '4', '华南');
INSERT INTO `city` VALUES ('441400', '梅州市', '440000', '广东省', '广东', '441400', '梅州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441401', '市辖区', '440000', '广东省', '广东', '441400', '梅州市', '441401', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441402', '梅江区', '440000', '广东省', '广东', '441400', '梅州市', '441402', '梅江区', '4', '华南');
INSERT INTO `city` VALUES ('441421', '梅县', '440000', '广东省', '广东', '441400', '梅州市', '441421', '梅县', '4', '华南');
INSERT INTO `city` VALUES ('441422', '大埔县', '440000', '广东省', '广东', '441400', '梅州市', '441422', '大埔县', '4', '华南');
INSERT INTO `city` VALUES ('441423', '丰顺县', '440000', '广东省', '广东', '441400', '梅州市', '441423', '丰顺县', '4', '华南');
INSERT INTO `city` VALUES ('441424', '五华县', '440000', '广东省', '广东', '441400', '梅州市', '441424', '五华县', '4', '华南');
INSERT INTO `city` VALUES ('441426', '平远县', '440000', '广东省', '广东', '441400', '梅州市', '441426', '平远县', '4', '华南');
INSERT INTO `city` VALUES ('441427', '蕉岭县', '440000', '广东省', '广东', '441400', '梅州市', '441427', '蕉岭县', '4', '华南');
INSERT INTO `city` VALUES ('441481', '兴宁市', '440000', '广东省', '广东', '441400', '梅州市', '441481', '兴宁市', '4', '华南');
INSERT INTO `city` VALUES ('441500', '汕尾市', '440000', '广东省', '广东', '441500', '汕尾市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441501', '市辖区', '440000', '广东省', '广东', '441500', '汕尾市', '441501', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441502', '城区', '440000', '广东省', '广东', '441500', '汕尾市', '441502', '城区', '4', '华南');
INSERT INTO `city` VALUES ('441521', '海丰县', '440000', '广东省', '广东', '441500', '汕尾市', '441521', '海丰县', '4', '华南');
INSERT INTO `city` VALUES ('441523', '陆河县', '440000', '广东省', '广东', '441500', '汕尾市', '441523', '陆河县', '4', '华南');
INSERT INTO `city` VALUES ('441581', '陆丰市', '440000', '广东省', '广东', '441500', '汕尾市', '441581', '陆丰市', '4', '华南');
INSERT INTO `city` VALUES ('441600', '河源市', '440000', '广东省', '广东', '441600', '河源市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441601', '市辖区', '440000', '广东省', '广东', '441600', '河源市', '441601', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441602', '源城区', '440000', '广东省', '广东', '441600', '河源市', '441602', '源城区', '4', '华南');
INSERT INTO `city` VALUES ('441621', '紫金县', '440000', '广东省', '广东', '441600', '河源市', '441621', '紫金县', '4', '华南');
INSERT INTO `city` VALUES ('441622', '龙川县', '440000', '广东省', '广东', '441600', '河源市', '441622', '龙川县', '4', '华南');
INSERT INTO `city` VALUES ('441623', '连平县', '440000', '广东省', '广东', '441600', '河源市', '441623', '连平县', '4', '华南');
INSERT INTO `city` VALUES ('441624', '和平县', '440000', '广东省', '广东', '441600', '河源市', '441624', '和平县', '4', '华南');
INSERT INTO `city` VALUES ('441625', '东源县', '440000', '广东省', '广东', '441600', '河源市', '441625', '东源县', '4', '华南');
INSERT INTO `city` VALUES ('441700', '阳江市', '440000', '广东省', '广东', '441700', '阳江市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441701', '市辖区', '440000', '广东省', '广东', '441700', '阳江市', '441701', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441702', '江城区', '440000', '广东省', '广东', '441700', '阳江市', '441702', '江城区', '4', '华南');
INSERT INTO `city` VALUES ('441721', '阳西县', '440000', '广东省', '广东', '441700', '阳江市', '441721', '阳西县', '4', '华南');
INSERT INTO `city` VALUES ('441723', '阳东县', '440000', '广东省', '广东', '441700', '阳江市', '441723', '阳东县', '4', '华南');
INSERT INTO `city` VALUES ('441781', '阳春市', '440000', '广东省', '广东', '441700', '阳江市', '441781', '阳春市', '4', '华南');
INSERT INTO `city` VALUES ('441800', '清远市', '440000', '广东省', '广东', '441800', '清远市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441801', '市辖区', '440000', '广东省', '广东', '441800', '清远市', '441801', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('441802', '清城区', '440000', '广东省', '广东', '441800', '清远市', '441802', '清城区', '4', '华南');
INSERT INTO `city` VALUES ('441803', '清新区', '440000', '广东省', '广东', '441800', '清远市', '441803', '清新区', '4', '华南');
INSERT INTO `city` VALUES ('441821', '佛冈县', '440000', '广东省', '广东', '441800', '清远市', '441821', '佛冈县', '4', '华南');
INSERT INTO `city` VALUES ('441823', '阳山县', '440000', '广东省', '广东', '441800', '清远市', '441823', '阳山县', '4', '华南');
INSERT INTO `city` VALUES ('441825', '连山壮族瑶族自治县', '440000', '广东省', '广东', '441800', '清远市', '441825', '连山壮族瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('441826', '连南瑶族自治县', '440000', '广东省', '广东', '441800', '清远市', '441826', '连南瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('441881', '英德市', '440000', '广东省', '广东', '441800', '清远市', '441881', '英德市', '4', '华南');
INSERT INTO `city` VALUES ('441882', '连州市', '440000', '广东省', '广东', '441800', '清远市', '441882', '连州市', '4', '华南');
INSERT INTO `city` VALUES ('441900', '东莞市', '440000', '广东省', '广东', '441900', '东莞市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('441901', '东城区', '440000', '广东省', '广东', '441900', '东莞市', '441901', '东城区', '4', '华南');
INSERT INTO `city` VALUES ('441902', '南城区', '440000', '广东省', '广东', '441900', '东莞市', '441902', '南城区', '4', '华南');
INSERT INTO `city` VALUES ('441903', '长安镇', '440000', '广东省', '广东', '441900', '东莞市', '441903', '长安镇', '4', '华南');
INSERT INTO `city` VALUES ('441904', '虎门镇', '440000', '广东省', '广东', '441900', '东莞市', '441904', '虎门镇', '4', '华南');
INSERT INTO `city` VALUES ('441905', '万江区', '440000', '广东省', '广东', '441900', '东莞市', '441905', '万江区', '4', '华南');
INSERT INTO `city` VALUES ('441906', '常平镇', '440000', '广东省', '广东', '441900', '东莞市', '441906', '常平镇', '4', '华南');
INSERT INTO `city` VALUES ('441907', '厚街镇', '440000', '广东省', '广东', '441900', '东莞市', '441907', '厚街镇', '4', '华南');
INSERT INTO `city` VALUES ('441908', '莞城区', '440000', '广东省', '广东', '441900', '东莞市', '441908', '莞城区', '4', '华南');
INSERT INTO `city` VALUES ('441909', '石龙镇', '440000', '广东省', '广东', '441900', '东莞市', '441909', '石龙镇', '4', '华南');
INSERT INTO `city` VALUES ('441910', '寮步镇', '440000', '广东省', '广东', '441900', '东莞市', '441910', '寮步镇', '4', '华南');
INSERT INTO `city` VALUES ('441911', '大朗镇', '440000', '广东省', '广东', '441900', '东莞市', '441911', '大朗镇', '4', '华南');
INSERT INTO `city` VALUES ('441912', '松山湖高新区', '440000', '广东省', '广东', '441900', '东莞市', '441912', '松山湖高新区', '4', '华南');
INSERT INTO `city` VALUES ('441913', '凤岗镇', '440000', '广东省', '广东', '441900', '东莞市', '441913', '凤岗镇', '4', '华南');
INSERT INTO `city` VALUES ('441914', '樟木头镇', '440000', '广东省', '广东', '441900', '东莞市', '441914', '樟木头镇', '4', '华南');
INSERT INTO `city` VALUES ('441915', '黄江镇', '440000', '广东省', '广东', '441900', '东莞市', '441915', '黄江镇', '4', '华南');
INSERT INTO `city` VALUES ('441916', '大岭山镇', '440000', '广东省', '广东', '441900', '东莞市', '441916', '大岭山镇', '4', '华南');
INSERT INTO `city` VALUES ('441917', '麻涌镇', '440000', '广东省', '广东', '441900', '东莞市', '441917', '麻涌镇', '4', '华南');
INSERT INTO `city` VALUES ('441918', '中堂镇', '440000', '广东省', '广东', '441900', '东莞市', '441918', '中堂镇', '4', '华南');
INSERT INTO `city` VALUES ('441919', '石碣镇', '440000', '广东省', '广东', '441900', '东莞市', '441919', '石碣镇', '4', '华南');
INSERT INTO `city` VALUES ('441920', '清溪镇', '440000', '广东省', '广东', '441900', '东莞市', '441920', '清溪镇', '4', '华南');
INSERT INTO `city` VALUES ('441921', '桥头镇', '440000', '广东省', '广东', '441900', '东莞市', '441921', '桥头镇', '4', '华南');
INSERT INTO `city` VALUES ('441922', '石排镇', '440000', '广东省', '广东', '441900', '东莞市', '441922', '石排镇', '4', '华南');
INSERT INTO `city` VALUES ('441923', '茶山镇', '440000', '广东省', '广东', '441900', '东莞市', '441923', '茶山镇', '4', '华南');
INSERT INTO `city` VALUES ('441924', '高埗镇', '440000', '广东省', '广东', '441900', '东莞市', '441924', '高埗镇', '4', '华南');
INSERT INTO `city` VALUES ('441925', '横沥镇', '440000', '广东省', '广东', '441900', '东莞市', '441925', '横沥镇', '4', '华南');
INSERT INTO `city` VALUES ('441926', '东坑镇', '440000', '广东省', '广东', '441900', '东莞市', '441926', '东坑镇', '4', '华南');
INSERT INTO `city` VALUES ('441927', '道滘镇', '440000', '广东省', '广东', '441900', '东莞市', '441927', '道滘镇', '4', '华南');
INSERT INTO `city` VALUES ('441928', '沙田镇', '440000', '广东省', '广东', '441900', '东莞市', '441928', '沙田镇', '4', '华南');
INSERT INTO `city` VALUES ('441929', '企石镇', '440000', '广东省', '广东', '441900', '东莞市', '441929', '企石镇', '4', '华南');
INSERT INTO `city` VALUES ('441930', '望牛墩镇', '440000', '广东省', '广东', '441900', '东莞市', '441930', '望牛墩镇', '4', '华南');
INSERT INTO `city` VALUES ('441931', '洪梅镇', '440000', '广东省', '广东', '441900', '东莞市', '441931', '洪梅镇', '4', '华南');
INSERT INTO `city` VALUES ('441932', '谢岗镇', '440000', '广东省', '广东', '441900', '东莞市', '441932', '谢岗镇', '4', '华南');
INSERT INTO `city` VALUES ('442000', '中山市', '440000', '广东省', '广东', '442000', '中山市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('442001', '东区街道', '440000', '广东省', '广东', '442000', '中山市', '442001', '东区街道', '4', '华南');
INSERT INTO `city` VALUES ('442002', '石岐街道', '440000', '广东省', '广东', '442000', '中山市', '442002', '石岐街道', '4', '华南');
INSERT INTO `city` VALUES ('442003', '西区街道', '440000', '广东省', '广东', '442000', '中山市', '442003', '西区街道', '4', '华南');
INSERT INTO `city` VALUES ('442004', '小榄镇', '440000', '广东省', '广东', '442000', '中山市', '442004', '小榄镇', '4', '华南');
INSERT INTO `city` VALUES ('442005', '南区街道', '440000', '广东省', '广东', '442000', '中山市', '442005', '南区街道', '4', '华南');
INSERT INTO `city` VALUES ('442006', '沙溪镇', '440000', '广东省', '广东', '442000', '中山市', '442006', '沙溪镇', '4', '华南');
INSERT INTO `city` VALUES ('442007', '火炬高技术开发区', '440000', '广东省', '广东', '442000', '中山市', '442007', '火炬高技术开发区', '4', '华南');
INSERT INTO `city` VALUES ('442008', '三乡镇', '440000', '广东省', '广东', '442000', '中山市', '442008', '三乡镇', '4', '华南');
INSERT INTO `city` VALUES ('442009', '古镇镇', '440000', '广东省', '广东', '442000', '中山市', '442009', '古镇镇', '4', '华南');
INSERT INTO `city` VALUES ('442010', '坦洲镇', '440000', '广东省', '广东', '442000', '中山市', '442010', '坦洲镇', '4', '华南');
INSERT INTO `city` VALUES ('442011', '东升镇', '440000', '广东省', '广东', '442000', '中山市', '442011', '东升镇', '4', '华南');
INSERT INTO `city` VALUES ('442012', '五桂山街道', '440000', '广东省', '广东', '442000', '中山市', '442012', '五桂山街道', '4', '华南');
INSERT INTO `city` VALUES ('442013', '东凤镇', '440000', '广东省', '广东', '442000', '中山市', '442013', '东凤镇', '4', '华南');
INSERT INTO `city` VALUES ('442014', '港口镇', '440000', '广东省', '广东', '442000', '中山市', '442014', '港口镇', '4', '华南');
INSERT INTO `city` VALUES ('442015', '黄圃镇', '440000', '广东省', '广东', '442000', '中山市', '442015', '黄圃镇', '4', '华南');
INSERT INTO `city` VALUES ('442016', '三角镇', '440000', '广东省', '广东', '442000', '中山市', '442016', '三角镇', '4', '华南');
INSERT INTO `city` VALUES ('442017', '大涌镇', '440000', '广东省', '广东', '442000', '中山市', '442017', '大涌镇', '4', '华南');
INSERT INTO `city` VALUES ('442018', '南头镇', '440000', '广东省', '广东', '442000', '中山市', '442018', '南头镇', '4', '华南');
INSERT INTO `city` VALUES ('442019', '民众镇', '440000', '广东省', '广东', '442000', '中山市', '442019', '民众镇', '4', '华南');
INSERT INTO `city` VALUES ('442020', '板芙镇', '440000', '广东省', '广东', '442000', '中山市', '442020', '板芙镇', '4', '华南');
INSERT INTO `city` VALUES ('442021', '横栏镇', '440000', '广东省', '广东', '442000', '中山市', '442021', '横栏镇', '4', '华南');
INSERT INTO `city` VALUES ('442022', '阜沙镇', '440000', '广东省', '广东', '442000', '中山市', '442022', '阜沙镇', '4', '华南');
INSERT INTO `city` VALUES ('445100', '潮州市', '440000', '广东省', '广东', '445100', '潮州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('445101', '市辖区', '440000', '广东省', '广东', '445100', '潮州市', '445101', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('445102', '湘桥区', '440000', '广东省', '广东', '445100', '潮州市', '445102', '湘桥区', '4', '华南');
INSERT INTO `city` VALUES ('445103', '潮安区', '440000', '广东省', '广东', '445100', '潮州市', '445103', '潮安区', '4', '华南');
INSERT INTO `city` VALUES ('445122', '饶平县', '440000', '广东省', '广东', '445100', '潮州市', '445122', '饶平县', '4', '华南');
INSERT INTO `city` VALUES ('445200', '揭阳市', '440000', '广东省', '广东', '445200', '揭阳市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('445201', '市辖区', '440000', '广东省', '广东', '445200', '揭阳市', '445201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('445202', '榕城区', '440000', '广东省', '广东', '445200', '揭阳市', '445202', '榕城区', '4', '华南');
INSERT INTO `city` VALUES ('445203', '揭东区', '440000', '广东省', '广东', '445200', '揭阳市', '445203', '揭东区', '4', '华南');
INSERT INTO `city` VALUES ('445222', '揭西县', '440000', '广东省', '广东', '445200', '揭阳市', '445222', '揭西县', '4', '华南');
INSERT INTO `city` VALUES ('445224', '惠来县', '440000', '广东省', '广东', '445200', '揭阳市', '445224', '惠来县', '4', '华南');
INSERT INTO `city` VALUES ('445281', '普宁市', '440000', '广东省', '广东', '445200', '揭阳市', '445281', '普宁市', '4', '华南');
INSERT INTO `city` VALUES ('445300', '云浮市', '440000', '广东省', '广东', '445300', '云浮市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('445301', '市辖区', '440000', '广东省', '广东', '445300', '云浮市', '445301', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('445302', '云城区', '440000', '广东省', '广东', '445300', '云浮市', '445302', '云城区', '4', '华南');
INSERT INTO `city` VALUES ('445321', '新兴县', '440000', '广东省', '广东', '445300', '云浮市', '445321', '新兴县', '4', '华南');
INSERT INTO `city` VALUES ('445322', '郁南县', '440000', '广东省', '广东', '445300', '云浮市', '445322', '郁南县', '4', '华南');
INSERT INTO `city` VALUES ('445323', '云安县', '440000', '广东省', '广东', '445300', '云浮市', '445323', '云安县', '4', '华南');
INSERT INTO `city` VALUES ('445381', '罗定市', '440000', '广东省', '广东', '445300', '云浮市', '445381', '罗定市', '4', '华南');
INSERT INTO `city` VALUES ('450000', '广西壮族自治区', '450000', '广西壮族自治区', '广西', '0', '', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450100', '南宁市', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450101', '市辖区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450101', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450102', '兴宁区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450102', '兴宁区', '4', '华南');
INSERT INTO `city` VALUES ('450103', '青秀区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450103', '青秀区', '4', '华南');
INSERT INTO `city` VALUES ('450105', '江南区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450105', '江南区', '4', '华南');
INSERT INTO `city` VALUES ('450107', '西乡塘区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450107', '西乡塘区', '4', '华南');
INSERT INTO `city` VALUES ('450108', '良庆区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450108', '良庆区', '4', '华南');
INSERT INTO `city` VALUES ('450109', '邕宁区', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450109', '邕宁区', '4', '华南');
INSERT INTO `city` VALUES ('450122', '武鸣县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450122', '武鸣县', '4', '华南');
INSERT INTO `city` VALUES ('450123', '隆安县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450123', '隆安县', '4', '华南');
INSERT INTO `city` VALUES ('450124', '马山县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450124', '马山县', '4', '华南');
INSERT INTO `city` VALUES ('450125', '上林县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450125', '上林县', '4', '华南');
INSERT INTO `city` VALUES ('450126', '宾阳县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450126', '宾阳县', '4', '华南');
INSERT INTO `city` VALUES ('450127', '横县', '450000', '广西壮族自治区', '广西', '450100', '南宁市', '450127', '横县', '4', '华南');
INSERT INTO `city` VALUES ('450200', '柳州市', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450201', '市辖区', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450202', '城中区', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450202', '城中区', '4', '华南');
INSERT INTO `city` VALUES ('450203', '鱼峰区', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450203', '鱼峰区', '4', '华南');
INSERT INTO `city` VALUES ('450204', '柳南区', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450204', '柳南区', '4', '华南');
INSERT INTO `city` VALUES ('450205', '柳北区', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450205', '柳北区', '4', '华南');
INSERT INTO `city` VALUES ('450221', '柳江县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450221', '柳江县', '4', '华南');
INSERT INTO `city` VALUES ('450222', '柳城县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450222', '柳城县', '4', '华南');
INSERT INTO `city` VALUES ('450223', '鹿寨县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450223', '鹿寨县', '4', '华南');
INSERT INTO `city` VALUES ('450224', '融安县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450224', '融安县', '4', '华南');
INSERT INTO `city` VALUES ('450225', '融水苗族自治县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450225', '融水苗族自治县', '4', '华南');
INSERT INTO `city` VALUES ('450226', '三江侗族自治县', '450000', '广西壮族自治区', '广西', '450200', '柳州市', '450226', '三江侗族自治县', '4', '华南');
INSERT INTO `city` VALUES ('450300', '桂林市', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450301', '市辖区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450301', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450302', '秀峰区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450302', '秀峰区', '4', '华南');
INSERT INTO `city` VALUES ('450303', '叠彩区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450303', '叠彩区', '4', '华南');
INSERT INTO `city` VALUES ('450304', '象山区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450304', '象山区', '4', '华南');
INSERT INTO `city` VALUES ('450305', '七星区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450305', '七星区', '4', '华南');
INSERT INTO `city` VALUES ('450311', '雁山区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450311', '雁山区', '4', '华南');
INSERT INTO `city` VALUES ('450312', '临桂区', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450312', '临桂区', '4', '华南');
INSERT INTO `city` VALUES ('450321', '阳朔县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450321', '阳朔县', '4', '华南');
INSERT INTO `city` VALUES ('450323', '灵川县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450323', '灵川县', '4', '华南');
INSERT INTO `city` VALUES ('450324', '全州县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450324', '全州县', '4', '华南');
INSERT INTO `city` VALUES ('450325', '兴安县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450325', '兴安县', '4', '华南');
INSERT INTO `city` VALUES ('450326', '永福县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450326', '永福县', '4', '华南');
INSERT INTO `city` VALUES ('450327', '灌阳县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450327', '灌阳县', '4', '华南');
INSERT INTO `city` VALUES ('450328', '龙胜各族自治县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450328', '龙胜各族自治县', '4', '华南');
INSERT INTO `city` VALUES ('450329', '资源县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450329', '资源县', '4', '华南');
INSERT INTO `city` VALUES ('450330', '平乐县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450330', '平乐县', '4', '华南');
INSERT INTO `city` VALUES ('450331', '荔浦县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450331', '荔浦县', '4', '华南');
INSERT INTO `city` VALUES ('450332', '恭城瑶族自治县', '450000', '广西壮族自治区', '广西', '450300', '桂林市', '450332', '恭城瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('450400', '梧州市', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450401', '市辖区', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450401', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450403', '万秀区', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450403', '万秀区', '4', '华南');
INSERT INTO `city` VALUES ('450405', '长洲区', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450405', '长洲区', '4', '华南');
INSERT INTO `city` VALUES ('450406', '龙圩区', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450406', '龙圩区', '4', '华南');
INSERT INTO `city` VALUES ('450421', '苍梧县', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450421', '苍梧县', '4', '华南');
INSERT INTO `city` VALUES ('450422', '藤县', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450422', '藤县', '4', '华南');
INSERT INTO `city` VALUES ('450423', '蒙山县', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450423', '蒙山县', '4', '华南');
INSERT INTO `city` VALUES ('450481', '岑溪市', '450000', '广西壮族自治区', '广西', '450400', '梧州市', '450481', '岑溪市', '4', '华南');
INSERT INTO `city` VALUES ('450500', '北海市', '450000', '广西壮族自治区', '广西', '450500', '北海市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450501', '市辖区', '450000', '广西壮族自治区', '广西', '450500', '北海市', '450501', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450502', '海城区', '450000', '广西壮族自治区', '广西', '450500', '北海市', '450502', '海城区', '4', '华南');
INSERT INTO `city` VALUES ('450503', '银海区', '450000', '广西壮族自治区', '广西', '450500', '北海市', '450503', '银海区', '4', '华南');
INSERT INTO `city` VALUES ('450512', '铁山港区', '450000', '广西壮族自治区', '广西', '450500', '北海市', '450512', '铁山港区', '4', '华南');
INSERT INTO `city` VALUES ('450521', '合浦县', '450000', '广西壮族自治区', '广西', '450500', '北海市', '450521', '合浦县', '4', '华南');
INSERT INTO `city` VALUES ('450600', '防城港市', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450601', '市辖区', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '450601', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450602', '港口区', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '450602', '港口区', '4', '华南');
INSERT INTO `city` VALUES ('450603', '防城区', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '450603', '防城区', '4', '华南');
INSERT INTO `city` VALUES ('450621', '上思县', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '450621', '上思县', '4', '华南');
INSERT INTO `city` VALUES ('450681', '东兴市', '450000', '广西壮族自治区', '广西', '450600', '防城港市', '450681', '东兴市', '4', '华南');
INSERT INTO `city` VALUES ('450700', '钦州市', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450701', '市辖区', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '450701', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450702', '钦南区', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '450702', '钦南区', '4', '华南');
INSERT INTO `city` VALUES ('450703', '钦北区', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '450703', '钦北区', '4', '华南');
INSERT INTO `city` VALUES ('450721', '灵山县', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '450721', '灵山县', '4', '华南');
INSERT INTO `city` VALUES ('450722', '浦北县', '450000', '广西壮族自治区', '广西', '450700', '钦州市', '450722', '浦北县', '4', '华南');
INSERT INTO `city` VALUES ('450800', '贵港市', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450801', '市辖区', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450801', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450802', '港北区', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450802', '港北区', '4', '华南');
INSERT INTO `city` VALUES ('450803', '港南区', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450803', '港南区', '4', '华南');
INSERT INTO `city` VALUES ('450804', '覃塘区', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450804', '覃塘区', '4', '华南');
INSERT INTO `city` VALUES ('450821', '平南县', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450821', '平南县', '4', '华南');
INSERT INTO `city` VALUES ('450881', '桂平市', '450000', '广西壮族自治区', '广西', '450800', '贵港市', '450881', '桂平市', '4', '华南');
INSERT INTO `city` VALUES ('450900', '玉林市', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('450901', '市辖区', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450901', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('450902', '玉州区', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450902', '玉州区', '4', '华南');
INSERT INTO `city` VALUES ('450903', '福绵区', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450903', '福绵区', '4', '华南');
INSERT INTO `city` VALUES ('450921', '容县', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450921', '容县', '4', '华南');
INSERT INTO `city` VALUES ('450922', '陆川县', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450922', '陆川县', '4', '华南');
INSERT INTO `city` VALUES ('450923', '博白县', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450923', '博白县', '4', '华南');
INSERT INTO `city` VALUES ('450924', '兴业县', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450924', '兴业县', '4', '华南');
INSERT INTO `city` VALUES ('450981', '北流市', '450000', '广西壮族自治区', '广西', '450900', '玉林市', '450981', '北流市', '4', '华南');
INSERT INTO `city` VALUES ('451000', '百色市', '450000', '广西壮族自治区', '广西', '451000', '百色市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('451001', '市辖区', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451001', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('451002', '右江区', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451002', '右江区', '4', '华南');
INSERT INTO `city` VALUES ('451021', '田阳县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451021', '田阳县', '4', '华南');
INSERT INTO `city` VALUES ('451022', '田东县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451022', '田东县', '4', '华南');
INSERT INTO `city` VALUES ('451023', '平果县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451023', '平果县', '4', '华南');
INSERT INTO `city` VALUES ('451024', '德保县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451024', '德保县', '4', '华南');
INSERT INTO `city` VALUES ('451025', '靖西县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451025', '靖西县', '4', '华南');
INSERT INTO `city` VALUES ('451026', '那坡县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451026', '那坡县', '4', '华南');
INSERT INTO `city` VALUES ('451027', '凌云县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451027', '凌云县', '4', '华南');
INSERT INTO `city` VALUES ('451028', '乐业县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451028', '乐业县', '4', '华南');
INSERT INTO `city` VALUES ('451029', '田林县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451029', '田林县', '4', '华南');
INSERT INTO `city` VALUES ('451030', '西林县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451030', '西林县', '4', '华南');
INSERT INTO `city` VALUES ('451031', '隆林各族自治县', '450000', '广西壮族自治区', '广西', '451000', '百色市', '451031', '隆林各族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451100', '贺州市', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('451101', '市辖区', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '451101', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('451102', '八步区', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '451102', '八步区', '4', '华南');
INSERT INTO `city` VALUES ('451121', '昭平县', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '451121', '昭平县', '4', '华南');
INSERT INTO `city` VALUES ('451122', '钟山县', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '451122', '钟山县', '4', '华南');
INSERT INTO `city` VALUES ('451123', '富川瑶族自治县', '450000', '广西壮族自治区', '广西', '451100', '贺州市', '451123', '富川瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451200', '河池市', '450000', '广西壮族自治区', '广西', '451200', '河池市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('451201', '市辖区', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('451202', '金城江区', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451202', '金城江区', '4', '华南');
INSERT INTO `city` VALUES ('451221', '南丹县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451221', '南丹县', '4', '华南');
INSERT INTO `city` VALUES ('451222', '天峨县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451222', '天峨县', '4', '华南');
INSERT INTO `city` VALUES ('451223', '凤山县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451223', '凤山县', '4', '华南');
INSERT INTO `city` VALUES ('451224', '东兰县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451224', '东兰县', '4', '华南');
INSERT INTO `city` VALUES ('451225', '罗城仫佬族自治县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451225', '罗城仫佬族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451226', '环江毛南族自治县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451226', '环江毛南族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451227', '巴马瑶族自治县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451227', '巴马瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451228', '都安瑶族自治县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451228', '都安瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451229', '大化瑶族自治县', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451229', '大化瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451281', '宜州市', '450000', '广西壮族自治区', '广西', '451200', '河池市', '451281', '宜州市', '4', '华南');
INSERT INTO `city` VALUES ('451300', '来宾市', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('451301', '市辖区', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451301', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('451302', '兴宾区', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451302', '兴宾区', '4', '华南');
INSERT INTO `city` VALUES ('451321', '忻城县', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451321', '忻城县', '4', '华南');
INSERT INTO `city` VALUES ('451322', '象州县', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451322', '象州县', '4', '华南');
INSERT INTO `city` VALUES ('451323', '武宣县', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451323', '武宣县', '4', '华南');
INSERT INTO `city` VALUES ('451324', '金秀瑶族自治县', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451324', '金秀瑶族自治县', '4', '华南');
INSERT INTO `city` VALUES ('451381', '合山市', '450000', '广西壮族自治区', '广西', '451300', '来宾市', '451381', '合山市', '4', '华南');
INSERT INTO `city` VALUES ('451400', '崇左市', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('451401', '市辖区', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451401', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('451402', '江州区', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451402', '江州区', '4', '华南');
INSERT INTO `city` VALUES ('451421', '扶绥县', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451421', '扶绥县', '4', '华南');
INSERT INTO `city` VALUES ('451422', '宁明县', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451422', '宁明县', '4', '华南');
INSERT INTO `city` VALUES ('451423', '龙州县', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451423', '龙州县', '4', '华南');
INSERT INTO `city` VALUES ('451424', '大新县', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451424', '大新县', '4', '华南');
INSERT INTO `city` VALUES ('451425', '天等县', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451425', '天等县', '4', '华南');
INSERT INTO `city` VALUES ('451481', '凭祥市', '450000', '广西壮族自治区', '广西', '451400', '崇左市', '451481', '凭祥市', '4', '华南');
INSERT INTO `city` VALUES ('460000', '海南省', '460000', '海南省', '海南', '0', '', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('460100', '海口市', '460000', '海南省', '海南', '460100', '海口市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('460101', '市辖区', '460000', '海南省', '海南', '460100', '海口市', '460101', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('460105', '秀英区', '460000', '海南省', '海南', '460100', '海口市', '460105', '秀英区', '4', '华南');
INSERT INTO `city` VALUES ('460106', '龙华区', '460000', '海南省', '海南', '460100', '海口市', '460106', '龙华区', '4', '华南');
INSERT INTO `city` VALUES ('460107', '琼山区', '460000', '海南省', '海南', '460100', '海口市', '460107', '琼山区', '4', '华南');
INSERT INTO `city` VALUES ('460108', '美兰区', '460000', '海南省', '海南', '460100', '海口市', '460108', '美兰区', '4', '华南');
INSERT INTO `city` VALUES ('460200', '三亚市', '460000', '海南省', '海南', '460200', '三亚市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('460201', '市辖区', '460000', '海南省', '海南', '460200', '三亚市', '460201', '市辖区', '4', '华南');
INSERT INTO `city` VALUES ('460300', '三沙市', '460000', '海南省', '海南', '460300', '三沙市', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('460321', '西沙群岛', '460000', '海南省', '海南', '460300', '三沙市', '460321', '西沙群岛', '4', '华南');
INSERT INTO `city` VALUES ('460322', '南沙群岛', '460000', '海南省', '海南', '460300', '三沙市', '460322', '南沙群岛', '4', '华南');
INSERT INTO `city` VALUES ('460323', '中沙群岛的岛礁及其海域', '460000', '海南省', '海南', '460300', '三沙市', '460323', '中沙群岛的岛礁及其海域', '4', '华南');
INSERT INTO `city` VALUES ('469000', '省直辖县级行政区划', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '0', '', '4', '华南');
INSERT INTO `city` VALUES ('469001', '五指山市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469001', '五指山市', '4', '华南');
INSERT INTO `city` VALUES ('469002', '琼海市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469002', '琼海市', '4', '华南');
INSERT INTO `city` VALUES ('469003', '儋州市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469003', '儋州市', '4', '华南');
INSERT INTO `city` VALUES ('469005', '文昌市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469005', '文昌市', '4', '华南');
INSERT INTO `city` VALUES ('469006', '万宁市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469006', '万宁市', '4', '华南');
INSERT INTO `city` VALUES ('469007', '东方市', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469007', '东方市', '4', '华南');
INSERT INTO `city` VALUES ('469021', '定安县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469021', '定安县', '4', '华南');
INSERT INTO `city` VALUES ('469022', '屯昌县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469022', '屯昌县', '4', '华南');
INSERT INTO `city` VALUES ('469023', '澄迈县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469023', '澄迈县', '4', '华南');
INSERT INTO `city` VALUES ('469024', '临高县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469024', '临高县', '4', '华南');
INSERT INTO `city` VALUES ('469025', '白沙黎族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469025', '白沙黎族自治县', '4', '华南');
INSERT INTO `city` VALUES ('469026', '昌江黎族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469026', '昌江黎族自治县', '4', '华南');
INSERT INTO `city` VALUES ('469027', '乐东黎族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469027', '乐东黎族自治县', '4', '华南');
INSERT INTO `city` VALUES ('469028', '陵水黎族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469028', '陵水黎族自治县', '4', '华南');
INSERT INTO `city` VALUES ('469029', '保亭黎族苗族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469029', '保亭黎族苗族自治县', '4', '华南');
INSERT INTO `city` VALUES ('469030', '琼中黎族苗族自治县', '460000', '海南省', '海南', '469000', '省直辖县级行政区划', '469030', '琼中黎族苗族自治县', '4', '华南');
INSERT INTO `city` VALUES ('500000', '重庆市', '500000', '重庆市', '重庆', '0', '', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500101', '万州区', '500000', '重庆市', '重庆', '500101', '万州区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500102', '涪陵区', '500000', '重庆市', '重庆', '500102', '涪陵区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500103', '渝中区', '500000', '重庆市', '重庆', '500103', '渝中区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500104', '大渡口区', '500000', '重庆市', '重庆', '500104', '大渡口区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500105', '江北区', '500000', '重庆市', '重庆', '500105', '江北区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500106', '沙坪坝区', '500000', '重庆市', '重庆', '500106', '沙坪坝区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500107', '九龙坡区', '500000', '重庆市', '重庆', '500107', '九龙坡区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500108', '南岸区', '500000', '重庆市', '重庆', '500108', '南岸区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500109', '北碚区', '500000', '重庆市', '重庆', '500109', '北碚区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500110', '綦江区', '500000', '重庆市', '重庆', '500110', '綦江区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500111', '大足区', '500000', '重庆市', '重庆', '500111', '大足区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500112', '渝北区', '500000', '重庆市', '重庆', '500112', '渝北区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500113', '巴南区', '500000', '重庆市', '重庆', '500113', '巴南区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500114', '黔江区', '500000', '重庆市', '重庆', '500114', '黔江区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500115', '长寿区', '500000', '重庆市', '重庆', '500115', '长寿区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500116', '江津区', '500000', '重庆市', '重庆', '500116', '江津区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500117', '合川区', '500000', '重庆市', '重庆', '500117', '合川区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500118', '永川区', '500000', '重庆市', '重庆', '500118', '永川区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500119', '南川区', '500000', '重庆市', '重庆', '500119', '南川区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500223', '潼南县', '500000', '重庆市', '重庆', '500223', '潼南县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500224', '铜梁县', '500000', '重庆市', '重庆', '500224', '铜梁县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500226', '荣昌县', '500000', '重庆市', '重庆', '500226', '荣昌县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500227', '璧山县', '500000', '重庆市', '重庆', '500227', '璧山县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500228', '梁平县', '500000', '重庆市', '重庆', '500228', '梁平县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500229', '城口县', '500000', '重庆市', '重庆', '500229', '城口县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500230', '丰都县', '500000', '重庆市', '重庆', '500230', '丰都县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500231', '垫江县', '500000', '重庆市', '重庆', '500231', '垫江县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500232', '武隆县', '500000', '重庆市', '重庆', '500232', '武隆县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500233', '忠县', '500000', '重庆市', '重庆', '500233', '忠县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500234', '开县', '500000', '重庆市', '重庆', '500234', '开县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500235', '云阳县', '500000', '重庆市', '重庆', '500235', '云阳县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500236', '奉节县', '500000', '重庆市', '重庆', '500236', '奉节县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500237', '巫山县', '500000', '重庆市', '重庆', '500237', '巫山县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500238', '巫溪县', '500000', '重庆市', '重庆', '500238', '巫溪县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500240', '石柱土家族自治县', '500000', '重庆市', '重庆', '500240', '石柱土家族自治县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500241', '秀山土家族苗族自治县', '500000', '重庆市', '重庆', '500241', '秀山土家族苗族自治县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500242', '酉阳土家族苗族自治县', '500000', '重庆市', '重庆', '500242', '酉阳土家族苗族自治县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('500243', '彭水苗族土家族自治县', '500000', '重庆市', '重庆', '500243', '彭水苗族土家族自治县', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510000', '四川省', '510000', '四川省', '四川', '0', '', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510100', '成都市', '510000', '四川省', '四川', '510100', '成都市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510101', '市辖区', '510000', '四川省', '四川', '510100', '成都市', '510101', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510104', '锦江区', '510000', '四川省', '四川', '510100', '成都市', '510104', '锦江区', '6', '西南');
INSERT INTO `city` VALUES ('510105', '青羊区', '510000', '四川省', '四川', '510100', '成都市', '510105', '青羊区', '6', '西南');
INSERT INTO `city` VALUES ('510106', '金牛区', '510000', '四川省', '四川', '510100', '成都市', '510106', '金牛区', '6', '西南');
INSERT INTO `city` VALUES ('510107', '武侯区', '510000', '四川省', '四川', '510100', '成都市', '510107', '武侯区', '6', '西南');
INSERT INTO `city` VALUES ('510108', '成华区', '510000', '四川省', '四川', '510100', '成都市', '510108', '成华区', '6', '西南');
INSERT INTO `city` VALUES ('510112', '龙泉驿区', '510000', '四川省', '四川', '510100', '成都市', '510112', '龙泉驿区', '6', '西南');
INSERT INTO `city` VALUES ('510113', '青白江区', '510000', '四川省', '四川', '510100', '成都市', '510113', '青白江区', '6', '西南');
INSERT INTO `city` VALUES ('510114', '新都区', '510000', '四川省', '四川', '510100', '成都市', '510114', '新都区', '6', '西南');
INSERT INTO `city` VALUES ('510115', '温江区', '510000', '四川省', '四川', '510100', '成都市', '510115', '温江区', '6', '西南');
INSERT INTO `city` VALUES ('510121', '金堂县', '510000', '四川省', '四川', '510100', '成都市', '510121', '金堂县', '6', '西南');
INSERT INTO `city` VALUES ('510122', '双流县', '510000', '四川省', '四川', '510100', '成都市', '510122', '双流县', '6', '西南');
INSERT INTO `city` VALUES ('510124', '郫县', '510000', '四川省', '四川', '510100', '成都市', '510124', '郫县', '6', '西南');
INSERT INTO `city` VALUES ('510129', '大邑县', '510000', '四川省', '四川', '510100', '成都市', '510129', '大邑县', '6', '西南');
INSERT INTO `city` VALUES ('510131', '蒲江县', '510000', '四川省', '四川', '510100', '成都市', '510131', '蒲江县', '6', '西南');
INSERT INTO `city` VALUES ('510132', '新津县', '510000', '四川省', '四川', '510100', '成都市', '510132', '新津县', '6', '西南');
INSERT INTO `city` VALUES ('510181', '都江堰市', '510000', '四川省', '四川', '510100', '成都市', '510181', '都江堰市', '6', '西南');
INSERT INTO `city` VALUES ('510182', '彭州市', '510000', '四川省', '四川', '510100', '成都市', '510182', '彭州市', '6', '西南');
INSERT INTO `city` VALUES ('510183', '邛崃市', '510000', '四川省', '四川', '510100', '成都市', '510183', '邛崃市', '6', '西南');
INSERT INTO `city` VALUES ('510184', '崇州市', '510000', '四川省', '四川', '510100', '成都市', '510184', '崇州市', '6', '西南');
INSERT INTO `city` VALUES ('510300', '自贡市', '510000', '四川省', '四川', '510300', '自贡市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510301', '市辖区', '510000', '四川省', '四川', '510300', '自贡市', '510301', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510302', '自流井区', '510000', '四川省', '四川', '510300', '自贡市', '510302', '自流井区', '6', '西南');
INSERT INTO `city` VALUES ('510303', '贡井区', '510000', '四川省', '四川', '510300', '自贡市', '510303', '贡井区', '6', '西南');
INSERT INTO `city` VALUES ('510304', '大安区', '510000', '四川省', '四川', '510300', '自贡市', '510304', '大安区', '6', '西南');
INSERT INTO `city` VALUES ('510311', '沿滩区', '510000', '四川省', '四川', '510300', '自贡市', '510311', '沿滩区', '6', '西南');
INSERT INTO `city` VALUES ('510321', '荣县', '510000', '四川省', '四川', '510300', '自贡市', '510321', '荣县', '6', '西南');
INSERT INTO `city` VALUES ('510322', '富顺县', '510000', '四川省', '四川', '510300', '自贡市', '510322', '富顺县', '6', '西南');
INSERT INTO `city` VALUES ('510400', '攀枝花市', '510000', '四川省', '四川', '510400', '攀枝花市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510401', '市辖区', '510000', '四川省', '四川', '510400', '攀枝花市', '510401', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510402', '东区', '510000', '四川省', '四川', '510400', '攀枝花市', '510402', '东区', '6', '西南');
INSERT INTO `city` VALUES ('510403', '西区', '510000', '四川省', '四川', '510400', '攀枝花市', '510403', '西区', '6', '西南');
INSERT INTO `city` VALUES ('510411', '仁和区', '510000', '四川省', '四川', '510400', '攀枝花市', '510411', '仁和区', '6', '西南');
INSERT INTO `city` VALUES ('510421', '米易县', '510000', '四川省', '四川', '510400', '攀枝花市', '510421', '米易县', '6', '西南');
INSERT INTO `city` VALUES ('510422', '盐边县', '510000', '四川省', '四川', '510400', '攀枝花市', '510422', '盐边县', '6', '西南');
INSERT INTO `city` VALUES ('510500', '泸州市', '510000', '四川省', '四川', '510500', '泸州市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510501', '市辖区', '510000', '四川省', '四川', '510500', '泸州市', '510501', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510502', '江阳区', '510000', '四川省', '四川', '510500', '泸州市', '510502', '江阳区', '6', '西南');
INSERT INTO `city` VALUES ('510503', '纳溪区', '510000', '四川省', '四川', '510500', '泸州市', '510503', '纳溪区', '6', '西南');
INSERT INTO `city` VALUES ('510504', '龙马潭区', '510000', '四川省', '四川', '510500', '泸州市', '510504', '龙马潭区', '6', '西南');
INSERT INTO `city` VALUES ('510521', '泸县', '510000', '四川省', '四川', '510500', '泸州市', '510521', '泸县', '6', '西南');
INSERT INTO `city` VALUES ('510522', '合江县', '510000', '四川省', '四川', '510500', '泸州市', '510522', '合江县', '6', '西南');
INSERT INTO `city` VALUES ('510524', '叙永县', '510000', '四川省', '四川', '510500', '泸州市', '510524', '叙永县', '6', '西南');
INSERT INTO `city` VALUES ('510525', '古蔺县', '510000', '四川省', '四川', '510500', '泸州市', '510525', '古蔺县', '6', '西南');
INSERT INTO `city` VALUES ('510600', '德阳市', '510000', '四川省', '四川', '510600', '德阳市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510601', '市辖区', '510000', '四川省', '四川', '510600', '德阳市', '510601', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510603', '旌阳区', '510000', '四川省', '四川', '510600', '德阳市', '510603', '旌阳区', '6', '西南');
INSERT INTO `city` VALUES ('510623', '中江县', '510000', '四川省', '四川', '510600', '德阳市', '510623', '中江县', '6', '西南');
INSERT INTO `city` VALUES ('510626', '罗江县', '510000', '四川省', '四川', '510600', '德阳市', '510626', '罗江县', '6', '西南');
INSERT INTO `city` VALUES ('510681', '广汉市', '510000', '四川省', '四川', '510600', '德阳市', '510681', '广汉市', '6', '西南');
INSERT INTO `city` VALUES ('510682', '什邡市', '510000', '四川省', '四川', '510600', '德阳市', '510682', '什邡市', '6', '西南');
INSERT INTO `city` VALUES ('510683', '绵竹市', '510000', '四川省', '四川', '510600', '德阳市', '510683', '绵竹市', '6', '西南');
INSERT INTO `city` VALUES ('510700', '绵阳市', '510000', '四川省', '四川', '510700', '绵阳市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510701', '市辖区', '510000', '四川省', '四川', '510700', '绵阳市', '510701', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510703', '涪城区', '510000', '四川省', '四川', '510700', '绵阳市', '510703', '涪城区', '6', '西南');
INSERT INTO `city` VALUES ('510704', '游仙区', '510000', '四川省', '四川', '510700', '绵阳市', '510704', '游仙区', '6', '西南');
INSERT INTO `city` VALUES ('510722', '三台县', '510000', '四川省', '四川', '510700', '绵阳市', '510722', '三台县', '6', '西南');
INSERT INTO `city` VALUES ('510723', '盐亭县', '510000', '四川省', '四川', '510700', '绵阳市', '510723', '盐亭县', '6', '西南');
INSERT INTO `city` VALUES ('510724', '安县', '510000', '四川省', '四川', '510700', '绵阳市', '510724', '安县', '6', '西南');
INSERT INTO `city` VALUES ('510725', '梓潼县', '510000', '四川省', '四川', '510700', '绵阳市', '510725', '梓潼县', '6', '西南');
INSERT INTO `city` VALUES ('510726', '北川羌族自治县', '510000', '四川省', '四川', '510700', '绵阳市', '510726', '北川羌族自治县', '6', '西南');
INSERT INTO `city` VALUES ('510727', '平武县', '510000', '四川省', '四川', '510700', '绵阳市', '510727', '平武县', '6', '西南');
INSERT INTO `city` VALUES ('510781', '江油市', '510000', '四川省', '四川', '510700', '绵阳市', '510781', '江油市', '6', '西南');
INSERT INTO `city` VALUES ('510800', '广元市', '510000', '四川省', '四川', '510800', '广元市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510801', '市辖区', '510000', '四川省', '四川', '510800', '广元市', '510801', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510802', '利州区', '510000', '四川省', '四川', '510800', '广元市', '510802', '利州区', '6', '西南');
INSERT INTO `city` VALUES ('510811', '元坝区', '510000', '四川省', '四川', '510800', '广元市', '510811', '元坝区', '6', '西南');
INSERT INTO `city` VALUES ('510812', '朝天区', '510000', '四川省', '四川', '510800', '广元市', '510812', '朝天区', '6', '西南');
INSERT INTO `city` VALUES ('510821', '旺苍县', '510000', '四川省', '四川', '510800', '广元市', '510821', '旺苍县', '6', '西南');
INSERT INTO `city` VALUES ('510822', '青川县', '510000', '四川省', '四川', '510800', '广元市', '510822', '青川县', '6', '西南');
INSERT INTO `city` VALUES ('510823', '剑阁县', '510000', '四川省', '四川', '510800', '广元市', '510823', '剑阁县', '6', '西南');
INSERT INTO `city` VALUES ('510824', '苍溪县', '510000', '四川省', '四川', '510800', '广元市', '510824', '苍溪县', '6', '西南');
INSERT INTO `city` VALUES ('510900', '遂宁市', '510000', '四川省', '四川', '510900', '遂宁市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('510901', '市辖区', '510000', '四川省', '四川', '510900', '遂宁市', '510901', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('510903', '船山区', '510000', '四川省', '四川', '510900', '遂宁市', '510903', '船山区', '6', '西南');
INSERT INTO `city` VALUES ('510904', '安居区', '510000', '四川省', '四川', '510900', '遂宁市', '510904', '安居区', '6', '西南');
INSERT INTO `city` VALUES ('510921', '蓬溪县', '510000', '四川省', '四川', '510900', '遂宁市', '510921', '蓬溪县', '6', '西南');
INSERT INTO `city` VALUES ('510922', '射洪县', '510000', '四川省', '四川', '510900', '遂宁市', '510922', '射洪县', '6', '西南');
INSERT INTO `city` VALUES ('510923', '大英县', '510000', '四川省', '四川', '510900', '遂宁市', '510923', '大英县', '6', '西南');
INSERT INTO `city` VALUES ('511000', '内江市', '510000', '四川省', '四川', '511000', '内江市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511001', '市辖区', '510000', '四川省', '四川', '511000', '内江市', '511001', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511002', '市中区', '510000', '四川省', '四川', '511000', '内江市', '511002', '市中区', '6', '西南');
INSERT INTO `city` VALUES ('511011', '东兴区', '510000', '四川省', '四川', '511000', '内江市', '511011', '东兴区', '6', '西南');
INSERT INTO `city` VALUES ('511024', '威远县', '510000', '四川省', '四川', '511000', '内江市', '511024', '威远县', '6', '西南');
INSERT INTO `city` VALUES ('511025', '资中县', '510000', '四川省', '四川', '511000', '内江市', '511025', '资中县', '6', '西南');
INSERT INTO `city` VALUES ('511028', '隆昌县', '510000', '四川省', '四川', '511000', '内江市', '511028', '隆昌县', '6', '西南');
INSERT INTO `city` VALUES ('511100', '乐山市', '510000', '四川省', '四川', '511100', '乐山市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511101', '市辖区', '510000', '四川省', '四川', '511100', '乐山市', '511101', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511102', '市中区', '510000', '四川省', '四川', '511100', '乐山市', '511102', '市中区', '6', '西南');
INSERT INTO `city` VALUES ('511111', '沙湾区', '510000', '四川省', '四川', '511100', '乐山市', '511111', '沙湾区', '6', '西南');
INSERT INTO `city` VALUES ('511112', '五通桥区', '510000', '四川省', '四川', '511100', '乐山市', '511112', '五通桥区', '6', '西南');
INSERT INTO `city` VALUES ('511113', '金口河区', '510000', '四川省', '四川', '511100', '乐山市', '511113', '金口河区', '6', '西南');
INSERT INTO `city` VALUES ('511123', '犍为县', '510000', '四川省', '四川', '511100', '乐山市', '511123', '犍为县', '6', '西南');
INSERT INTO `city` VALUES ('511124', '井研县', '510000', '四川省', '四川', '511100', '乐山市', '511124', '井研县', '6', '西南');
INSERT INTO `city` VALUES ('511126', '夹江县', '510000', '四川省', '四川', '511100', '乐山市', '511126', '夹江县', '6', '西南');
INSERT INTO `city` VALUES ('511129', '沐川县', '510000', '四川省', '四川', '511100', '乐山市', '511129', '沐川县', '6', '西南');
INSERT INTO `city` VALUES ('511132', '峨边彝族自治县', '510000', '四川省', '四川', '511100', '乐山市', '511132', '峨边彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('511133', '马边彝族自治县', '510000', '四川省', '四川', '511100', '乐山市', '511133', '马边彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('511181', '峨眉山市', '510000', '四川省', '四川', '511100', '乐山市', '511181', '峨眉山市', '6', '西南');
INSERT INTO `city` VALUES ('511300', '南充市', '510000', '四川省', '四川', '511300', '南充市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511301', '市辖区', '510000', '四川省', '四川', '511300', '南充市', '511301', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511302', '顺庆区', '510000', '四川省', '四川', '511300', '南充市', '511302', '顺庆区', '6', '西南');
INSERT INTO `city` VALUES ('511303', '高坪区', '510000', '四川省', '四川', '511300', '南充市', '511303', '高坪区', '6', '西南');
INSERT INTO `city` VALUES ('511304', '嘉陵区', '510000', '四川省', '四川', '511300', '南充市', '511304', '嘉陵区', '6', '西南');
INSERT INTO `city` VALUES ('511321', '南部县', '510000', '四川省', '四川', '511300', '南充市', '511321', '南部县', '6', '西南');
INSERT INTO `city` VALUES ('511322', '营山县', '510000', '四川省', '四川', '511300', '南充市', '511322', '营山县', '6', '西南');
INSERT INTO `city` VALUES ('511323', '蓬安县', '510000', '四川省', '四川', '511300', '南充市', '511323', '蓬安县', '6', '西南');
INSERT INTO `city` VALUES ('511324', '仪陇县', '510000', '四川省', '四川', '511300', '南充市', '511324', '仪陇县', '6', '西南');
INSERT INTO `city` VALUES ('511325', '西充县', '510000', '四川省', '四川', '511300', '南充市', '511325', '西充县', '6', '西南');
INSERT INTO `city` VALUES ('511381', '阆中市', '510000', '四川省', '四川', '511300', '南充市', '511381', '阆中市', '6', '西南');
INSERT INTO `city` VALUES ('511400', '眉山市', '510000', '四川省', '四川', '511400', '眉山市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511401', '市辖区', '510000', '四川省', '四川', '511400', '眉山市', '511401', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511402', '东坡区', '510000', '四川省', '四川', '511400', '眉山市', '511402', '东坡区', '6', '西南');
INSERT INTO `city` VALUES ('511421', '仁寿县', '510000', '四川省', '四川', '511400', '眉山市', '511421', '仁寿县', '6', '西南');
INSERT INTO `city` VALUES ('511422', '彭山县', '510000', '四川省', '四川', '511400', '眉山市', '511422', '彭山县', '6', '西南');
INSERT INTO `city` VALUES ('511423', '洪雅县', '510000', '四川省', '四川', '511400', '眉山市', '511423', '洪雅县', '6', '西南');
INSERT INTO `city` VALUES ('511424', '丹棱县', '510000', '四川省', '四川', '511400', '眉山市', '511424', '丹棱县', '6', '西南');
INSERT INTO `city` VALUES ('511425', '青神县', '510000', '四川省', '四川', '511400', '眉山市', '511425', '青神县', '6', '西南');
INSERT INTO `city` VALUES ('511500', '宜宾市', '510000', '四川省', '四川', '511500', '宜宾市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511501', '市辖区', '510000', '四川省', '四川', '511500', '宜宾市', '511501', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511502', '翠屏区', '510000', '四川省', '四川', '511500', '宜宾市', '511502', '翠屏区', '6', '西南');
INSERT INTO `city` VALUES ('511503', '南溪区', '510000', '四川省', '四川', '511500', '宜宾市', '511503', '南溪区', '6', '西南');
INSERT INTO `city` VALUES ('511521', '宜宾县', '510000', '四川省', '四川', '511500', '宜宾市', '511521', '宜宾县', '6', '西南');
INSERT INTO `city` VALUES ('511523', '江安县', '510000', '四川省', '四川', '511500', '宜宾市', '511523', '江安县', '6', '西南');
INSERT INTO `city` VALUES ('511524', '长宁县', '510000', '四川省', '四川', '511500', '宜宾市', '511524', '长宁县', '6', '西南');
INSERT INTO `city` VALUES ('511525', '高县', '510000', '四川省', '四川', '511500', '宜宾市', '511525', '高县', '6', '西南');
INSERT INTO `city` VALUES ('511526', '珙县', '510000', '四川省', '四川', '511500', '宜宾市', '511526', '珙县', '6', '西南');
INSERT INTO `city` VALUES ('511527', '筠连县', '510000', '四川省', '四川', '511500', '宜宾市', '511527', '筠连县', '6', '西南');
INSERT INTO `city` VALUES ('511528', '兴文县', '510000', '四川省', '四川', '511500', '宜宾市', '511528', '兴文县', '6', '西南');
INSERT INTO `city` VALUES ('511529', '屏山县', '510000', '四川省', '四川', '511500', '宜宾市', '511529', '屏山县', '6', '西南');
INSERT INTO `city` VALUES ('511600', '广安市', '510000', '四川省', '四川', '511600', '广安市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511601', '市辖区', '510000', '四川省', '四川', '511600', '广安市', '511601', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511602', '广安区', '510000', '四川省', '四川', '511600', '广安市', '511602', '广安区', '6', '西南');
INSERT INTO `city` VALUES ('511603', '前锋区', '510000', '四川省', '四川', '511600', '广安市', '511603', '前锋区', '6', '西南');
INSERT INTO `city` VALUES ('511621', '岳池县', '510000', '四川省', '四川', '511600', '广安市', '511621', '岳池县', '6', '西南');
INSERT INTO `city` VALUES ('511622', '武胜县', '510000', '四川省', '四川', '511600', '广安市', '511622', '武胜县', '6', '西南');
INSERT INTO `city` VALUES ('511623', '邻水县', '510000', '四川省', '四川', '511600', '广安市', '511623', '邻水县', '6', '西南');
INSERT INTO `city` VALUES ('511681', '华蓥市', '510000', '四川省', '四川', '511600', '广安市', '511681', '华蓥市', '6', '西南');
INSERT INTO `city` VALUES ('511700', '达州市', '510000', '四川省', '四川', '511700', '达州市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511701', '市辖区', '510000', '四川省', '四川', '511700', '达州市', '511701', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511702', '通川区', '510000', '四川省', '四川', '511700', '达州市', '511702', '通川区', '6', '西南');
INSERT INTO `city` VALUES ('511703', '达川区', '510000', '四川省', '四川', '511700', '达州市', '511703', '达川区', '6', '西南');
INSERT INTO `city` VALUES ('511722', '宣汉县', '510000', '四川省', '四川', '511700', '达州市', '511722', '宣汉县', '6', '西南');
INSERT INTO `city` VALUES ('511723', '开江县', '510000', '四川省', '四川', '511700', '达州市', '511723', '开江县', '6', '西南');
INSERT INTO `city` VALUES ('511724', '大竹县', '510000', '四川省', '四川', '511700', '达州市', '511724', '大竹县', '6', '西南');
INSERT INTO `city` VALUES ('511725', '渠县', '510000', '四川省', '四川', '511700', '达州市', '511725', '渠县', '6', '西南');
INSERT INTO `city` VALUES ('511781', '万源市', '510000', '四川省', '四川', '511700', '达州市', '511781', '万源市', '6', '西南');
INSERT INTO `city` VALUES ('511800', '雅安市', '510000', '四川省', '四川', '511800', '雅安市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511801', '市辖区', '510000', '四川省', '四川', '511800', '雅安市', '511801', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511802', '雨城区', '510000', '四川省', '四川', '511800', '雅安市', '511802', '雨城区', '6', '西南');
INSERT INTO `city` VALUES ('511803', '名山区', '510000', '四川省', '四川', '511800', '雅安市', '511803', '名山区', '6', '西南');
INSERT INTO `city` VALUES ('511822', '荥经县', '510000', '四川省', '四川', '511800', '雅安市', '511822', '荥经县', '6', '西南');
INSERT INTO `city` VALUES ('511823', '汉源县', '510000', '四川省', '四川', '511800', '雅安市', '511823', '汉源县', '6', '西南');
INSERT INTO `city` VALUES ('511824', '石棉县', '510000', '四川省', '四川', '511800', '雅安市', '511824', '石棉县', '6', '西南');
INSERT INTO `city` VALUES ('511825', '天全县', '510000', '四川省', '四川', '511800', '雅安市', '511825', '天全县', '6', '西南');
INSERT INTO `city` VALUES ('511826', '芦山县', '510000', '四川省', '四川', '511800', '雅安市', '511826', '芦山县', '6', '西南');
INSERT INTO `city` VALUES ('511827', '宝兴县', '510000', '四川省', '四川', '511800', '雅安市', '511827', '宝兴县', '6', '西南');
INSERT INTO `city` VALUES ('511900', '巴中市', '510000', '四川省', '四川', '511900', '巴中市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('511901', '市辖区', '510000', '四川省', '四川', '511900', '巴中市', '511901', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('511902', '巴州区', '510000', '四川省', '四川', '511900', '巴中市', '511902', '巴州区', '6', '西南');
INSERT INTO `city` VALUES ('511903', '恩阳区', '510000', '四川省', '四川', '511900', '巴中市', '511903', '恩阳区', '6', '西南');
INSERT INTO `city` VALUES ('511921', '通江县', '510000', '四川省', '四川', '511900', '巴中市', '511921', '通江县', '6', '西南');
INSERT INTO `city` VALUES ('511922', '南江县', '510000', '四川省', '四川', '511900', '巴中市', '511922', '南江县', '6', '西南');
INSERT INTO `city` VALUES ('511923', '平昌县', '510000', '四川省', '四川', '511900', '巴中市', '511923', '平昌县', '6', '西南');
INSERT INTO `city` VALUES ('512000', '资阳市', '510000', '四川省', '四川', '512000', '资阳市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('512001', '市辖区', '510000', '四川省', '四川', '512000', '资阳市', '512001', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('512002', '雁江区', '510000', '四川省', '四川', '512000', '资阳市', '512002', '雁江区', '6', '西南');
INSERT INTO `city` VALUES ('512021', '安岳县', '510000', '四川省', '四川', '512000', '资阳市', '512021', '安岳县', '6', '西南');
INSERT INTO `city` VALUES ('512022', '乐至县', '510000', '四川省', '四川', '512000', '资阳市', '512022', '乐至县', '6', '西南');
INSERT INTO `city` VALUES ('512081', '简阳市', '510000', '四川省', '四川', '512000', '资阳市', '512081', '简阳市', '6', '西南');
INSERT INTO `city` VALUES ('513200', '阿坝藏族羌族自治州', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('513221', '汶川县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513221', '汶川县', '6', '西南');
INSERT INTO `city` VALUES ('513222', '理县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513222', '理县', '6', '西南');
INSERT INTO `city` VALUES ('513223', '茂县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513223', '茂县', '6', '西南');
INSERT INTO `city` VALUES ('513224', '松潘县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513224', '松潘县', '6', '西南');
INSERT INTO `city` VALUES ('513225', '九寨沟县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513225', '九寨沟县', '6', '西南');
INSERT INTO `city` VALUES ('513226', '金川县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513226', '金川县', '6', '西南');
INSERT INTO `city` VALUES ('513227', '小金县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513227', '小金县', '6', '西南');
INSERT INTO `city` VALUES ('513228', '黑水县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513228', '黑水县', '6', '西南');
INSERT INTO `city` VALUES ('513229', '马尔康县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513229', '马尔康县', '6', '西南');
INSERT INTO `city` VALUES ('513230', '壤塘县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513230', '壤塘县', '6', '西南');
INSERT INTO `city` VALUES ('513231', '阿坝县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513231', '阿坝县', '6', '西南');
INSERT INTO `city` VALUES ('513232', '若尔盖县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513232', '若尔盖县', '6', '西南');
INSERT INTO `city` VALUES ('513233', '红原县', '510000', '四川省', '四川', '513200', '阿坝藏族羌族自治州', '513233', '红原县', '6', '西南');
INSERT INTO `city` VALUES ('513300', '甘孜藏族自治州', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('513321', '康定县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513321', '康定县', '6', '西南');
INSERT INTO `city` VALUES ('513322', '泸定县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513322', '泸定县', '6', '西南');
INSERT INTO `city` VALUES ('513323', '丹巴县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513323', '丹巴县', '6', '西南');
INSERT INTO `city` VALUES ('513324', '九龙县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513324', '九龙县', '6', '西南');
INSERT INTO `city` VALUES ('513325', '雅江县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513325', '雅江县', '6', '西南');
INSERT INTO `city` VALUES ('513326', '道孚县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513326', '道孚县', '6', '西南');
INSERT INTO `city` VALUES ('513327', '炉霍县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513327', '炉霍县', '6', '西南');
INSERT INTO `city` VALUES ('513328', '甘孜县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513328', '甘孜县', '6', '西南');
INSERT INTO `city` VALUES ('513329', '新龙县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513329', '新龙县', '6', '西南');
INSERT INTO `city` VALUES ('513330', '德格县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513330', '德格县', '6', '西南');
INSERT INTO `city` VALUES ('513331', '白玉县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513331', '白玉县', '6', '西南');
INSERT INTO `city` VALUES ('513332', '石渠县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513332', '石渠县', '6', '西南');
INSERT INTO `city` VALUES ('513333', '色达县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513333', '色达县', '6', '西南');
INSERT INTO `city` VALUES ('513334', '理塘县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513334', '理塘县', '6', '西南');
INSERT INTO `city` VALUES ('513335', '巴塘县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513335', '巴塘县', '6', '西南');
INSERT INTO `city` VALUES ('513336', '乡城县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513336', '乡城县', '6', '西南');
INSERT INTO `city` VALUES ('513337', '稻城县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513337', '稻城县', '6', '西南');
INSERT INTO `city` VALUES ('513338', '得荣县', '510000', '四川省', '四川', '513300', '甘孜藏族自治州', '513338', '得荣县', '6', '西南');
INSERT INTO `city` VALUES ('513400', '凉山彝族自治州', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('513401', '西昌市', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513401', '西昌市', '6', '西南');
INSERT INTO `city` VALUES ('513422', '木里藏族自治县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513422', '木里藏族自治县', '6', '西南');
INSERT INTO `city` VALUES ('513423', '盐源县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513423', '盐源县', '6', '西南');
INSERT INTO `city` VALUES ('513424', '德昌县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513424', '德昌县', '6', '西南');
INSERT INTO `city` VALUES ('513425', '会理县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513425', '会理县', '6', '西南');
INSERT INTO `city` VALUES ('513426', '会东县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513426', '会东县', '6', '西南');
INSERT INTO `city` VALUES ('513427', '宁南县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513427', '宁南县', '6', '西南');
INSERT INTO `city` VALUES ('513428', '普格县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513428', '普格县', '6', '西南');
INSERT INTO `city` VALUES ('513429', '布拖县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513429', '布拖县', '6', '西南');
INSERT INTO `city` VALUES ('513430', '金阳县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513430', '金阳县', '6', '西南');
INSERT INTO `city` VALUES ('513431', '昭觉县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513431', '昭觉县', '6', '西南');
INSERT INTO `city` VALUES ('513432', '喜德县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513432', '喜德县', '6', '西南');
INSERT INTO `city` VALUES ('513433', '冕宁县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513433', '冕宁县', '6', '西南');
INSERT INTO `city` VALUES ('513434', '越西县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513434', '越西县', '6', '西南');
INSERT INTO `city` VALUES ('513435', '甘洛县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513435', '甘洛县', '6', '西南');
INSERT INTO `city` VALUES ('513436', '美姑县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513436', '美姑县', '6', '西南');
INSERT INTO `city` VALUES ('513437', '雷波县', '510000', '四川省', '四川', '513400', '凉山彝族自治州', '513437', '雷波县', '6', '西南');
INSERT INTO `city` VALUES ('520000', '贵州省', '520000', '贵州省', '贵州', '0', '', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520100', '贵阳市', '520000', '贵州省', '贵州', '520100', '贵阳市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520101', '市辖区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520101', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('520102', '南明区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520102', '南明区', '6', '西南');
INSERT INTO `city` VALUES ('520103', '云岩区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520103', '云岩区', '6', '西南');
INSERT INTO `city` VALUES ('520111', '花溪区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520111', '花溪区', '6', '西南');
INSERT INTO `city` VALUES ('520112', '乌当区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520112', '乌当区', '6', '西南');
INSERT INTO `city` VALUES ('520113', '白云区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520113', '白云区', '6', '西南');
INSERT INTO `city` VALUES ('520115', '观山湖区', '520000', '贵州省', '贵州', '520100', '贵阳市', '520115', '观山湖区', '6', '西南');
INSERT INTO `city` VALUES ('520121', '开阳县', '520000', '贵州省', '贵州', '520100', '贵阳市', '520121', '开阳县', '6', '西南');
INSERT INTO `city` VALUES ('520122', '息烽县', '520000', '贵州省', '贵州', '520100', '贵阳市', '520122', '息烽县', '6', '西南');
INSERT INTO `city` VALUES ('520123', '修文县', '520000', '贵州省', '贵州', '520100', '贵阳市', '520123', '修文县', '6', '西南');
INSERT INTO `city` VALUES ('520181', '清镇市', '520000', '贵州省', '贵州', '520100', '贵阳市', '520181', '清镇市', '6', '西南');
INSERT INTO `city` VALUES ('520200', '六盘水市', '520000', '贵州省', '贵州', '520200', '六盘水市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520201', '钟山区', '520000', '贵州省', '贵州', '520200', '六盘水市', '520201', '钟山区', '6', '西南');
INSERT INTO `city` VALUES ('520203', '六枝特区', '520000', '贵州省', '贵州', '520200', '六盘水市', '520203', '六枝特区', '6', '西南');
INSERT INTO `city` VALUES ('520221', '水城县', '520000', '贵州省', '贵州', '520200', '六盘水市', '520221', '水城县', '6', '西南');
INSERT INTO `city` VALUES ('520222', '盘县', '520000', '贵州省', '贵州', '520200', '六盘水市', '520222', '盘县', '6', '西南');
INSERT INTO `city` VALUES ('520300', '遵义市', '520000', '贵州省', '贵州', '520300', '遵义市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520301', '市辖区', '520000', '贵州省', '贵州', '520300', '遵义市', '520301', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('520302', '红花岗区', '520000', '贵州省', '贵州', '520300', '遵义市', '520302', '红花岗区', '6', '西南');
INSERT INTO `city` VALUES ('520303', '汇川区', '520000', '贵州省', '贵州', '520300', '遵义市', '520303', '汇川区', '6', '西南');
INSERT INTO `city` VALUES ('520321', '遵义县', '520000', '贵州省', '贵州', '520300', '遵义市', '520321', '遵义县', '6', '西南');
INSERT INTO `city` VALUES ('520322', '桐梓县', '520000', '贵州省', '贵州', '520300', '遵义市', '520322', '桐梓县', '6', '西南');
INSERT INTO `city` VALUES ('520323', '绥阳县', '520000', '贵州省', '贵州', '520300', '遵义市', '520323', '绥阳县', '6', '西南');
INSERT INTO `city` VALUES ('520324', '正安县', '520000', '贵州省', '贵州', '520300', '遵义市', '520324', '正安县', '6', '西南');
INSERT INTO `city` VALUES ('520325', '道真仡佬族苗族自治县', '520000', '贵州省', '贵州', '520300', '遵义市', '520325', '道真仡佬族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520326', '务川仡佬族苗族自治县', '520000', '贵州省', '贵州', '520300', '遵义市', '520326', '务川仡佬族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520327', '凤冈县', '520000', '贵州省', '贵州', '520300', '遵义市', '520327', '凤冈县', '6', '西南');
INSERT INTO `city` VALUES ('520328', '湄潭县', '520000', '贵州省', '贵州', '520300', '遵义市', '520328', '湄潭县', '6', '西南');
INSERT INTO `city` VALUES ('520329', '余庆县', '520000', '贵州省', '贵州', '520300', '遵义市', '520329', '余庆县', '6', '西南');
INSERT INTO `city` VALUES ('520330', '习水县', '520000', '贵州省', '贵州', '520300', '遵义市', '520330', '习水县', '6', '西南');
INSERT INTO `city` VALUES ('520381', '赤水市', '520000', '贵州省', '贵州', '520300', '遵义市', '520381', '赤水市', '6', '西南');
INSERT INTO `city` VALUES ('520382', '仁怀市', '520000', '贵州省', '贵州', '520300', '遵义市', '520382', '仁怀市', '6', '西南');
INSERT INTO `city` VALUES ('520400', '安顺市', '520000', '贵州省', '贵州', '520400', '安顺市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520401', '市辖区', '520000', '贵州省', '贵州', '520400', '安顺市', '520401', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('520402', '西秀区', '520000', '贵州省', '贵州', '520400', '安顺市', '520402', '西秀区', '6', '西南');
INSERT INTO `city` VALUES ('520421', '平坝县', '520000', '贵州省', '贵州', '520400', '安顺市', '520421', '平坝县', '6', '西南');
INSERT INTO `city` VALUES ('520422', '普定县', '520000', '贵州省', '贵州', '520400', '安顺市', '520422', '普定县', '6', '西南');
INSERT INTO `city` VALUES ('520423', '镇宁布依族苗族自治县', '520000', '贵州省', '贵州', '520400', '安顺市', '520423', '镇宁布依族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520424', '关岭布依族苗族自治县', '520000', '贵州省', '贵州', '520400', '安顺市', '520424', '关岭布依族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520425', '紫云苗族布依族自治县', '520000', '贵州省', '贵州', '520400', '安顺市', '520425', '紫云苗族布依族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520500', '毕节市', '520000', '贵州省', '贵州', '520500', '毕节市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520501', '市辖区', '520000', '贵州省', '贵州', '520500', '毕节市', '520501', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('520502', '七星关区', '520000', '贵州省', '贵州', '520500', '毕节市', '520502', '七星关区', '6', '西南');
INSERT INTO `city` VALUES ('520521', '大方县', '520000', '贵州省', '贵州', '520500', '毕节市', '520521', '大方县', '6', '西南');
INSERT INTO `city` VALUES ('520522', '黔西县', '520000', '贵州省', '贵州', '520500', '毕节市', '520522', '黔西县', '6', '西南');
INSERT INTO `city` VALUES ('520523', '金沙县', '520000', '贵州省', '贵州', '520500', '毕节市', '520523', '金沙县', '6', '西南');
INSERT INTO `city` VALUES ('520524', '织金县', '520000', '贵州省', '贵州', '520500', '毕节市', '520524', '织金县', '6', '西南');
INSERT INTO `city` VALUES ('520525', '纳雍县', '520000', '贵州省', '贵州', '520500', '毕节市', '520525', '纳雍县', '6', '西南');
INSERT INTO `city` VALUES ('520526', '威宁彝族回族苗族自治县', '520000', '贵州省', '贵州', '520500', '毕节市', '520526', '威宁彝族回族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520527', '赫章县', '520000', '贵州省', '贵州', '520500', '毕节市', '520527', '赫章县', '6', '西南');
INSERT INTO `city` VALUES ('520600', '铜仁市', '520000', '贵州省', '贵州', '520600', '铜仁市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('520601', '市辖区', '520000', '贵州省', '贵州', '520600', '铜仁市', '520601', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('520602', '碧江区', '520000', '贵州省', '贵州', '520600', '铜仁市', '520602', '碧江区', '6', '西南');
INSERT INTO `city` VALUES ('520603', '万山区', '520000', '贵州省', '贵州', '520600', '铜仁市', '520603', '万山区', '6', '西南');
INSERT INTO `city` VALUES ('520621', '江口县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520621', '江口县', '6', '西南');
INSERT INTO `city` VALUES ('520622', '玉屏侗族自治县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520622', '玉屏侗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520623', '石阡县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520623', '石阡县', '6', '西南');
INSERT INTO `city` VALUES ('520624', '思南县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520624', '思南县', '6', '西南');
INSERT INTO `city` VALUES ('520625', '印江土家族苗族自治县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520625', '印江土家族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520626', '德江县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520626', '德江县', '6', '西南');
INSERT INTO `city` VALUES ('520627', '沿河土家族自治县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520627', '沿河土家族自治县', '6', '西南');
INSERT INTO `city` VALUES ('520628', '松桃苗族自治县', '520000', '贵州省', '贵州', '520600', '铜仁市', '520628', '松桃苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('522300', '黔西南布依族苗族自治州', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('522301', '兴义市', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522301', '兴义市', '6', '西南');
INSERT INTO `city` VALUES ('522322', '兴仁县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522322', '兴仁县', '6', '西南');
INSERT INTO `city` VALUES ('522323', '普安县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522323', '普安县', '6', '西南');
INSERT INTO `city` VALUES ('522324', '晴隆县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522324', '晴隆县', '6', '西南');
INSERT INTO `city` VALUES ('522325', '贞丰县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522325', '贞丰县', '6', '西南');
INSERT INTO `city` VALUES ('522326', '望谟县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522326', '望谟县', '6', '西南');
INSERT INTO `city` VALUES ('522327', '册亨县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522327', '册亨县', '6', '西南');
INSERT INTO `city` VALUES ('522328', '安龙县', '520000', '贵州省', '贵州', '522300', '黔西南布依族苗族自治州', '522328', '安龙县', '6', '西南');
INSERT INTO `city` VALUES ('522600', '黔东南苗族侗族自治州', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('522601', '凯里市', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522601', '凯里市', '6', '西南');
INSERT INTO `city` VALUES ('522622', '黄平县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522622', '黄平县', '6', '西南');
INSERT INTO `city` VALUES ('522623', '施秉县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522623', '施秉县', '6', '西南');
INSERT INTO `city` VALUES ('522624', '三穗县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522624', '三穗县', '6', '西南');
INSERT INTO `city` VALUES ('522625', '镇远县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522625', '镇远县', '6', '西南');
INSERT INTO `city` VALUES ('522626', '岑巩县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522626', '岑巩县', '6', '西南');
INSERT INTO `city` VALUES ('522627', '天柱县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522627', '天柱县', '6', '西南');
INSERT INTO `city` VALUES ('522628', '锦屏县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522628', '锦屏县', '6', '西南');
INSERT INTO `city` VALUES ('522629', '剑河县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522629', '剑河县', '6', '西南');
INSERT INTO `city` VALUES ('522630', '台江县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522630', '台江县', '6', '西南');
INSERT INTO `city` VALUES ('522631', '黎平县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522631', '黎平县', '6', '西南');
INSERT INTO `city` VALUES ('522632', '榕江县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522632', '榕江县', '6', '西南');
INSERT INTO `city` VALUES ('522633', '从江县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522633', '从江县', '6', '西南');
INSERT INTO `city` VALUES ('522634', '雷山县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522634', '雷山县', '6', '西南');
INSERT INTO `city` VALUES ('522635', '麻江县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522635', '麻江县', '6', '西南');
INSERT INTO `city` VALUES ('522636', '丹寨县', '520000', '贵州省', '贵州', '522600', '黔东南苗族侗族自治州', '522636', '丹寨县', '6', '西南');
INSERT INTO `city` VALUES ('522700', '黔南布依族苗族自治州', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('522701', '都匀市', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522701', '都匀市', '6', '西南');
INSERT INTO `city` VALUES ('522702', '福泉市', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522702', '福泉市', '6', '西南');
INSERT INTO `city` VALUES ('522722', '荔波县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522722', '荔波县', '6', '西南');
INSERT INTO `city` VALUES ('522723', '贵定县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522723', '贵定县', '6', '西南');
INSERT INTO `city` VALUES ('522725', '瓮安县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522725', '瓮安县', '6', '西南');
INSERT INTO `city` VALUES ('522726', '独山县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522726', '独山县', '6', '西南');
INSERT INTO `city` VALUES ('522727', '平塘县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522727', '平塘县', '6', '西南');
INSERT INTO `city` VALUES ('522728', '罗甸县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522728', '罗甸县', '6', '西南');
INSERT INTO `city` VALUES ('522729', '长顺县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522729', '长顺县', '6', '西南');
INSERT INTO `city` VALUES ('522730', '龙里县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522730', '龙里县', '6', '西南');
INSERT INTO `city` VALUES ('522731', '惠水县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522731', '惠水县', '6', '西南');
INSERT INTO `city` VALUES ('522732', '三都水族自治县', '520000', '贵州省', '贵州', '522700', '黔南布依族苗族自治州', '522732', '三都水族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530000', '云南省', '530000', '云南省', '云南', '0', '', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530100', '昆明市', '530000', '云南省', '云南', '530100', '昆明市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530101', '市辖区', '530000', '云南省', '云南', '530100', '昆明市', '530101', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530102', '五华区', '530000', '云南省', '云南', '530100', '昆明市', '530102', '五华区', '6', '西南');
INSERT INTO `city` VALUES ('530103', '盘龙区', '530000', '云南省', '云南', '530100', '昆明市', '530103', '盘龙区', '6', '西南');
INSERT INTO `city` VALUES ('530111', '官渡区', '530000', '云南省', '云南', '530100', '昆明市', '530111', '官渡区', '6', '西南');
INSERT INTO `city` VALUES ('530112', '西山区', '530000', '云南省', '云南', '530100', '昆明市', '530112', '西山区', '6', '西南');
INSERT INTO `city` VALUES ('530113', '东川区', '530000', '云南省', '云南', '530100', '昆明市', '530113', '东川区', '6', '西南');
INSERT INTO `city` VALUES ('530114', '呈贡区', '530000', '云南省', '云南', '530100', '昆明市', '530114', '呈贡区', '6', '西南');
INSERT INTO `city` VALUES ('530122', '晋宁县', '530000', '云南省', '云南', '530100', '昆明市', '530122', '晋宁县', '6', '西南');
INSERT INTO `city` VALUES ('530124', '富民县', '530000', '云南省', '云南', '530100', '昆明市', '530124', '富民县', '6', '西南');
INSERT INTO `city` VALUES ('530125', '宜良县', '530000', '云南省', '云南', '530100', '昆明市', '530125', '宜良县', '6', '西南');
INSERT INTO `city` VALUES ('530126', '石林彝族自治县', '530000', '云南省', '云南', '530100', '昆明市', '530126', '石林彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530127', '嵩明县', '530000', '云南省', '云南', '530100', '昆明市', '530127', '嵩明县', '6', '西南');
INSERT INTO `city` VALUES ('530128', '禄劝彝族苗族自治县', '530000', '云南省', '云南', '530100', '昆明市', '530128', '禄劝彝族苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530129', '寻甸回族彝族自治县', '530000', '云南省', '云南', '530100', '昆明市', '530129', '寻甸回族彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530181', '安宁市', '530000', '云南省', '云南', '530100', '昆明市', '530181', '安宁市', '6', '西南');
INSERT INTO `city` VALUES ('530300', '曲靖市', '530000', '云南省', '云南', '530300', '曲靖市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530301', '市辖区', '530000', '云南省', '云南', '530300', '曲靖市', '530301', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530302', '麒麟区', '530000', '云南省', '云南', '530300', '曲靖市', '530302', '麒麟区', '6', '西南');
INSERT INTO `city` VALUES ('530321', '马龙县', '530000', '云南省', '云南', '530300', '曲靖市', '530321', '马龙县', '6', '西南');
INSERT INTO `city` VALUES ('530322', '陆良县', '530000', '云南省', '云南', '530300', '曲靖市', '530322', '陆良县', '6', '西南');
INSERT INTO `city` VALUES ('530323', '师宗县', '530000', '云南省', '云南', '530300', '曲靖市', '530323', '师宗县', '6', '西南');
INSERT INTO `city` VALUES ('530324', '罗平县', '530000', '云南省', '云南', '530300', '曲靖市', '530324', '罗平县', '6', '西南');
INSERT INTO `city` VALUES ('530325', '富源县', '530000', '云南省', '云南', '530300', '曲靖市', '530325', '富源县', '6', '西南');
INSERT INTO `city` VALUES ('530326', '会泽县', '530000', '云南省', '云南', '530300', '曲靖市', '530326', '会泽县', '6', '西南');
INSERT INTO `city` VALUES ('530328', '沾益县', '530000', '云南省', '云南', '530300', '曲靖市', '530328', '沾益县', '6', '西南');
INSERT INTO `city` VALUES ('530381', '宣威市', '530000', '云南省', '云南', '530300', '曲靖市', '530381', '宣威市', '6', '西南');
INSERT INTO `city` VALUES ('530400', '玉溪市', '530000', '云南省', '云南', '530400', '玉溪市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530401', '市辖区', '530000', '云南省', '云南', '530400', '玉溪市', '530401', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530402', '红塔区', '530000', '云南省', '云南', '530400', '玉溪市', '530402', '红塔区', '6', '西南');
INSERT INTO `city` VALUES ('530421', '江川县', '530000', '云南省', '云南', '530400', '玉溪市', '530421', '江川县', '6', '西南');
INSERT INTO `city` VALUES ('530422', '澄江县', '530000', '云南省', '云南', '530400', '玉溪市', '530422', '澄江县', '6', '西南');
INSERT INTO `city` VALUES ('530423', '通海县', '530000', '云南省', '云南', '530400', '玉溪市', '530423', '通海县', '6', '西南');
INSERT INTO `city` VALUES ('530424', '华宁县', '530000', '云南省', '云南', '530400', '玉溪市', '530424', '华宁县', '6', '西南');
INSERT INTO `city` VALUES ('530425', '易门县', '530000', '云南省', '云南', '530400', '玉溪市', '530425', '易门县', '6', '西南');
INSERT INTO `city` VALUES ('530426', '峨山彝族自治县', '530000', '云南省', '云南', '530400', '玉溪市', '530426', '峨山彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530427', '新平彝族傣族自治县', '530000', '云南省', '云南', '530400', '玉溪市', '530427', '新平彝族傣族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530428', '元江哈尼族彝族傣族自治县', '530000', '云南省', '云南', '530400', '玉溪市', '530428', '元江哈尼族彝族傣族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530500', '保山市', '530000', '云南省', '云南', '530500', '保山市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530501', '市辖区', '530000', '云南省', '云南', '530500', '保山市', '530501', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530502', '隆阳区', '530000', '云南省', '云南', '530500', '保山市', '530502', '隆阳区', '6', '西南');
INSERT INTO `city` VALUES ('530521', '施甸县', '530000', '云南省', '云南', '530500', '保山市', '530521', '施甸县', '6', '西南');
INSERT INTO `city` VALUES ('530522', '腾冲县', '530000', '云南省', '云南', '530500', '保山市', '530522', '腾冲县', '6', '西南');
INSERT INTO `city` VALUES ('530523', '龙陵县', '530000', '云南省', '云南', '530500', '保山市', '530523', '龙陵县', '6', '西南');
INSERT INTO `city` VALUES ('530524', '昌宁县', '530000', '云南省', '云南', '530500', '保山市', '530524', '昌宁县', '6', '西南');
INSERT INTO `city` VALUES ('530600', '昭通市', '530000', '云南省', '云南', '530600', '昭通市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530601', '市辖区', '530000', '云南省', '云南', '530600', '昭通市', '530601', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530602', '昭阳区', '530000', '云南省', '云南', '530600', '昭通市', '530602', '昭阳区', '6', '西南');
INSERT INTO `city` VALUES ('530621', '鲁甸县', '530000', '云南省', '云南', '530600', '昭通市', '530621', '鲁甸县', '6', '西南');
INSERT INTO `city` VALUES ('530622', '巧家县', '530000', '云南省', '云南', '530600', '昭通市', '530622', '巧家县', '6', '西南');
INSERT INTO `city` VALUES ('530623', '盐津县', '530000', '云南省', '云南', '530600', '昭通市', '530623', '盐津县', '6', '西南');
INSERT INTO `city` VALUES ('530624', '大关县', '530000', '云南省', '云南', '530600', '昭通市', '530624', '大关县', '6', '西南');
INSERT INTO `city` VALUES ('530625', '永善县', '530000', '云南省', '云南', '530600', '昭通市', '530625', '永善县', '6', '西南');
INSERT INTO `city` VALUES ('530626', '绥江县', '530000', '云南省', '云南', '530600', '昭通市', '530626', '绥江县', '6', '西南');
INSERT INTO `city` VALUES ('530627', '镇雄县', '530000', '云南省', '云南', '530600', '昭通市', '530627', '镇雄县', '6', '西南');
INSERT INTO `city` VALUES ('530628', '彝良县', '530000', '云南省', '云南', '530600', '昭通市', '530628', '彝良县', '6', '西南');
INSERT INTO `city` VALUES ('530629', '威信县', '530000', '云南省', '云南', '530600', '昭通市', '530629', '威信县', '6', '西南');
INSERT INTO `city` VALUES ('530630', '水富县', '530000', '云南省', '云南', '530600', '昭通市', '530630', '水富县', '6', '西南');
INSERT INTO `city` VALUES ('530700', '丽江市', '530000', '云南省', '云南', '530700', '丽江市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530701', '市辖区', '530000', '云南省', '云南', '530700', '丽江市', '530701', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530702', '古城区', '530000', '云南省', '云南', '530700', '丽江市', '530702', '古城区', '6', '西南');
INSERT INTO `city` VALUES ('530721', '玉龙纳西族自治县', '530000', '云南省', '云南', '530700', '丽江市', '530721', '玉龙纳西族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530722', '永胜县', '530000', '云南省', '云南', '530700', '丽江市', '530722', '永胜县', '6', '西南');
INSERT INTO `city` VALUES ('530723', '华坪县', '530000', '云南省', '云南', '530700', '丽江市', '530723', '华坪县', '6', '西南');
INSERT INTO `city` VALUES ('530724', '宁蒗彝族自治县', '530000', '云南省', '云南', '530700', '丽江市', '530724', '宁蒗彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530800', '普洱市', '530000', '云南省', '云南', '530800', '普洱市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530801', '市辖区', '530000', '云南省', '云南', '530800', '普洱市', '530801', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530802', '思茅区', '530000', '云南省', '云南', '530800', '普洱市', '530802', '思茅区', '6', '西南');
INSERT INTO `city` VALUES ('530821', '宁洱哈尼族彝族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530821', '宁洱哈尼族彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530822', '墨江哈尼族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530822', '墨江哈尼族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530823', '景东彝族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530823', '景东彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530824', '景谷傣族彝族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530824', '景谷傣族彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530825', '镇沅彝族哈尼族拉祜族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530825', '镇沅彝族哈尼族拉祜族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530826', '江城哈尼族彝族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530826', '江城哈尼族彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530827', '孟连傣族拉祜族佤族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530827', '孟连傣族拉祜族佤族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530828', '澜沧拉祜族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530828', '澜沧拉祜族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530829', '西盟佤族自治县', '530000', '云南省', '云南', '530800', '普洱市', '530829', '西盟佤族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530900', '临沧市', '530000', '云南省', '云南', '530900', '临沧市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('530901', '市辖区', '530000', '云南省', '云南', '530900', '临沧市', '530901', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('530902', '临翔区', '530000', '云南省', '云南', '530900', '临沧市', '530902', '临翔区', '6', '西南');
INSERT INTO `city` VALUES ('530921', '凤庆县', '530000', '云南省', '云南', '530900', '临沧市', '530921', '凤庆县', '6', '西南');
INSERT INTO `city` VALUES ('530922', '云县', '530000', '云南省', '云南', '530900', '临沧市', '530922', '云县', '6', '西南');
INSERT INTO `city` VALUES ('530923', '永德县', '530000', '云南省', '云南', '530900', '临沧市', '530923', '永德县', '6', '西南');
INSERT INTO `city` VALUES ('530924', '镇康县', '530000', '云南省', '云南', '530900', '临沧市', '530924', '镇康县', '6', '西南');
INSERT INTO `city` VALUES ('530925', '双江拉祜族佤族布朗族傣族自治县', '530000', '云南省', '云南', '530900', '临沧市', '530925', '双江拉祜族佤族布朗族傣族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530926', '耿马傣族佤族自治县', '530000', '云南省', '云南', '530900', '临沧市', '530926', '耿马傣族佤族自治县', '6', '西南');
INSERT INTO `city` VALUES ('530927', '沧源佤族自治县', '530000', '云南省', '云南', '530900', '临沧市', '530927', '沧源佤族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532300', '楚雄彝族自治州', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('532301', '楚雄市', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532301', '楚雄市', '6', '西南');
INSERT INTO `city` VALUES ('532322', '双柏县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532322', '双柏县', '6', '西南');
INSERT INTO `city` VALUES ('532323', '牟定县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532323', '牟定县', '6', '西南');
INSERT INTO `city` VALUES ('532324', '南华县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532324', '南华县', '6', '西南');
INSERT INTO `city` VALUES ('532325', '姚安县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532325', '姚安县', '6', '西南');
INSERT INTO `city` VALUES ('532326', '大姚县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532326', '大姚县', '6', '西南');
INSERT INTO `city` VALUES ('532327', '永仁县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532327', '永仁县', '6', '西南');
INSERT INTO `city` VALUES ('532328', '元谋县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532328', '元谋县', '6', '西南');
INSERT INTO `city` VALUES ('532329', '武定县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532329', '武定县', '6', '西南');
INSERT INTO `city` VALUES ('532331', '禄丰县', '530000', '云南省', '云南', '532300', '楚雄彝族自治州', '532331', '禄丰县', '6', '西南');
INSERT INTO `city` VALUES ('532500', '红河哈尼族彝族自治州', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('532501', '个旧市', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532501', '个旧市', '6', '西南');
INSERT INTO `city` VALUES ('532502', '开远市', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532502', '开远市', '6', '西南');
INSERT INTO `city` VALUES ('532503', '蒙自市', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532503', '蒙自市', '6', '西南');
INSERT INTO `city` VALUES ('532504', '弥勒市', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532504', '弥勒市', '6', '西南');
INSERT INTO `city` VALUES ('532523', '屏边苗族自治县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532523', '屏边苗族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532524', '建水县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532524', '建水县', '6', '西南');
INSERT INTO `city` VALUES ('532525', '石屏县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532525', '石屏县', '6', '西南');
INSERT INTO `city` VALUES ('532527', '泸西县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532527', '泸西县', '6', '西南');
INSERT INTO `city` VALUES ('532528', '元阳县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532528', '元阳县', '6', '西南');
INSERT INTO `city` VALUES ('532529', '红河县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532529', '红河县', '6', '西南');
INSERT INTO `city` VALUES ('532530', '金平苗族瑶族傣族自治县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532530', '金平苗族瑶族傣族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532531', '绿春县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532531', '绿春县', '6', '西南');
INSERT INTO `city` VALUES ('532532', '河口瑶族自治县', '530000', '云南省', '云南', '532500', '红河哈尼族彝族自治州', '532532', '河口瑶族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532600', '文山壮族苗族自治州', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('532601', '文山市', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532601', '文山市', '6', '西南');
INSERT INTO `city` VALUES ('532622', '砚山县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532622', '砚山县', '6', '西南');
INSERT INTO `city` VALUES ('532623', '西畴县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532623', '西畴县', '6', '西南');
INSERT INTO `city` VALUES ('532624', '麻栗坡县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532624', '麻栗坡县', '6', '西南');
INSERT INTO `city` VALUES ('532625', '马关县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532625', '马关县', '6', '西南');
INSERT INTO `city` VALUES ('532626', '丘北县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532626', '丘北县', '6', '西南');
INSERT INTO `city` VALUES ('532627', '广南县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532627', '广南县', '6', '西南');
INSERT INTO `city` VALUES ('532628', '富宁县', '530000', '云南省', '云南', '532600', '文山壮族苗族自治州', '532628', '富宁县', '6', '西南');
INSERT INTO `city` VALUES ('532800', '西双版纳傣族自治州', '530000', '云南省', '云南', '532800', '西双版纳傣族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('532801', '景洪市', '530000', '云南省', '云南', '532800', '西双版纳傣族自治州', '532801', '景洪市', '6', '西南');
INSERT INTO `city` VALUES ('532822', '勐海县', '530000', '云南省', '云南', '532800', '西双版纳傣族自治州', '532822', '勐海县', '6', '西南');
INSERT INTO `city` VALUES ('532823', '勐腊县', '530000', '云南省', '云南', '532800', '西双版纳傣族自治州', '532823', '勐腊县', '6', '西南');
INSERT INTO `city` VALUES ('532900', '大理白族自治州', '530000', '云南省', '云南', '532900', '大理白族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('532901', '大理市', '530000', '云南省', '云南', '532900', '大理白族自治州', '532901', '大理市', '6', '西南');
INSERT INTO `city` VALUES ('532922', '漾濞彝族自治县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532922', '漾濞彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532923', '祥云县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532923', '祥云县', '6', '西南');
INSERT INTO `city` VALUES ('532924', '宾川县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532924', '宾川县', '6', '西南');
INSERT INTO `city` VALUES ('532925', '弥渡县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532925', '弥渡县', '6', '西南');
INSERT INTO `city` VALUES ('532926', '南涧彝族自治县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532926', '南涧彝族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532927', '巍山彝族回族自治县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532927', '巍山彝族回族自治县', '6', '西南');
INSERT INTO `city` VALUES ('532928', '永平县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532928', '永平县', '6', '西南');
INSERT INTO `city` VALUES ('532929', '云龙县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532929', '云龙县', '6', '西南');
INSERT INTO `city` VALUES ('532930', '洱源县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532930', '洱源县', '6', '西南');
INSERT INTO `city` VALUES ('532931', '剑川县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532931', '剑川县', '6', '西南');
INSERT INTO `city` VALUES ('532932', '鹤庆县', '530000', '云南省', '云南', '532900', '大理白族自治州', '532932', '鹤庆县', '6', '西南');
INSERT INTO `city` VALUES ('533100', '德宏傣族景颇族自治州', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('533102', '瑞丽市', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '533102', '瑞丽市', '6', '西南');
INSERT INTO `city` VALUES ('533103', '芒市', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '533103', '芒市', '6', '西南');
INSERT INTO `city` VALUES ('533122', '梁河县', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '533122', '梁河县', '6', '西南');
INSERT INTO `city` VALUES ('533123', '盈江县', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '533123', '盈江县', '6', '西南');
INSERT INTO `city` VALUES ('533124', '陇川县', '530000', '云南省', '云南', '533100', '德宏傣族景颇族自治州', '533124', '陇川县', '6', '西南');
INSERT INTO `city` VALUES ('533300', '怒江傈僳族自治州', '530000', '云南省', '云南', '533300', '怒江傈僳族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('533321', '泸水县', '530000', '云南省', '云南', '533300', '怒江傈僳族自治州', '533321', '泸水县', '6', '西南');
INSERT INTO `city` VALUES ('533323', '福贡县', '530000', '云南省', '云南', '533300', '怒江傈僳族自治州', '533323', '福贡县', '6', '西南');
INSERT INTO `city` VALUES ('533324', '贡山独龙族怒族自治县', '530000', '云南省', '云南', '533300', '怒江傈僳族自治州', '533324', '贡山独龙族怒族自治县', '6', '西南');
INSERT INTO `city` VALUES ('533325', '兰坪白族普米族自治县', '530000', '云南省', '云南', '533300', '怒江傈僳族自治州', '533325', '兰坪白族普米族自治县', '6', '西南');
INSERT INTO `city` VALUES ('533400', '迪庆藏族自治州', '530000', '云南省', '云南', '533400', '迪庆藏族自治州', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('533421', '香格里拉县', '530000', '云南省', '云南', '533400', '迪庆藏族自治州', '533421', '香格里拉县', '6', '西南');
INSERT INTO `city` VALUES ('533422', '德钦县', '530000', '云南省', '云南', '533400', '迪庆藏族自治州', '533422', '德钦县', '6', '西南');
INSERT INTO `city` VALUES ('533423', '维西傈僳族自治县', '530000', '云南省', '云南', '533400', '迪庆藏族自治州', '533423', '维西傈僳族自治县', '6', '西南');
INSERT INTO `city` VALUES ('540000', '西藏自治区', '540000', '西藏自治区', '西藏', '0', '', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('540100', '拉萨市', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('540101', '市辖区', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540101', '市辖区', '6', '西南');
INSERT INTO `city` VALUES ('540102', '城关区', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540102', '城关区', '6', '西南');
INSERT INTO `city` VALUES ('540121', '林周县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540121', '林周县', '6', '西南');
INSERT INTO `city` VALUES ('540122', '当雄县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540122', '当雄县', '6', '西南');
INSERT INTO `city` VALUES ('540123', '尼木县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540123', '尼木县', '6', '西南');
INSERT INTO `city` VALUES ('540124', '曲水县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540124', '曲水县', '6', '西南');
INSERT INTO `city` VALUES ('540125', '堆龙德庆县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540125', '堆龙德庆县', '6', '西南');
INSERT INTO `city` VALUES ('540126', '达孜县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540126', '达孜县', '6', '西南');
INSERT INTO `city` VALUES ('540127', '墨竹工卡县', '540000', '西藏自治区', '西藏', '540100', '拉萨市', '540127', '墨竹工卡县', '6', '西南');
INSERT INTO `city` VALUES ('542100', '昌都地区', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542121', '昌都县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542121', '昌都县', '6', '西南');
INSERT INTO `city` VALUES ('542122', '江达县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542122', '江达县', '6', '西南');
INSERT INTO `city` VALUES ('542123', '贡觉县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542123', '贡觉县', '6', '西南');
INSERT INTO `city` VALUES ('542124', '类乌齐县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542124', '类乌齐县', '6', '西南');
INSERT INTO `city` VALUES ('542125', '丁青县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542125', '丁青县', '6', '西南');
INSERT INTO `city` VALUES ('542126', '察雅县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542126', '察雅县', '6', '西南');
INSERT INTO `city` VALUES ('542127', '八宿县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542127', '八宿县', '6', '西南');
INSERT INTO `city` VALUES ('542128', '左贡县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542128', '左贡县', '6', '西南');
INSERT INTO `city` VALUES ('542129', '芒康县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542129', '芒康县', '6', '西南');
INSERT INTO `city` VALUES ('542132', '洛隆县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542132', '洛隆县', '6', '西南');
INSERT INTO `city` VALUES ('542133', '边坝县', '540000', '西藏自治区', '西藏', '542100', '昌都地区', '542133', '边坝县', '6', '西南');
INSERT INTO `city` VALUES ('542200', '山南地区', '540000', '西藏自治区', '西藏', '542200', '山南地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542221', '乃东县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542221', '乃东县', '6', '西南');
INSERT INTO `city` VALUES ('542222', '扎囊县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542222', '扎囊县', '6', '西南');
INSERT INTO `city` VALUES ('542223', '贡嘎县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542223', '贡嘎县', '6', '西南');
INSERT INTO `city` VALUES ('542224', '桑日县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542224', '桑日县', '6', '西南');
INSERT INTO `city` VALUES ('542225', '琼结县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542225', '琼结县', '6', '西南');
INSERT INTO `city` VALUES ('542226', '曲松县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542226', '曲松县', '6', '西南');
INSERT INTO `city` VALUES ('542227', '措美县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542227', '措美县', '6', '西南');
INSERT INTO `city` VALUES ('542228', '洛扎县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542228', '洛扎县', '6', '西南');
INSERT INTO `city` VALUES ('542229', '加查县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542229', '加查县', '6', '西南');
INSERT INTO `city` VALUES ('542231', '隆子县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542231', '隆子县', '6', '西南');
INSERT INTO `city` VALUES ('542232', '错那县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542232', '错那县', '6', '西南');
INSERT INTO `city` VALUES ('542233', '浪卡子县', '540000', '西藏自治区', '西藏', '542200', '山南地区', '542233', '浪卡子县', '6', '西南');
INSERT INTO `city` VALUES ('542300', '日喀则地区', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542301', '日喀则市', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542301', '日喀则市', '6', '西南');
INSERT INTO `city` VALUES ('542322', '南木林县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542322', '南木林县', '6', '西南');
INSERT INTO `city` VALUES ('542323', '江孜县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542323', '江孜县', '6', '西南');
INSERT INTO `city` VALUES ('542324', '定日县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542324', '定日县', '6', '西南');
INSERT INTO `city` VALUES ('542325', '萨迦县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542325', '萨迦县', '6', '西南');
INSERT INTO `city` VALUES ('542326', '拉孜县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542326', '拉孜县', '6', '西南');
INSERT INTO `city` VALUES ('542327', '昂仁县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542327', '昂仁县', '6', '西南');
INSERT INTO `city` VALUES ('542328', '谢通门县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542328', '谢通门县', '6', '西南');
INSERT INTO `city` VALUES ('542329', '白朗县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542329', '白朗县', '6', '西南');
INSERT INTO `city` VALUES ('542330', '仁布县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542330', '仁布县', '6', '西南');
INSERT INTO `city` VALUES ('542331', '康马县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542331', '康马县', '6', '西南');
INSERT INTO `city` VALUES ('542332', '定结县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542332', '定结县', '6', '西南');
INSERT INTO `city` VALUES ('542333', '仲巴县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542333', '仲巴县', '6', '西南');
INSERT INTO `city` VALUES ('542334', '亚东县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542334', '亚东县', '6', '西南');
INSERT INTO `city` VALUES ('542335', '吉隆县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542335', '吉隆县', '6', '西南');
INSERT INTO `city` VALUES ('542336', '聂拉木县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542336', '聂拉木县', '6', '西南');
INSERT INTO `city` VALUES ('542337', '萨嘎县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542337', '萨嘎县', '6', '西南');
INSERT INTO `city` VALUES ('542338', '岗巴县', '540000', '西藏自治区', '西藏', '542300', '日喀则地区', '542338', '岗巴县', '6', '西南');
INSERT INTO `city` VALUES ('542400', '那曲地区', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542421', '那曲县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542421', '那曲县', '6', '西南');
INSERT INTO `city` VALUES ('542422', '嘉黎县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542422', '嘉黎县', '6', '西南');
INSERT INTO `city` VALUES ('542423', '比如县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542423', '比如县', '6', '西南');
INSERT INTO `city` VALUES ('542424', '聂荣县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542424', '聂荣县', '6', '西南');
INSERT INTO `city` VALUES ('542425', '安多县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542425', '安多县', '6', '西南');
INSERT INTO `city` VALUES ('542426', '申扎县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542426', '申扎县', '6', '西南');
INSERT INTO `city` VALUES ('542427', '索县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542427', '索县', '6', '西南');
INSERT INTO `city` VALUES ('542428', '班戈县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542428', '班戈县', '6', '西南');
INSERT INTO `city` VALUES ('542429', '巴青县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542429', '巴青县', '6', '西南');
INSERT INTO `city` VALUES ('542430', '尼玛县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542430', '尼玛县', '6', '西南');
INSERT INTO `city` VALUES ('542431', '双湖县', '540000', '西藏自治区', '西藏', '542400', '那曲地区', '542431', '双湖县', '6', '西南');
INSERT INTO `city` VALUES ('542500', '阿里地区', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542521', '普兰县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542521', '普兰县', '6', '西南');
INSERT INTO `city` VALUES ('542522', '札达县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542522', '札达县', '6', '西南');
INSERT INTO `city` VALUES ('542523', '噶尔县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542523', '噶尔县', '6', '西南');
INSERT INTO `city` VALUES ('542524', '日土县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542524', '日土县', '6', '西南');
INSERT INTO `city` VALUES ('542525', '革吉县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542525', '革吉县', '6', '西南');
INSERT INTO `city` VALUES ('542526', '改则县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542526', '改则县', '6', '西南');
INSERT INTO `city` VALUES ('542527', '措勤县', '540000', '西藏自治区', '西藏', '542500', '阿里地区', '542527', '措勤县', '6', '西南');
INSERT INTO `city` VALUES ('542600', '林芝地区', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '0', '', '6', '西南');
INSERT INTO `city` VALUES ('542621', '林芝县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542621', '林芝县', '6', '西南');
INSERT INTO `city` VALUES ('542622', '工布江达县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542622', '工布江达县', '6', '西南');
INSERT INTO `city` VALUES ('542623', '米林县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542623', '米林县', '6', '西南');
INSERT INTO `city` VALUES ('542624', '墨脱县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542624', '墨脱县', '6', '西南');
INSERT INTO `city` VALUES ('542625', '波密县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542625', '波密县', '6', '西南');
INSERT INTO `city` VALUES ('542626', '察隅县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542626', '察隅县', '6', '西南');
INSERT INTO `city` VALUES ('542627', '朗县', '540000', '西藏自治区', '西藏', '542600', '林芝地区', '542627', '朗县', '6', '西南');
INSERT INTO `city` VALUES ('610000', '陕西省', '610000', '陕西省', '陕西', '0', '', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610100', '西安市', '610000', '陕西省', '陕西', '610100', '西安市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610101', '市辖区', '610000', '陕西省', '陕西', '610100', '西安市', '610101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610102', '新城区', '610000', '陕西省', '陕西', '610100', '西安市', '610102', '新城区', '3', '西北');
INSERT INTO `city` VALUES ('610103', '碑林区', '610000', '陕西省', '陕西', '610100', '西安市', '610103', '碑林区', '3', '西北');
INSERT INTO `city` VALUES ('610104', '莲湖区', '610000', '陕西省', '陕西', '610100', '西安市', '610104', '莲湖区', '3', '西北');
INSERT INTO `city` VALUES ('610111', '灞桥区', '610000', '陕西省', '陕西', '610100', '西安市', '610111', '灞桥区', '3', '西北');
INSERT INTO `city` VALUES ('610112', '未央区', '610000', '陕西省', '陕西', '610100', '西安市', '610112', '未央区', '3', '西北');
INSERT INTO `city` VALUES ('610113', '雁塔区', '610000', '陕西省', '陕西', '610100', '西安市', '610113', '雁塔区', '3', '西北');
INSERT INTO `city` VALUES ('610114', '阎良区', '610000', '陕西省', '陕西', '610100', '西安市', '610114', '阎良区', '3', '西北');
INSERT INTO `city` VALUES ('610115', '临潼区', '610000', '陕西省', '陕西', '610100', '西安市', '610115', '临潼区', '3', '西北');
INSERT INTO `city` VALUES ('610116', '长安区', '610000', '陕西省', '陕西', '610100', '西安市', '610116', '长安区', '3', '西北');
INSERT INTO `city` VALUES ('610122', '蓝田县', '610000', '陕西省', '陕西', '610100', '西安市', '610122', '蓝田县', '3', '西北');
INSERT INTO `city` VALUES ('610124', '周至县', '610000', '陕西省', '陕西', '610100', '西安市', '610124', '周至县', '3', '西北');
INSERT INTO `city` VALUES ('610125', '户县', '610000', '陕西省', '陕西', '610100', '西安市', '610125', '户县', '3', '西北');
INSERT INTO `city` VALUES ('610126', '高陵县', '610000', '陕西省', '陕西', '610100', '西安市', '610126', '高陵县', '3', '西北');
INSERT INTO `city` VALUES ('610200', '铜川市', '610000', '陕西省', '陕西', '610200', '铜川市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610201', '市辖区', '610000', '陕西省', '陕西', '610200', '铜川市', '610201', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610202', '王益区', '610000', '陕西省', '陕西', '610200', '铜川市', '610202', '王益区', '3', '西北');
INSERT INTO `city` VALUES ('610203', '印台区', '610000', '陕西省', '陕西', '610200', '铜川市', '610203', '印台区', '3', '西北');
INSERT INTO `city` VALUES ('610204', '耀州区', '610000', '陕西省', '陕西', '610200', '铜川市', '610204', '耀州区', '3', '西北');
INSERT INTO `city` VALUES ('610222', '宜君县', '610000', '陕西省', '陕西', '610200', '铜川市', '610222', '宜君县', '3', '西北');
INSERT INTO `city` VALUES ('610300', '宝鸡市', '610000', '陕西省', '陕西', '610300', '宝鸡市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610301', '市辖区', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610301', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610302', '渭滨区', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610302', '渭滨区', '3', '西北');
INSERT INTO `city` VALUES ('610303', '金台区', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610303', '金台区', '3', '西北');
INSERT INTO `city` VALUES ('610304', '陈仓区', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610304', '陈仓区', '3', '西北');
INSERT INTO `city` VALUES ('610322', '凤翔县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610322', '凤翔县', '3', '西北');
INSERT INTO `city` VALUES ('610323', '岐山县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610323', '岐山县', '3', '西北');
INSERT INTO `city` VALUES ('610324', '扶风县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610324', '扶风县', '3', '西北');
INSERT INTO `city` VALUES ('610326', '眉县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610326', '眉县', '3', '西北');
INSERT INTO `city` VALUES ('610327', '陇县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610327', '陇县', '3', '西北');
INSERT INTO `city` VALUES ('610328', '千阳县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610328', '千阳县', '3', '西北');
INSERT INTO `city` VALUES ('610329', '麟游县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610329', '麟游县', '3', '西北');
INSERT INTO `city` VALUES ('610330', '凤县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610330', '凤县', '3', '西北');
INSERT INTO `city` VALUES ('610331', '太白县', '610000', '陕西省', '陕西', '610300', '宝鸡市', '610331', '太白县', '3', '西北');
INSERT INTO `city` VALUES ('610400', '咸阳市', '610000', '陕西省', '陕西', '610400', '咸阳市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610401', '市辖区', '610000', '陕西省', '陕西', '610400', '咸阳市', '610401', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610402', '秦都区', '610000', '陕西省', '陕西', '610400', '咸阳市', '610402', '秦都区', '3', '西北');
INSERT INTO `city` VALUES ('610403', '杨陵区', '610000', '陕西省', '陕西', '610400', '咸阳市', '610403', '杨陵区', '3', '西北');
INSERT INTO `city` VALUES ('610404', '渭城区', '610000', '陕西省', '陕西', '610400', '咸阳市', '610404', '渭城区', '3', '西北');
INSERT INTO `city` VALUES ('610422', '三原县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610422', '三原县', '3', '西北');
INSERT INTO `city` VALUES ('610423', '泾阳县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610423', '泾阳县', '3', '西北');
INSERT INTO `city` VALUES ('610424', '乾县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610424', '乾县', '3', '西北');
INSERT INTO `city` VALUES ('610425', '礼泉县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610425', '礼泉县', '3', '西北');
INSERT INTO `city` VALUES ('610426', '永寿县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610426', '永寿县', '3', '西北');
INSERT INTO `city` VALUES ('610427', '彬县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610427', '彬县', '3', '西北');
INSERT INTO `city` VALUES ('610428', '长武县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610428', '长武县', '3', '西北');
INSERT INTO `city` VALUES ('610429', '旬邑县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610429', '旬邑县', '3', '西北');
INSERT INTO `city` VALUES ('610430', '淳化县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610430', '淳化县', '3', '西北');
INSERT INTO `city` VALUES ('610431', '武功县', '610000', '陕西省', '陕西', '610400', '咸阳市', '610431', '武功县', '3', '西北');
INSERT INTO `city` VALUES ('610481', '兴平市', '610000', '陕西省', '陕西', '610400', '咸阳市', '610481', '兴平市', '3', '西北');
INSERT INTO `city` VALUES ('610500', '渭南市', '610000', '陕西省', '陕西', '610500', '渭南市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610501', '市辖区', '610000', '陕西省', '陕西', '610500', '渭南市', '610501', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610502', '临渭区', '610000', '陕西省', '陕西', '610500', '渭南市', '610502', '临渭区', '3', '西北');
INSERT INTO `city` VALUES ('610521', '华县', '610000', '陕西省', '陕西', '610500', '渭南市', '610521', '华县', '3', '西北');
INSERT INTO `city` VALUES ('610522', '潼关县', '610000', '陕西省', '陕西', '610500', '渭南市', '610522', '潼关县', '3', '西北');
INSERT INTO `city` VALUES ('610523', '大荔县', '610000', '陕西省', '陕西', '610500', '渭南市', '610523', '大荔县', '3', '西北');
INSERT INTO `city` VALUES ('610524', '合阳县', '610000', '陕西省', '陕西', '610500', '渭南市', '610524', '合阳县', '3', '西北');
INSERT INTO `city` VALUES ('610525', '澄城县', '610000', '陕西省', '陕西', '610500', '渭南市', '610525', '澄城县', '3', '西北');
INSERT INTO `city` VALUES ('610526', '蒲城县', '610000', '陕西省', '陕西', '610500', '渭南市', '610526', '蒲城县', '3', '西北');
INSERT INTO `city` VALUES ('610527', '白水县', '610000', '陕西省', '陕西', '610500', '渭南市', '610527', '白水县', '3', '西北');
INSERT INTO `city` VALUES ('610528', '富平县', '610000', '陕西省', '陕西', '610500', '渭南市', '610528', '富平县', '3', '西北');
INSERT INTO `city` VALUES ('610581', '韩城市', '610000', '陕西省', '陕西', '610500', '渭南市', '610581', '韩城市', '3', '西北');
INSERT INTO `city` VALUES ('610582', '华阴市', '610000', '陕西省', '陕西', '610500', '渭南市', '610582', '华阴市', '3', '西北');
INSERT INTO `city` VALUES ('610600', '延安市', '610000', '陕西省', '陕西', '610600', '延安市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610601', '市辖区', '610000', '陕西省', '陕西', '610600', '延安市', '610601', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610602', '宝塔区', '610000', '陕西省', '陕西', '610600', '延安市', '610602', '宝塔区', '3', '西北');
INSERT INTO `city` VALUES ('610621', '延长县', '610000', '陕西省', '陕西', '610600', '延安市', '610621', '延长县', '3', '西北');
INSERT INTO `city` VALUES ('610622', '延川县', '610000', '陕西省', '陕西', '610600', '延安市', '610622', '延川县', '3', '西北');
INSERT INTO `city` VALUES ('610623', '子长县', '610000', '陕西省', '陕西', '610600', '延安市', '610623', '子长县', '3', '西北');
INSERT INTO `city` VALUES ('610624', '安塞县', '610000', '陕西省', '陕西', '610600', '延安市', '610624', '安塞县', '3', '西北');
INSERT INTO `city` VALUES ('610625', '志丹县', '610000', '陕西省', '陕西', '610600', '延安市', '610625', '志丹县', '3', '西北');
INSERT INTO `city` VALUES ('610626', '吴起县', '610000', '陕西省', '陕西', '610600', '延安市', '610626', '吴起县', '3', '西北');
INSERT INTO `city` VALUES ('610627', '甘泉县', '610000', '陕西省', '陕西', '610600', '延安市', '610627', '甘泉县', '3', '西北');
INSERT INTO `city` VALUES ('610628', '富县', '610000', '陕西省', '陕西', '610600', '延安市', '610628', '富县', '3', '西北');
INSERT INTO `city` VALUES ('610629', '洛川县', '610000', '陕西省', '陕西', '610600', '延安市', '610629', '洛川县', '3', '西北');
INSERT INTO `city` VALUES ('610630', '宜川县', '610000', '陕西省', '陕西', '610600', '延安市', '610630', '宜川县', '3', '西北');
INSERT INTO `city` VALUES ('610631', '黄龙县', '610000', '陕西省', '陕西', '610600', '延安市', '610631', '黄龙县', '3', '西北');
INSERT INTO `city` VALUES ('610632', '黄陵县', '610000', '陕西省', '陕西', '610600', '延安市', '610632', '黄陵县', '3', '西北');
INSERT INTO `city` VALUES ('610700', '汉中市', '610000', '陕西省', '陕西', '610700', '汉中市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610701', '市辖区', '610000', '陕西省', '陕西', '610700', '汉中市', '610701', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610702', '汉台区', '610000', '陕西省', '陕西', '610700', '汉中市', '610702', '汉台区', '3', '西北');
INSERT INTO `city` VALUES ('610721', '南郑县', '610000', '陕西省', '陕西', '610700', '汉中市', '610721', '南郑县', '3', '西北');
INSERT INTO `city` VALUES ('610722', '城固县', '610000', '陕西省', '陕西', '610700', '汉中市', '610722', '城固县', '3', '西北');
INSERT INTO `city` VALUES ('610723', '洋县', '610000', '陕西省', '陕西', '610700', '汉中市', '610723', '洋县', '3', '西北');
INSERT INTO `city` VALUES ('610724', '西乡县', '610000', '陕西省', '陕西', '610700', '汉中市', '610724', '西乡县', '3', '西北');
INSERT INTO `city` VALUES ('610725', '勉县', '610000', '陕西省', '陕西', '610700', '汉中市', '610725', '勉县', '3', '西北');
INSERT INTO `city` VALUES ('610726', '宁强县', '610000', '陕西省', '陕西', '610700', '汉中市', '610726', '宁强县', '3', '西北');
INSERT INTO `city` VALUES ('610727', '略阳县', '610000', '陕西省', '陕西', '610700', '汉中市', '610727', '略阳县', '3', '西北');
INSERT INTO `city` VALUES ('610728', '镇巴县', '610000', '陕西省', '陕西', '610700', '汉中市', '610728', '镇巴县', '3', '西北');
INSERT INTO `city` VALUES ('610729', '留坝县', '610000', '陕西省', '陕西', '610700', '汉中市', '610729', '留坝县', '3', '西北');
INSERT INTO `city` VALUES ('610730', '佛坪县', '610000', '陕西省', '陕西', '610700', '汉中市', '610730', '佛坪县', '3', '西北');
INSERT INTO `city` VALUES ('610800', '榆林市', '610000', '陕西省', '陕西', '610800', '榆林市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610801', '市辖区', '610000', '陕西省', '陕西', '610800', '榆林市', '610801', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610802', '榆阳区', '610000', '陕西省', '陕西', '610800', '榆林市', '610802', '榆阳区', '3', '西北');
INSERT INTO `city` VALUES ('610821', '神木县', '610000', '陕西省', '陕西', '610800', '榆林市', '610821', '神木县', '3', '西北');
INSERT INTO `city` VALUES ('610822', '府谷县', '610000', '陕西省', '陕西', '610800', '榆林市', '610822', '府谷县', '3', '西北');
INSERT INTO `city` VALUES ('610823', '横山县', '610000', '陕西省', '陕西', '610800', '榆林市', '610823', '横山县', '3', '西北');
INSERT INTO `city` VALUES ('610824', '靖边县', '610000', '陕西省', '陕西', '610800', '榆林市', '610824', '靖边县', '3', '西北');
INSERT INTO `city` VALUES ('610825', '定边县', '610000', '陕西省', '陕西', '610800', '榆林市', '610825', '定边县', '3', '西北');
INSERT INTO `city` VALUES ('610826', '绥德县', '610000', '陕西省', '陕西', '610800', '榆林市', '610826', '绥德县', '3', '西北');
INSERT INTO `city` VALUES ('610827', '米脂县', '610000', '陕西省', '陕西', '610800', '榆林市', '610827', '米脂县', '3', '西北');
INSERT INTO `city` VALUES ('610828', '佳县', '610000', '陕西省', '陕西', '610800', '榆林市', '610828', '佳县', '3', '西北');
INSERT INTO `city` VALUES ('610829', '吴堡县', '610000', '陕西省', '陕西', '610800', '榆林市', '610829', '吴堡县', '3', '西北');
INSERT INTO `city` VALUES ('610830', '清涧县', '610000', '陕西省', '陕西', '610800', '榆林市', '610830', '清涧县', '3', '西北');
INSERT INTO `city` VALUES ('610831', '子洲县', '610000', '陕西省', '陕西', '610800', '榆林市', '610831', '子洲县', '3', '西北');
INSERT INTO `city` VALUES ('610900', '安康市', '610000', '陕西省', '陕西', '610900', '安康市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('610901', '市辖区', '610000', '陕西省', '陕西', '610900', '安康市', '610901', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('610902', '汉滨区', '610000', '陕西省', '陕西', '610900', '安康市', '610902', '汉滨区', '3', '西北');
INSERT INTO `city` VALUES ('610921', '汉阴县', '610000', '陕西省', '陕西', '610900', '安康市', '610921', '汉阴县', '3', '西北');
INSERT INTO `city` VALUES ('610922', '石泉县', '610000', '陕西省', '陕西', '610900', '安康市', '610922', '石泉县', '3', '西北');
INSERT INTO `city` VALUES ('610923', '宁陕县', '610000', '陕西省', '陕西', '610900', '安康市', '610923', '宁陕县', '3', '西北');
INSERT INTO `city` VALUES ('610924', '紫阳县', '610000', '陕西省', '陕西', '610900', '安康市', '610924', '紫阳县', '3', '西北');
INSERT INTO `city` VALUES ('610925', '岚皋县', '610000', '陕西省', '陕西', '610900', '安康市', '610925', '岚皋县', '3', '西北');
INSERT INTO `city` VALUES ('610926', '平利县', '610000', '陕西省', '陕西', '610900', '安康市', '610926', '平利县', '3', '西北');
INSERT INTO `city` VALUES ('610927', '镇坪县', '610000', '陕西省', '陕西', '610900', '安康市', '610927', '镇坪县', '3', '西北');
INSERT INTO `city` VALUES ('610928', '旬阳县', '610000', '陕西省', '陕西', '610900', '安康市', '610928', '旬阳县', '3', '西北');
INSERT INTO `city` VALUES ('610929', '白河县', '610000', '陕西省', '陕西', '610900', '安康市', '610929', '白河县', '3', '西北');
INSERT INTO `city` VALUES ('611000', '商洛市', '610000', '陕西省', '陕西', '611000', '商洛市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('611001', '市辖区', '610000', '陕西省', '陕西', '611000', '商洛市', '611001', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('611002', '商州区', '610000', '陕西省', '陕西', '611000', '商洛市', '611002', '商州区', '3', '西北');
INSERT INTO `city` VALUES ('611021', '洛南县', '610000', '陕西省', '陕西', '611000', '商洛市', '611021', '洛南县', '3', '西北');
INSERT INTO `city` VALUES ('611022', '丹凤县', '610000', '陕西省', '陕西', '611000', '商洛市', '611022', '丹凤县', '3', '西北');
INSERT INTO `city` VALUES ('611023', '商南县', '610000', '陕西省', '陕西', '611000', '商洛市', '611023', '商南县', '3', '西北');
INSERT INTO `city` VALUES ('611024', '山阳县', '610000', '陕西省', '陕西', '611000', '商洛市', '611024', '山阳县', '3', '西北');
INSERT INTO `city` VALUES ('611025', '镇安县', '610000', '陕西省', '陕西', '611000', '商洛市', '611025', '镇安县', '3', '西北');
INSERT INTO `city` VALUES ('611026', '柞水县', '610000', '陕西省', '陕西', '611000', '商洛市', '611026', '柞水县', '3', '西北');
INSERT INTO `city` VALUES ('620000', '甘肃省', '620000', '甘肃省', '甘肃', '0', '', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620100', '兰州市', '620000', '甘肃省', '甘肃', '620100', '兰州市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620101', '市辖区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620102', '城关区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620102', '城关区', '3', '西北');
INSERT INTO `city` VALUES ('620103', '七里河区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620103', '七里河区', '3', '西北');
INSERT INTO `city` VALUES ('620104', '西固区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620104', '西固区', '3', '西北');
INSERT INTO `city` VALUES ('620105', '安宁区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620105', '安宁区', '3', '西北');
INSERT INTO `city` VALUES ('620111', '红古区', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620111', '红古区', '3', '西北');
INSERT INTO `city` VALUES ('620121', '永登县', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620121', '永登县', '3', '西北');
INSERT INTO `city` VALUES ('620122', '皋兰县', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620122', '皋兰县', '3', '西北');
INSERT INTO `city` VALUES ('620123', '榆中县', '620000', '甘肃省', '甘肃', '620100', '兰州市', '620123', '榆中县', '3', '西北');
INSERT INTO `city` VALUES ('620200', '嘉峪关市', '620000', '甘肃省', '甘肃', '620200', '嘉峪关市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620201', '市辖区', '620000', '甘肃省', '甘肃', '620200', '嘉峪关市', '620201', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620300', '金昌市', '620000', '甘肃省', '甘肃', '620300', '金昌市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620301', '市辖区', '620000', '甘肃省', '甘肃', '620300', '金昌市', '620301', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620302', '金川区', '620000', '甘肃省', '甘肃', '620300', '金昌市', '620302', '金川区', '3', '西北');
INSERT INTO `city` VALUES ('620321', '永昌县', '620000', '甘肃省', '甘肃', '620300', '金昌市', '620321', '永昌县', '3', '西北');
INSERT INTO `city` VALUES ('620400', '白银市', '620000', '甘肃省', '甘肃', '620400', '白银市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620401', '市辖区', '620000', '甘肃省', '甘肃', '620400', '白银市', '620401', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620402', '白银区', '620000', '甘肃省', '甘肃', '620400', '白银市', '620402', '白银区', '3', '西北');
INSERT INTO `city` VALUES ('620403', '平川区', '620000', '甘肃省', '甘肃', '620400', '白银市', '620403', '平川区', '3', '西北');
INSERT INTO `city` VALUES ('620421', '靖远县', '620000', '甘肃省', '甘肃', '620400', '白银市', '620421', '靖远县', '3', '西北');
INSERT INTO `city` VALUES ('620422', '会宁县', '620000', '甘肃省', '甘肃', '620400', '白银市', '620422', '会宁县', '3', '西北');
INSERT INTO `city` VALUES ('620423', '景泰县', '620000', '甘肃省', '甘肃', '620400', '白银市', '620423', '景泰县', '3', '西北');
INSERT INTO `city` VALUES ('620500', '天水市', '620000', '甘肃省', '甘肃', '620500', '天水市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620501', '市辖区', '620000', '甘肃省', '甘肃', '620500', '天水市', '620501', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620502', '秦州区', '620000', '甘肃省', '甘肃', '620500', '天水市', '620502', '秦州区', '3', '西北');
INSERT INTO `city` VALUES ('620503', '麦积区', '620000', '甘肃省', '甘肃', '620500', '天水市', '620503', '麦积区', '3', '西北');
INSERT INTO `city` VALUES ('620521', '清水县', '620000', '甘肃省', '甘肃', '620500', '天水市', '620521', '清水县', '3', '西北');
INSERT INTO `city` VALUES ('620522', '秦安县', '620000', '甘肃省', '甘肃', '620500', '天水市', '620522', '秦安县', '3', '西北');
INSERT INTO `city` VALUES ('620523', '甘谷县', '620000', '甘肃省', '甘肃', '620500', '天水市', '620523', '甘谷县', '3', '西北');
INSERT INTO `city` VALUES ('620524', '武山县', '620000', '甘肃省', '甘肃', '620500', '天水市', '620524', '武山县', '3', '西北');
INSERT INTO `city` VALUES ('620525', '张家川回族自治县', '620000', '甘肃省', '甘肃', '620500', '天水市', '620525', '张家川回族自治县', '3', '西北');
INSERT INTO `city` VALUES ('620600', '武威市', '620000', '甘肃省', '甘肃', '620600', '武威市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620601', '市辖区', '620000', '甘肃省', '甘肃', '620600', '武威市', '620601', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620602', '凉州区', '620000', '甘肃省', '甘肃', '620600', '武威市', '620602', '凉州区', '3', '西北');
INSERT INTO `city` VALUES ('620621', '民勤县', '620000', '甘肃省', '甘肃', '620600', '武威市', '620621', '民勤县', '3', '西北');
INSERT INTO `city` VALUES ('620622', '古浪县', '620000', '甘肃省', '甘肃', '620600', '武威市', '620622', '古浪县', '3', '西北');
INSERT INTO `city` VALUES ('620623', '天祝藏族自治县', '620000', '甘肃省', '甘肃', '620600', '武威市', '620623', '天祝藏族自治县', '3', '西北');
INSERT INTO `city` VALUES ('620700', '张掖市', '620000', '甘肃省', '甘肃', '620700', '张掖市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620701', '市辖区', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620701', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620702', '甘州区', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620702', '甘州区', '3', '西北');
INSERT INTO `city` VALUES ('620721', '肃南裕固族自治县', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620721', '肃南裕固族自治县', '3', '西北');
INSERT INTO `city` VALUES ('620722', '民乐县', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620722', '民乐县', '3', '西北');
INSERT INTO `city` VALUES ('620723', '临泽县', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620723', '临泽县', '3', '西北');
INSERT INTO `city` VALUES ('620724', '高台县', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620724', '高台县', '3', '西北');
INSERT INTO `city` VALUES ('620725', '山丹县', '620000', '甘肃省', '甘肃', '620700', '张掖市', '620725', '山丹县', '3', '西北');
INSERT INTO `city` VALUES ('620800', '平凉市', '620000', '甘肃省', '甘肃', '620800', '平凉市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620801', '市辖区', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620801', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620802', '崆峒区', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620802', '崆峒区', '3', '西北');
INSERT INTO `city` VALUES ('620821', '泾川县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620821', '泾川县', '3', '西北');
INSERT INTO `city` VALUES ('620822', '灵台县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620822', '灵台县', '3', '西北');
INSERT INTO `city` VALUES ('620823', '崇信县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620823', '崇信县', '3', '西北');
INSERT INTO `city` VALUES ('620824', '华亭县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620824', '华亭县', '3', '西北');
INSERT INTO `city` VALUES ('620825', '庄浪县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620825', '庄浪县', '3', '西北');
INSERT INTO `city` VALUES ('620826', '静宁县', '620000', '甘肃省', '甘肃', '620800', '平凉市', '620826', '静宁县', '3', '西北');
INSERT INTO `city` VALUES ('620900', '酒泉市', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('620901', '市辖区', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620901', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('620902', '肃州区', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620902', '肃州区', '3', '西北');
INSERT INTO `city` VALUES ('620921', '金塔县', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620921', '金塔县', '3', '西北');
INSERT INTO `city` VALUES ('620922', '瓜州县', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620922', '瓜州县', '3', '西北');
INSERT INTO `city` VALUES ('620923', '肃北蒙古族自治县', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620923', '肃北蒙古族自治县', '3', '西北');
INSERT INTO `city` VALUES ('620924', '阿克塞哈萨克族自治县', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620924', '阿克塞哈萨克族自治县', '3', '西北');
INSERT INTO `city` VALUES ('620981', '玉门市', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620981', '玉门市', '3', '西北');
INSERT INTO `city` VALUES ('620982', '敦煌市', '620000', '甘肃省', '甘肃', '620900', '酒泉市', '620982', '敦煌市', '3', '西北');
INSERT INTO `city` VALUES ('621000', '庆阳市', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('621001', '市辖区', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621001', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('621002', '西峰区', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621002', '西峰区', '3', '西北');
INSERT INTO `city` VALUES ('621021', '庆城县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621021', '庆城县', '3', '西北');
INSERT INTO `city` VALUES ('621022', '环县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621022', '环县', '3', '西北');
INSERT INTO `city` VALUES ('621023', '华池县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621023', '华池县', '3', '西北');
INSERT INTO `city` VALUES ('621024', '合水县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621024', '合水县', '3', '西北');
INSERT INTO `city` VALUES ('621025', '正宁县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621025', '正宁县', '3', '西北');
INSERT INTO `city` VALUES ('621026', '宁县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621026', '宁县', '3', '西北');
INSERT INTO `city` VALUES ('621027', '镇原县', '620000', '甘肃省', '甘肃', '621000', '庆阳市', '621027', '镇原县', '3', '西北');
INSERT INTO `city` VALUES ('621100', '定西市', '620000', '甘肃省', '甘肃', '621100', '定西市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('621101', '市辖区', '620000', '甘肃省', '甘肃', '621100', '定西市', '621101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('621102', '安定区', '620000', '甘肃省', '甘肃', '621100', '定西市', '621102', '安定区', '3', '西北');
INSERT INTO `city` VALUES ('621121', '通渭县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621121', '通渭县', '3', '西北');
INSERT INTO `city` VALUES ('621122', '陇西县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621122', '陇西县', '3', '西北');
INSERT INTO `city` VALUES ('621123', '渭源县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621123', '渭源县', '3', '西北');
INSERT INTO `city` VALUES ('621124', '临洮县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621124', '临洮县', '3', '西北');
INSERT INTO `city` VALUES ('621125', '漳县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621125', '漳县', '3', '西北');
INSERT INTO `city` VALUES ('621126', '岷县', '620000', '甘肃省', '甘肃', '621100', '定西市', '621126', '岷县', '3', '西北');
INSERT INTO `city` VALUES ('621200', '陇南市', '620000', '甘肃省', '甘肃', '621200', '陇南市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('621201', '市辖区', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621201', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('621202', '武都区', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621202', '武都区', '3', '西北');
INSERT INTO `city` VALUES ('621221', '成县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621221', '成县', '3', '西北');
INSERT INTO `city` VALUES ('621222', '文县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621222', '文县', '3', '西北');
INSERT INTO `city` VALUES ('621223', '宕昌县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621223', '宕昌县', '3', '西北');
INSERT INTO `city` VALUES ('621224', '康县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621224', '康县', '3', '西北');
INSERT INTO `city` VALUES ('621225', '西和县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621225', '西和县', '3', '西北');
INSERT INTO `city` VALUES ('621226', '礼县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621226', '礼县', '3', '西北');
INSERT INTO `city` VALUES ('621227', '徽县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621227', '徽县', '3', '西北');
INSERT INTO `city` VALUES ('621228', '两当县', '620000', '甘肃省', '甘肃', '621200', '陇南市', '621228', '两当县', '3', '西北');
INSERT INTO `city` VALUES ('622900', '临夏回族自治州', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('622901', '临夏市', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622901', '临夏市', '3', '西北');
INSERT INTO `city` VALUES ('622921', '临夏县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622921', '临夏县', '3', '西北');
INSERT INTO `city` VALUES ('622922', '康乐县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622922', '康乐县', '3', '西北');
INSERT INTO `city` VALUES ('622923', '永靖县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622923', '永靖县', '3', '西北');
INSERT INTO `city` VALUES ('622924', '广河县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622924', '广河县', '3', '西北');
INSERT INTO `city` VALUES ('622925', '和政县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622925', '和政县', '3', '西北');
INSERT INTO `city` VALUES ('622926', '东乡族自治县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622926', '东乡族自治县', '3', '西北');
INSERT INTO `city` VALUES ('622927', '积石山保安族东乡族撒拉族自治县', '620000', '甘肃省', '甘肃', '622900', '临夏回族自治州', '622927', '积石山保安族东乡族撒拉族自治县', '3', '西北');
INSERT INTO `city` VALUES ('623000', '甘南藏族自治州', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('623001', '合作市', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623001', '合作市', '3', '西北');
INSERT INTO `city` VALUES ('623021', '临潭县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623021', '临潭县', '3', '西北');
INSERT INTO `city` VALUES ('623022', '卓尼县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623022', '卓尼县', '3', '西北');
INSERT INTO `city` VALUES ('623023', '舟曲县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623023', '舟曲县', '3', '西北');
INSERT INTO `city` VALUES ('623024', '迭部县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623024', '迭部县', '3', '西北');
INSERT INTO `city` VALUES ('623025', '玛曲县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623025', '玛曲县', '3', '西北');
INSERT INTO `city` VALUES ('623026', '碌曲县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623026', '碌曲县', '3', '西北');
INSERT INTO `city` VALUES ('623027', '夏河县', '620000', '甘肃省', '甘肃', '623000', '甘南藏族自治州', '623027', '夏河县', '3', '西北');
INSERT INTO `city` VALUES ('630000', '青海省', '630000', '青海省', '青海', '0', '', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('630100', '西宁市', '630000', '青海省', '青海', '630100', '西宁市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('630101', '市辖区', '630000', '青海省', '青海', '630100', '西宁市', '630101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('630102', '城东区', '630000', '青海省', '青海', '630100', '西宁市', '630102', '城东区', '3', '西北');
INSERT INTO `city` VALUES ('630103', '城中区', '630000', '青海省', '青海', '630100', '西宁市', '630103', '城中区', '3', '西北');
INSERT INTO `city` VALUES ('630104', '城西区', '630000', '青海省', '青海', '630100', '西宁市', '630104', '城西区', '3', '西北');
INSERT INTO `city` VALUES ('630105', '城北区', '630000', '青海省', '青海', '630100', '西宁市', '630105', '城北区', '3', '西北');
INSERT INTO `city` VALUES ('630121', '大通回族土族自治县', '630000', '青海省', '青海', '630100', '西宁市', '630121', '大通回族土族自治县', '3', '西北');
INSERT INTO `city` VALUES ('630122', '湟中县', '630000', '青海省', '青海', '630100', '西宁市', '630122', '湟中县', '3', '西北');
INSERT INTO `city` VALUES ('630123', '湟源县', '630000', '青海省', '青海', '630100', '西宁市', '630123', '湟源县', '3', '西北');
INSERT INTO `city` VALUES ('630200', '海东市', '630000', '青海省', '青海', '630200', '海东市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('630202', '乐都区', '630000', '青海省', '青海', '630200', '海东市', '630202', '乐都区', '3', '西北');
INSERT INTO `city` VALUES ('630221', '平安县', '630000', '青海省', '青海', '630200', '海东市', '630221', '平安县', '3', '西北');
INSERT INTO `city` VALUES ('630222', '民和回族土族自治县', '630000', '青海省', '青海', '630200', '海东市', '630222', '民和回族土族自治县', '3', '西北');
INSERT INTO `city` VALUES ('630223', '互助土族自治县', '630000', '青海省', '青海', '630200', '海东市', '630223', '互助土族自治县', '3', '西北');
INSERT INTO `city` VALUES ('630224', '化隆回族自治县', '630000', '青海省', '青海', '630200', '海东市', '630224', '化隆回族自治县', '3', '西北');
INSERT INTO `city` VALUES ('630225', '循化撒拉族自治县', '630000', '青海省', '青海', '630200', '海东市', '630225', '循化撒拉族自治县', '3', '西北');
INSERT INTO `city` VALUES ('632200', '海北藏族自治州', '630000', '青海省', '青海', '632200', '海北藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632221', '门源回族自治县', '630000', '青海省', '青海', '632200', '海北藏族自治州', '632221', '门源回族自治县', '3', '西北');
INSERT INTO `city` VALUES ('632222', '祁连县', '630000', '青海省', '青海', '632200', '海北藏族自治州', '632222', '祁连县', '3', '西北');
INSERT INTO `city` VALUES ('632223', '海晏县', '630000', '青海省', '青海', '632200', '海北藏族自治州', '632223', '海晏县', '3', '西北');
INSERT INTO `city` VALUES ('632224', '刚察县', '630000', '青海省', '青海', '632200', '海北藏族自治州', '632224', '刚察县', '3', '西北');
INSERT INTO `city` VALUES ('632300', '黄南藏族自治州', '630000', '青海省', '青海', '632300', '黄南藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632321', '同仁县', '630000', '青海省', '青海', '632300', '黄南藏族自治州', '632321', '同仁县', '3', '西北');
INSERT INTO `city` VALUES ('632322', '尖扎县', '630000', '青海省', '青海', '632300', '黄南藏族自治州', '632322', '尖扎县', '3', '西北');
INSERT INTO `city` VALUES ('632323', '泽库县', '630000', '青海省', '青海', '632300', '黄南藏族自治州', '632323', '泽库县', '3', '西北');
INSERT INTO `city` VALUES ('632324', '河南蒙古族自治县', '630000', '青海省', '青海', '632300', '黄南藏族自治州', '632324', '河南蒙古族自治县', '3', '西北');
INSERT INTO `city` VALUES ('632500', '海南藏族自治州', '630000', '青海省', '青海', '632500', '海南藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632521', '共和县', '630000', '青海省', '青海', '632500', '海南藏族自治州', '632521', '共和县', '3', '西北');
INSERT INTO `city` VALUES ('632522', '同德县', '630000', '青海省', '青海', '632500', '海南藏族自治州', '632522', '同德县', '3', '西北');
INSERT INTO `city` VALUES ('632523', '贵德县', '630000', '青海省', '青海', '632500', '海南藏族自治州', '632523', '贵德县', '3', '西北');
INSERT INTO `city` VALUES ('632524', '兴海县', '630000', '青海省', '青海', '632500', '海南藏族自治州', '632524', '兴海县', '3', '西北');
INSERT INTO `city` VALUES ('632525', '贵南县', '630000', '青海省', '青海', '632500', '海南藏族自治州', '632525', '贵南县', '3', '西北');
INSERT INTO `city` VALUES ('632600', '果洛藏族自治州', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632621', '玛沁县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632621', '玛沁县', '3', '西北');
INSERT INTO `city` VALUES ('632622', '班玛县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632622', '班玛县', '3', '西北');
INSERT INTO `city` VALUES ('632623', '甘德县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632623', '甘德县', '3', '西北');
INSERT INTO `city` VALUES ('632624', '达日县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632624', '达日县', '3', '西北');
INSERT INTO `city` VALUES ('632625', '久治县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632625', '久治县', '3', '西北');
INSERT INTO `city` VALUES ('632626', '玛多县', '630000', '青海省', '青海', '632600', '果洛藏族自治州', '632626', '玛多县', '3', '西北');
INSERT INTO `city` VALUES ('632700', '玉树藏族自治州', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632701', '玉树市', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632701', '玉树市', '3', '西北');
INSERT INTO `city` VALUES ('632722', '杂多县', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632722', '杂多县', '3', '西北');
INSERT INTO `city` VALUES ('632723', '称多县', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632723', '称多县', '3', '西北');
INSERT INTO `city` VALUES ('632724', '治多县', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632724', '治多县', '3', '西北');
INSERT INTO `city` VALUES ('632725', '囊谦县', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632725', '囊谦县', '3', '西北');
INSERT INTO `city` VALUES ('632726', '曲麻莱县', '630000', '青海省', '青海', '632700', '玉树藏族自治州', '632726', '曲麻莱县', '3', '西北');
INSERT INTO `city` VALUES ('632800', '海西蒙古族藏族自治州', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('632801', '格尔木市', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '632801', '格尔木市', '3', '西北');
INSERT INTO `city` VALUES ('632802', '德令哈市', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '632802', '德令哈市', '3', '西北');
INSERT INTO `city` VALUES ('632821', '乌兰县', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '632821', '乌兰县', '3', '西北');
INSERT INTO `city` VALUES ('632822', '都兰县', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '632822', '都兰县', '3', '西北');
INSERT INTO `city` VALUES ('632823', '天峻县', '630000', '青海省', '青海', '632800', '海西蒙古族藏族自治州', '632823', '天峻县', '3', '西北');
INSERT INTO `city` VALUES ('640000', '宁夏回族自治区', '640000', '宁夏回族自治区', '宁夏', '0', '', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640100', '银川市', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640101', '市辖区', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('640104', '兴庆区', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640104', '兴庆区', '3', '西北');
INSERT INTO `city` VALUES ('640105', '西夏区', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640105', '西夏区', '3', '西北');
INSERT INTO `city` VALUES ('640106', '金凤区', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640106', '金凤区', '3', '西北');
INSERT INTO `city` VALUES ('640121', '永宁县', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640121', '永宁县', '3', '西北');
INSERT INTO `city` VALUES ('640122', '贺兰县', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640122', '贺兰县', '3', '西北');
INSERT INTO `city` VALUES ('640181', '灵武市', '640000', '宁夏回族自治区', '宁夏', '640100', '银川市', '640181', '灵武市', '3', '西北');
INSERT INTO `city` VALUES ('640200', '石嘴山市', '640000', '宁夏回族自治区', '宁夏', '640200', '石嘴山市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640201', '市辖区', '640000', '宁夏回族自治区', '宁夏', '640200', '石嘴山市', '640201', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('640202', '大武口区', '640000', '宁夏回族自治区', '宁夏', '640200', '石嘴山市', '640202', '大武口区', '3', '西北');
INSERT INTO `city` VALUES ('640205', '惠农区', '640000', '宁夏回族自治区', '宁夏', '640200', '石嘴山市', '640205', '惠农区', '3', '西北');
INSERT INTO `city` VALUES ('640221', '平罗县', '640000', '宁夏回族自治区', '宁夏', '640200', '石嘴山市', '640221', '平罗县', '3', '西北');
INSERT INTO `city` VALUES ('640300', '吴忠市', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640301', '市辖区', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640301', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('640302', '利通区', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640302', '利通区', '3', '西北');
INSERT INTO `city` VALUES ('640303', '红寺堡区', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640303', '红寺堡区', '3', '西北');
INSERT INTO `city` VALUES ('640323', '盐池县', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640323', '盐池县', '3', '西北');
INSERT INTO `city` VALUES ('640324', '同心县', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640324', '同心县', '3', '西北');
INSERT INTO `city` VALUES ('640381', '青铜峡市', '640000', '宁夏回族自治区', '宁夏', '640300', '吴忠市', '640381', '青铜峡市', '3', '西北');
INSERT INTO `city` VALUES ('640400', '固原市', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640401', '市辖区', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640401', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('640402', '原州区', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640402', '原州区', '3', '西北');
INSERT INTO `city` VALUES ('640422', '西吉县', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640422', '西吉县', '3', '西北');
INSERT INTO `city` VALUES ('640423', '隆德县', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640423', '隆德县', '3', '西北');
INSERT INTO `city` VALUES ('640424', '泾源县', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640424', '泾源县', '3', '西北');
INSERT INTO `city` VALUES ('640425', '彭阳县', '640000', '宁夏回族自治区', '宁夏', '640400', '固原市', '640425', '彭阳县', '3', '西北');
INSERT INTO `city` VALUES ('640500', '中卫市', '640000', '宁夏回族自治区', '宁夏', '640500', '中卫市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('640501', '市辖区', '640000', '宁夏回族自治区', '宁夏', '640500', '中卫市', '640501', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('640502', '沙坡头区', '640000', '宁夏回族自治区', '宁夏', '640500', '中卫市', '640502', '沙坡头区', '3', '西北');
INSERT INTO `city` VALUES ('640521', '中宁县', '640000', '宁夏回族自治区', '宁夏', '640500', '中卫市', '640521', '中宁县', '3', '西北');
INSERT INTO `city` VALUES ('640522', '海原县', '640000', '宁夏回族自治区', '宁夏', '640500', '中卫市', '640522', '海原县', '3', '西北');
INSERT INTO `city` VALUES ('650000', '新疆维吾尔自治区', '650000', '新疆维吾尔自治区', '新疆', '0', '', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('650100', '乌鲁木齐市', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('650101', '市辖区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650101', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('650102', '天山区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650102', '天山区', '3', '西北');
INSERT INTO `city` VALUES ('650103', '沙依巴克区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650103', '沙依巴克区', '3', '西北');
INSERT INTO `city` VALUES ('650104', '新市区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650104', '新市区', '3', '西北');
INSERT INTO `city` VALUES ('650105', '水磨沟区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650105', '水磨沟区', '3', '西北');
INSERT INTO `city` VALUES ('650106', '头屯河区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650106', '头屯河区', '3', '西北');
INSERT INTO `city` VALUES ('650107', '达坂城区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650107', '达坂城区', '3', '西北');
INSERT INTO `city` VALUES ('650109', '米东区', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650109', '米东区', '3', '西北');
INSERT INTO `city` VALUES ('650121', '乌鲁木齐县', '650000', '新疆维吾尔自治区', '新疆', '650100', '乌鲁木齐市', '650121', '乌鲁木齐县', '3', '西北');
INSERT INTO `city` VALUES ('650200', '克拉玛依市', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('650201', '市辖区', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '650201', '市辖区', '3', '西北');
INSERT INTO `city` VALUES ('650202', '独山子区', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '650202', '独山子区', '3', '西北');
INSERT INTO `city` VALUES ('650203', '克拉玛依区', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '650203', '克拉玛依区', '3', '西北');
INSERT INTO `city` VALUES ('650204', '白碱滩区', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '650204', '白碱滩区', '3', '西北');
INSERT INTO `city` VALUES ('650205', '乌尔禾区', '650000', '新疆维吾尔自治区', '新疆', '650200', '克拉玛依市', '650205', '乌尔禾区', '3', '西北');
INSERT INTO `city` VALUES ('652100', '吐鲁番地区', '650000', '新疆维吾尔自治区', '新疆', '652100', '吐鲁番地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652101', '吐鲁番市', '650000', '新疆维吾尔自治区', '新疆', '652100', '吐鲁番地区', '652101', '吐鲁番市', '3', '西北');
INSERT INTO `city` VALUES ('652122', '鄯善县', '650000', '新疆维吾尔自治区', '新疆', '652100', '吐鲁番地区', '652122', '鄯善县', '3', '西北');
INSERT INTO `city` VALUES ('652123', '托克逊县', '650000', '新疆维吾尔自治区', '新疆', '652100', '吐鲁番地区', '652123', '托克逊县', '3', '西北');
INSERT INTO `city` VALUES ('652200', '哈密地区', '650000', '新疆维吾尔自治区', '新疆', '652200', '哈密地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652201', '哈密市', '650000', '新疆维吾尔自治区', '新疆', '652200', '哈密地区', '652201', '哈密市', '3', '西北');
INSERT INTO `city` VALUES ('652222', '巴里坤哈萨克自治县', '650000', '新疆维吾尔自治区', '新疆', '652200', '哈密地区', '652222', '巴里坤哈萨克自治县', '3', '西北');
INSERT INTO `city` VALUES ('652223', '伊吾县', '650000', '新疆维吾尔自治区', '新疆', '652200', '哈密地区', '652223', '伊吾县', '3', '西北');
INSERT INTO `city` VALUES ('652300', '昌吉回族自治州', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652301', '昌吉市', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652301', '昌吉市', '3', '西北');
INSERT INTO `city` VALUES ('652302', '阜康市', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652302', '阜康市', '3', '西北');
INSERT INTO `city` VALUES ('652323', '呼图壁县', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652323', '呼图壁县', '3', '西北');
INSERT INTO `city` VALUES ('652324', '玛纳斯县', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652324', '玛纳斯县', '3', '西北');
INSERT INTO `city` VALUES ('652325', '奇台县', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652325', '奇台县', '3', '西北');
INSERT INTO `city` VALUES ('652327', '吉木萨尔县', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652327', '吉木萨尔县', '3', '西北');
INSERT INTO `city` VALUES ('652328', '木垒哈萨克自治县', '650000', '新疆维吾尔自治区', '新疆', '652300', '昌吉回族自治州', '652328', '木垒哈萨克自治县', '3', '西北');
INSERT INTO `city` VALUES ('652700', '博尔塔拉蒙古自治州', '650000', '新疆维吾尔自治区', '新疆', '652700', '博尔塔拉蒙古自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652701', '博乐市', '650000', '新疆维吾尔自治区', '新疆', '652700', '博尔塔拉蒙古自治州', '652701', '博乐市', '3', '西北');
INSERT INTO `city` VALUES ('652702', '阿拉山口市', '650000', '新疆维吾尔自治区', '新疆', '652700', '博尔塔拉蒙古自治州', '652702', '阿拉山口市', '3', '西北');
INSERT INTO `city` VALUES ('652722', '精河县', '650000', '新疆维吾尔自治区', '新疆', '652700', '博尔塔拉蒙古自治州', '652722', '精河县', '3', '西北');
INSERT INTO `city` VALUES ('652723', '温泉县', '650000', '新疆维吾尔自治区', '新疆', '652700', '博尔塔拉蒙古自治州', '652723', '温泉县', '3', '西北');
INSERT INTO `city` VALUES ('652800', '巴音郭楞蒙古自治州', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652801', '库尔勒市', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652801', '库尔勒市', '3', '西北');
INSERT INTO `city` VALUES ('652822', '轮台县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652822', '轮台县', '3', '西北');
INSERT INTO `city` VALUES ('652823', '尉犁县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652823', '尉犁县', '3', '西北');
INSERT INTO `city` VALUES ('652824', '若羌县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652824', '若羌县', '3', '西北');
INSERT INTO `city` VALUES ('652825', '且末县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652825', '且末县', '3', '西北');
INSERT INTO `city` VALUES ('652826', '焉耆回族自治县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652826', '焉耆回族自治县', '3', '西北');
INSERT INTO `city` VALUES ('652827', '和静县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652827', '和静县', '3', '西北');
INSERT INTO `city` VALUES ('652828', '和硕县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652828', '和硕县', '3', '西北');
INSERT INTO `city` VALUES ('652829', '博湖县', '650000', '新疆维吾尔自治区', '新疆', '652800', '巴音郭楞蒙古自治州', '652829', '博湖县', '3', '西北');
INSERT INTO `city` VALUES ('652900', '阿克苏地区', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('652901', '阿克苏市', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652901', '阿克苏市', '3', '西北');
INSERT INTO `city` VALUES ('652922', '温宿县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652922', '温宿县', '3', '西北');
INSERT INTO `city` VALUES ('652923', '库车县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652923', '库车县', '3', '西北');
INSERT INTO `city` VALUES ('652924', '沙雅县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652924', '沙雅县', '3', '西北');
INSERT INTO `city` VALUES ('652925', '新和县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652925', '新和县', '3', '西北');
INSERT INTO `city` VALUES ('652926', '拜城县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652926', '拜城县', '3', '西北');
INSERT INTO `city` VALUES ('652927', '乌什县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652927', '乌什县', '3', '西北');
INSERT INTO `city` VALUES ('652928', '阿瓦提县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652928', '阿瓦提县', '3', '西北');
INSERT INTO `city` VALUES ('652929', '柯坪县', '650000', '新疆维吾尔自治区', '新疆', '652900', '阿克苏地区', '652929', '柯坪县', '3', '西北');
INSERT INTO `city` VALUES ('653000', '克孜勒苏柯尔克孜自治州', '650000', '新疆维吾尔自治区', '新疆', '653000', '克孜勒苏柯尔克孜自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('653001', '阿图什市', '650000', '新疆维吾尔自治区', '新疆', '653000', '克孜勒苏柯尔克孜自治州', '653001', '阿图什市', '3', '西北');
INSERT INTO `city` VALUES ('653022', '阿克陶县', '650000', '新疆维吾尔自治区', '新疆', '653000', '克孜勒苏柯尔克孜自治州', '653022', '阿克陶县', '3', '西北');
INSERT INTO `city` VALUES ('653023', '阿合奇县', '650000', '新疆维吾尔自治区', '新疆', '653000', '克孜勒苏柯尔克孜自治州', '653023', '阿合奇县', '3', '西北');
INSERT INTO `city` VALUES ('653024', '乌恰县', '650000', '新疆维吾尔自治区', '新疆', '653000', '克孜勒苏柯尔克孜自治州', '653024', '乌恰县', '3', '西北');
INSERT INTO `city` VALUES ('653100', '喀什地区', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('653101', '喀什市', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653101', '喀什市', '3', '西北');
INSERT INTO `city` VALUES ('653121', '疏附县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653121', '疏附县', '3', '西北');
INSERT INTO `city` VALUES ('653122', '疏勒县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653122', '疏勒县', '3', '西北');
INSERT INTO `city` VALUES ('653123', '英吉沙县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653123', '英吉沙县', '3', '西北');
INSERT INTO `city` VALUES ('653124', '泽普县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653124', '泽普县', '3', '西北');
INSERT INTO `city` VALUES ('653125', '莎车县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653125', '莎车县', '3', '西北');
INSERT INTO `city` VALUES ('653126', '叶城县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653126', '叶城县', '3', '西北');
INSERT INTO `city` VALUES ('653127', '麦盖提县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653127', '麦盖提县', '3', '西北');
INSERT INTO `city` VALUES ('653128', '岳普湖县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653128', '岳普湖县', '3', '西北');
INSERT INTO `city` VALUES ('653129', '伽师县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653129', '伽师县', '3', '西北');
INSERT INTO `city` VALUES ('653130', '巴楚县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653130', '巴楚县', '3', '西北');
INSERT INTO `city` VALUES ('653131', '塔什库尔干塔吉克自治县', '650000', '新疆维吾尔自治区', '新疆', '653100', '喀什地区', '653131', '塔什库尔干塔吉克自治县', '3', '西北');
INSERT INTO `city` VALUES ('653200', '和田地区', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('653201', '和田市', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653201', '和田市', '3', '西北');
INSERT INTO `city` VALUES ('653221', '和田县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653221', '和田县', '3', '西北');
INSERT INTO `city` VALUES ('653222', '墨玉县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653222', '墨玉县', '3', '西北');
INSERT INTO `city` VALUES ('653223', '皮山县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653223', '皮山县', '3', '西北');
INSERT INTO `city` VALUES ('653224', '洛浦县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653224', '洛浦县', '3', '西北');
INSERT INTO `city` VALUES ('653225', '策勒县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653225', '策勒县', '3', '西北');
INSERT INTO `city` VALUES ('653226', '于田县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653226', '于田县', '3', '西北');
INSERT INTO `city` VALUES ('653227', '民丰县', '650000', '新疆维吾尔自治区', '新疆', '653200', '和田地区', '653227', '民丰县', '3', '西北');
INSERT INTO `city` VALUES ('654000', '伊犁哈萨克自治州', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('654002', '伊宁市', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654002', '伊宁市', '3', '西北');
INSERT INTO `city` VALUES ('654003', '奎屯市', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654003', '奎屯市', '3', '西北');
INSERT INTO `city` VALUES ('654021', '伊宁县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654021', '伊宁县', '3', '西北');
INSERT INTO `city` VALUES ('654022', '察布查尔锡伯自治县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654022', '察布查尔锡伯自治县', '3', '西北');
INSERT INTO `city` VALUES ('654023', '霍城县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654023', '霍城县', '3', '西北');
INSERT INTO `city` VALUES ('654024', '巩留县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654024', '巩留县', '3', '西北');
INSERT INTO `city` VALUES ('654025', '新源县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654025', '新源县', '3', '西北');
INSERT INTO `city` VALUES ('654026', '昭苏县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654026', '昭苏县', '3', '西北');
INSERT INTO `city` VALUES ('654027', '特克斯县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654027', '特克斯县', '3', '西北');
INSERT INTO `city` VALUES ('654028', '尼勒克县', '650000', '新疆维吾尔自治区', '新疆', '654000', '伊犁哈萨克自治州', '654028', '尼勒克县', '3', '西北');
INSERT INTO `city` VALUES ('654200', '塔城地区', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('654201', '塔城市', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654201', '塔城市', '3', '西北');
INSERT INTO `city` VALUES ('654202', '乌苏市', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654202', '乌苏市', '3', '西北');
INSERT INTO `city` VALUES ('654221', '额敏县', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654221', '额敏县', '3', '西北');
INSERT INTO `city` VALUES ('654223', '沙湾县', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654223', '沙湾县', '3', '西北');
INSERT INTO `city` VALUES ('654224', '托里县', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654224', '托里县', '3', '西北');
INSERT INTO `city` VALUES ('654225', '裕民县', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654225', '裕民县', '3', '西北');
INSERT INTO `city` VALUES ('654226', '和布克赛尔蒙古自治县', '650000', '新疆维吾尔自治区', '新疆', '654200', '塔城地区', '654226', '和布克赛尔蒙古自治县', '3', '西北');
INSERT INTO `city` VALUES ('654300', '阿勒泰地区', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('654301', '阿勒泰市', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654301', '阿勒泰市', '3', '西北');
INSERT INTO `city` VALUES ('654321', '布尔津县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654321', '布尔津县', '3', '西北');
INSERT INTO `city` VALUES ('654322', '富蕴县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654322', '富蕴县', '3', '西北');
INSERT INTO `city` VALUES ('654323', '福海县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654323', '福海县', '3', '西北');
INSERT INTO `city` VALUES ('654324', '哈巴河县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654324', '哈巴河县', '3', '西北');
INSERT INTO `city` VALUES ('654325', '青河县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654325', '青河县', '3', '西北');
INSERT INTO `city` VALUES ('654326', '吉木乃县', '650000', '新疆维吾尔自治区', '新疆', '654300', '阿勒泰地区', '654326', '吉木乃县', '3', '西北');
INSERT INTO `city` VALUES ('659000', '自治区直辖县级行政区划', '650000', '新疆维吾尔自治区', '新疆', '659000', '自治区直辖县级行政区划', '0', '', '3', '西北');
INSERT INTO `city` VALUES ('659001', '石河子市', '650000', '新疆维吾尔自治区', '新疆', '659000', '自治区直辖县级行政区划', '659001', '石河子市', '3', '西北');
INSERT INTO `city` VALUES ('659002', '阿拉尔市', '650000', '新疆维吾尔自治区', '新疆', '659000', '自治区直辖县级行政区划', '659002', '阿拉尔市', '3', '西北');
INSERT INTO `city` VALUES ('659003', '图木舒克市', '650000', '新疆维吾尔自治区', '新疆', '659000', '自治区直辖县级行政区划', '659003', '图木舒克市', '3', '西北');
INSERT INTO `city` VALUES ('659004', '五家渠市', '650000', '新疆维吾尔自治区', '新疆', '659000', '自治区直辖县级行政区划', '659004', '五家渠市', '3', '西北');
INSERT INTO `city` VALUES ('710000', '台湾省', '710000', '台湾省', '台湾', '0', '', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710100', '台北', '710000', '台湾省', '台湾', '710100', '台北', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710101', '台北', '710000', '台湾省', '台湾', '710100', '台北', '710101', '台北', '0', '其他');
INSERT INTO `city` VALUES ('710200', '基隆', '710000', '台湾省', '台湾', '710200', '基隆', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710201', '基隆', '710000', '台湾省', '台湾', '710200', '基隆', '710201', '基隆', '0', '其他');
INSERT INTO `city` VALUES ('710300', '高雄', '710000', '台湾省', '台湾', '710300', '高雄', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710301', '高雄', '710000', '台湾省', '台湾', '710300', '高雄', '710301', '高雄', '0', '其他');
INSERT INTO `city` VALUES ('710400', '台中', '710000', '台湾省', '台湾', '710400', '台中', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710401', '台中', '710000', '台湾省', '台湾', '710400', '台中', '710401', '台中', '0', '其他');
INSERT INTO `city` VALUES ('710500', '台南', '710000', '台湾省', '台湾', '710500', '台南', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710501', '台南', '710000', '台湾省', '台湾', '710500', '台南', '710501', '台南', '0', '其他');
INSERT INTO `city` VALUES ('710600', '其他', '710000', '台湾省', '台湾', '710600', '其他', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('710601', '其他', '710000', '台湾省', '台湾', '710600', '其他', '710601', '其他', '0', '其他');
INSERT INTO `city` VALUES ('810000', '香港特别行政区', '810000', '香港特别行政区', '香港', '0', '', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('810100', '九龙', '810000', '香港特别行政区', '香港', '810100', '九龙', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('810101', '九龙', '810000', '香港特别行政区', '香港', '810100', '九龙', '810101', '九龙', '0', '其他');
INSERT INTO `city` VALUES ('810102', '尖沙咀', '810000', '香港特别行政区', '香港', '810100', '九龙', '810102', '尖沙咀', '0', '其他');
INSERT INTO `city` VALUES ('810103', '油麻地/旺角', '810000', '香港特别行政区', '香港', '810100', '九龙', '810103', '油麻地/旺角', '0', '其他');
INSERT INTO `city` VALUES ('810104', '九龙城', '810000', '香港特别行政区', '香港', '810100', '九龙', '810104', '九龙城', '0', '其他');
INSERT INTO `city` VALUES ('810105', '佐敦', '810000', '香港特别行政区', '香港', '810100', '九龙', '810105', '佐敦', '0', '其他');
INSERT INTO `city` VALUES ('810106', '观塘', '810000', '香港特别行政区', '香港', '810100', '九龙', '810106', '观塘', '0', '其他');
INSERT INTO `city` VALUES ('810107', '旺角', '810000', '香港特别行政区', '香港', '810100', '九龙', '810107', '旺角', '0', '其他');
INSERT INTO `city` VALUES ('810108', '深水埗', '810000', '香港特别行政区', '香港', '810100', '九龙', '810108', '深水埗', '0', '其他');
INSERT INTO `city` VALUES ('810110', '红磡', '810000', '香港特别行政区', '香港', '810100', '九龙', '810110', '红磡', '0', '其他');
INSERT INTO `city` VALUES ('810111', '油麻地', '810000', '香港特别行政区', '香港', '810100', '九龙', '810111', '油麻地', '0', '其他');
INSERT INTO `city` VALUES ('810112', '黄大仙', '810000', '香港特别行政区', '香港', '810100', '九龙', '810112', '黄大仙', '0', '其他');
INSERT INTO `city` VALUES ('810113', '九龙塘', '810000', '香港特别行政区', '香港', '810100', '九龙', '810113', '九龙塘', '0', '其他');
INSERT INTO `city` VALUES ('810114', '土瓜湾', '810000', '香港特别行政区', '香港', '810100', '九龙', '810114', '土瓜湾', '0', '其他');
INSERT INTO `city` VALUES ('810115', '九龙其他', '810000', '香港特别行政区', '香港', '810100', '九龙', '810115', '九龙其他', '0', '其他');
INSERT INTO `city` VALUES ('810116', '太子', '810000', '香港特别行政区', '香港', '810100', '九龙', '810116', '太子', '0', '其他');
INSERT INTO `city` VALUES ('810117', '土瓜湾', '810000', '香港特别行政区', '香港', '810100', '九龙', '810117', '大角咀', '0', '其他');
INSERT INTO `city` VALUES ('810118', '九龙湾', '810000', '香港特别行政区', '香港', '810100', '九龙', '810118', '九龙湾', '0', '其他');
INSERT INTO `city` VALUES ('810119', '新蒲岗', '810000', '香港特别行政区', '香港', '810100', '九龙', '810119', '新蒲岗', '0', '其他');
INSERT INTO `city` VALUES ('810120', '长沙湾', '810000', '香港特别行政区', '香港', '810100', '九龙', '810120', '长沙湾', '0', '其他');
INSERT INTO `city` VALUES ('810121', '红磡站', '810000', '香港特别行政区', '香港', '810100', '九龙', '810121', '红磡站', '0', '其他');
INSERT INTO `city` VALUES ('810122', '九龙站', '810000', '香港特别行政区', '香港', '810100', '九龙', '810122', '九龙站', '0', '其他');
INSERT INTO `city` VALUES ('810200', '香港岛', '810000', '香港特别行政区', '香港', '810200', '香港岛', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('810201', '香港岛', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810201', '香港岛', '0', '其他');
INSERT INTO `city` VALUES ('810202', '湾仔/铜锣湾', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810202', '湾仔/铜锣湾', '0', '其他');
INSERT INTO `city` VALUES ('810203', '中环/金钟', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810203', '中环/金钟', '0', '其他');
INSERT INTO `city` VALUES ('810204', '西环/上环', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810204', '西环/上环', '0', '其他');
INSERT INTO `city` VALUES ('810205', '香港仔/赤柱', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810205', '香港仔/赤柱', '0', '其他');
INSERT INTO `city` VALUES ('810206', '北角/柴湾', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810206', '北角/柴湾', '0', '其他');
INSERT INTO `city` VALUES ('810207', '铜锣湾', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810207', '铜锣湾', '0', '其他');
INSERT INTO `city` VALUES ('810208', '中环', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810208', '中环', '0', '其他');
INSERT INTO `city` VALUES ('810209', '湾仔', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810209', '湾仔', '0', '其他');
INSERT INTO `city` VALUES ('810210', '天后', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810210', '天后', '0', '其他');
INSERT INTO `city` VALUES ('810211', '上环', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810211', '上环', '0', '其他');
INSERT INTO `city` VALUES ('810212', '山顶', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810212', '山顶', '0', '其他');
INSERT INTO `city` VALUES ('810213', '香港仔', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810213', '香港仔', '0', '其他');
INSERT INTO `city` VALUES ('810214', '香港岛其他', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810214', '香港岛其他', '0', '其他');
INSERT INTO `city` VALUES ('810215', '北角', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810215', '北角', '0', '其他');
INSERT INTO `city` VALUES ('810216', '西环', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810216', '西环', '0', '其他');
INSERT INTO `city` VALUES ('810217', '赤柱', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810217', '赤柱', '0', '其他');
INSERT INTO `city` VALUES ('810218', '太古', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810218', '太古', '0', '其他');
INSERT INTO `city` VALUES ('810219', '金钟', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810219', '金钟', '0', '其他');
INSERT INTO `city` VALUES ('810220', '筲箕湾', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810220', '筲箕湾', '0', '其他');
INSERT INTO `city` VALUES ('810221', '鲗鱼涌', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810221', '鲗鱼涌', '0', '其他');
INSERT INTO `city` VALUES ('810222', '柴湾', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810222', '柴湾', '0', '其他');
INSERT INTO `city` VALUES ('810223', '跑马地', '810000', '香港特别行政区', '香港', '810200', '香港岛', '810223', '跑马地', '0', '其他');
INSERT INTO `city` VALUES ('810300', '新界', '810000', '香港特别行政区', '香港', '810300', '新界', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('810301', '新界', '810000', '香港特别行政区', '香港', '810300', '新界', '810301', '新界', '0', '其他');
INSERT INTO `city` VALUES ('810302', '沙田', '810000', '香港特别行政区', '香港', '810300', '新界', '810302', '沙田', '0', '其他');
INSERT INTO `city` VALUES ('810303', '荃湾', '810000', '香港特别行政区', '香港', '810300', '新界', '810303', '荃湾', '0', '其他');
INSERT INTO `city` VALUES ('810304', '屯门', '810000', '香港特别行政区', '香港', '810300', '新界', '810304', '屯门', '0', '其他');
INSERT INTO `city` VALUES ('810305', '西贡/将军澳', '810000', '香港特别行政区', '香港', '810300', '新界', '810305', '西贡/将军澳', '0', '其他');
INSERT INTO `city` VALUES ('810306', '元朗', '810000', '香港特别行政区', '香港', '810300', '新界', '810306', '元朗', '0', '其他');
INSERT INTO `city` VALUES ('810307', '葵涌/青衣', '810000', '香港特别行政区', '香港', '810300', '新界', '810307', '葵涌/青衣', '0', '其他');
INSERT INTO `city` VALUES ('810308', '上水/粉岭', '810000', '香港特别行政区', '香港', '810300', '新界', '810308', '上水/粉岭', '0', '其他');
INSERT INTO `city` VALUES ('810309', '大埔', '810000', '香港特别行政区', '香港', '810300', '新界', '810309', '大埔', '0', '其他');
INSERT INTO `city` VALUES ('810310', '西贡', '810000', '香港特别行政区', '香港', '810300', '新界', '810310', '西贡', '0', '其他');
INSERT INTO `city` VALUES ('810311', '青衣', '810000', '香港特别行政区', '香港', '810300', '新界', '810311', '青衣', '0', '其他');
INSERT INTO `city` VALUES ('810312', '上水', '810000', '香港特别行政区', '香港', '810300', '新界', '810312', '上水', '0', '其他');
INSERT INTO `city` VALUES ('810313', '新界其他', '810000', '香港特别行政区', '香港', '810300', '新界', '810313', '新界其他', '0', '其他');
INSERT INTO `city` VALUES ('810314', '将军澳', '810000', '香港特别行政区', '香港', '810300', '新界', '810314', '将军澳', '0', '其他');
INSERT INTO `city` VALUES ('810315', '天水围', '810000', '香港特别行政区', '香港', '810300', '新界', '810315', '天水围', '0', '其他');
INSERT INTO `city` VALUES ('810316', '葵涌', '810000', '香港特别行政区', '香港', '810300', '新界', '810316', '葵涌', '0', '其他');
INSERT INTO `city` VALUES ('810317', '粉岭', '810000', '香港特别行政区', '香港', '810300', '新界', '810317', '粉岭', '0', '其他');
INSERT INTO `city` VALUES ('810400', '离岛', '810000', '香港特别行政区', '香港', '810400', '离岛', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('810401', '离岛', '810000', '香港特别行政区', '香港', '810400', '离岛', '810401', '离岛', '0', '其他');
INSERT INTO `city` VALUES ('810402', '大屿山', '810000', '香港特别行政区', '香港', '810400', '离岛', '810402', '大屿山', '0', '其他');
INSERT INTO `city` VALUES ('810403', '东涌', '810000', '香港特别行政区', '香港', '810400', '离岛', '810403', '东涌', '0', '其他');
INSERT INTO `city` VALUES ('810404', '赤鱲角', '810000', '香港特别行政区', '香港', '810400', '离岛', '810404', '赤鱲角', '0', '其他');
INSERT INTO `city` VALUES ('810405', '南丫岛', '810000', '香港特别行政区', '香港', '810400', '离岛', '810405', '南丫岛', '0', '其他');
INSERT INTO `city` VALUES ('810406', '长洲', '810000', '香港特别行政区', '香港', '810400', '离岛', '810406', '长洲', '0', '其他');
INSERT INTO `city` VALUES ('810407', '离岛其他', '810000', '香港特别行政区', '香港', '810400', '离岛', '810407', '离岛其他', '0', '其他');
INSERT INTO `city` VALUES ('810408', '香港国际机场', '810000', '香港特别行政区', '香港', '810400', '离岛', '810408', '香港国际机场', '0', '其他');
INSERT INTO `city` VALUES ('820000', '澳门特别行政区', '820000', '澳门特别行政区', '澳门', '0', '', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820100', '花地玛堂', '820000', '澳门特别行政区', '澳门', '820100', '花地玛堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820101', '花地玛堂', '820000', '澳门特别行政区', '澳门', '820100', '花地玛堂', '820101', '花地玛堂', '0', '其他');
INSERT INTO `city` VALUES ('820200', '圣安多尼堂区', '820000', '澳门特别行政区', '澳门', '820200', '圣安多尼堂区', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820201', '圣安多尼堂区', '820000', '澳门特别行政区', '澳门', '820200', '圣安多尼堂区', '820201', '圣安多尼堂区', '0', '其他');
INSERT INTO `city` VALUES ('820300', '大堂', '820000', '澳门特别行政区', '澳门', '820300', '大堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820301', '大堂', '820000', '澳门特别行政区', '澳门', '820300', '大堂', '820301', '大堂', '0', '其他');
INSERT INTO `city` VALUES ('820400', '望德堂', '820000', '澳门特别行政区', '澳门', '820400', '望德堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820401', '望德堂', '820000', '澳门特别行政区', '澳门', '820400', '望德堂', '820401', '望德堂', '0', '其他');
INSERT INTO `city` VALUES ('820500', '风顺堂', '820000', '澳门特别行政区', '澳门', '820500', '风顺堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820501', '风顺堂', '820000', '澳门特别行政区', '澳门', '820500', '风顺堂', '820501', '风顺堂', '0', '其他');
INSERT INTO `city` VALUES ('820600', '嘉模堂', '820000', '澳门特别行政区', '澳门', '820600', '嘉模堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820601', '嘉模堂', '820000', '澳门特别行政区', '澳门', '820600', '嘉模堂', '820601', '嘉模堂', '0', '其他');
INSERT INTO `city` VALUES ('820700', '圣方济各堂', '820000', '澳门特别行政区', '澳门', '820700', '圣方济各堂', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820701', '圣方济各堂', '820000', '澳门特别行政区', '澳门', '820700', '圣方济各堂', '820701', '圣方济各堂', '0', '其他');
INSERT INTO `city` VALUES ('820800', '路氹城', '820000', '澳门特别行政区', '澳门', '820800', '路氹城', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820801', '路氹城', '820000', '澳门特别行政区', '澳门', '820800', '路氹城', '820801', '路氹城', '0', '其他');
INSERT INTO `city` VALUES ('820900', '澳门周边', '820000', '澳门特别行政区', '澳门', '820900', '澳门周边', '0', '', '0', '其他');
INSERT INTO `city` VALUES ('820901', '澳门周边', '820000', '澳门特别行政区', '澳门', '820900', '澳门周边', '820901', '澳门周边', '0', '其他');
INSERT INTO `city` VALUES ('419001001', '沁园街道', '410000', '河南省', '河南', '419001', '济源市', '419001001', '沁园街道', '5', '华中');
INSERT INTO `city` VALUES ('419001002', '济水街道', '410000', '河南省', '河南', '419001', '济源市', '419001002', '济水街道', '5', '华中');
INSERT INTO `city` VALUES ('419001003', '北海街道', '410000', '河南省', '河南', '419001', '济源市', '419001003', '北海街道', '5', '华中');
INSERT INTO `city` VALUES ('419001004', '天坛街道', '410000', '河南省', '河南', '419001', '济源市', '419001004', '天坛街道', '5', '华中');
INSERT INTO `city` VALUES ('419001005', '玉泉街道', '410000', '河南省', '河南', '419001', '济源市', '419001005', '玉泉街道', '5', '华中');
INSERT INTO `city` VALUES ('419001100', '克井镇', '410000', '河南省', '河南', '419001', '济源市', '419001100', '克井镇', '5', '华中');
INSERT INTO `city` VALUES ('419001101', '五龙口镇', '410000', '河南省', '河南', '419001', '济源市', '419001101', '五龙口镇', '5', '华中');
INSERT INTO `city` VALUES ('419001102', '轵城镇', '410000', '河南省', '河南', '419001', '济源市', '419001102', '轵城镇', '5', '华中');
INSERT INTO `city` VALUES ('419001103', '承留镇', '410000', '河南省', '河南', '419001', '济源市', '419001103', '承留镇', '5', '华中');
INSERT INTO `city` VALUES ('419001104', '邵原镇', '410000', '河南省', '河南', '419001', '济源市', '419001104', '邵原镇', '5', '华中');
INSERT INTO `city` VALUES ('419001105', '坡头镇', '410000', '河南省', '河南', '419001', '济源市', '419001105', '坡头镇', '5', '华中');
INSERT INTO `city` VALUES ('419001106', '梨林镇', '410000', '河南省', '河南', '419001', '济源市', '419001106', '梨林镇', '5', '华中');
INSERT INTO `city` VALUES ('419001107', '大峪镇', '410000', '河南省', '河南', '419001', '济源市', '419001107', '大峪镇', '5', '华中');
INSERT INTO `city` VALUES ('419001108', '思礼镇', '410000', '河南省', '河南', '419001', '济源市', '419001108', '思礼镇', '5', '华中');
INSERT INTO `city` VALUES ('419001109', '王屋镇', '410000', '河南省', '河南', '419001', '济源市', '419001109', '王屋镇', '5', '华中');
INSERT INTO `city` VALUES ('419001110', '下冶镇', '410000', '河南省', '河南', '419001', '济源市', '419001110', '下冶镇', '5', '华中');

-- ----------------------------
-- Table structure for images
-- ----------------------------
DROP TABLE IF EXISTS `images`;
CREATE TABLE `images` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `bucket` varchar(20) NOT NULL DEFAULT '',
  `file_key` varchar(60) NOT NULL DEFAULT '' COMMENT '文件名',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_bucket` (`bucket`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of images
-- ----------------------------
INSERT INTO `images` VALUES ('1', 'brand', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 06:24:36');
INSERT INTO `images` VALUES ('2', 'brand', '20190322/a4c27ddb48b98e38ac0e23d065287048.jpg', '2019-03-22 06:26:32');
INSERT INTO `images` VALUES ('3', 'brand', '20190322/47a16e158682170d52ffcbf394a36fd0.jpg', '2019-03-22 06:27:14');
INSERT INTO `images` VALUES ('4', 'brand', '20190322/31ef8d18a990c24d163563d718b0afc2.jpg', '2019-03-22 06:29:58');
INSERT INTO `images` VALUES ('5', 'brand', '20190322/3d0831ff3231f0d8af754df80e037383.jpg', '2019-03-22 06:30:53');
INSERT INTO `images` VALUES ('6', 'brand', '20190322/fd2c9cea9ce85fe99fc1fb54afb5f01f.jpg', '2019-03-22 06:37:33');
INSERT INTO `images` VALUES ('7', 'brand', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 06:38:54');
INSERT INTO `images` VALUES ('8', 'brand', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 06:42:20');
INSERT INTO `images` VALUES ('9', 'brand', '20190322/8a42b90ba2f2647e13ff06c05983ca94.jpg', '2019-03-22 06:54:35');
INSERT INTO `images` VALUES ('10', 'brand', '20190322/3d0831ff3231f0d8af754df80e037383.jpg', '2019-03-22 07:49:16');
INSERT INTO `images` VALUES ('11', 'brand', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 07:54:21');
INSERT INTO `images` VALUES ('12', 'brand', '20190322/a4cbaf0c79cf7e0cbc34d43af8e745cb.jpg', '2019-03-22 07:57:37');
INSERT INTO `images` VALUES ('13', 'brand', '20190322/f8dc7f6cb025d2e9ae247bc9b8caba31.jpg', '2019-03-22 07:57:50');
INSERT INTO `images` VALUES ('14', 'brand', '20190322/2499dfc59b65c537322ec5e2b2aba81a.jpg', '2019-03-22 07:58:07');
INSERT INTO `images` VALUES ('15', 'book', '20190322/38d7f55da65a9ff365b44e95b813bf45.jpg', '2019-03-22 13:35:20');
INSERT INTO `images` VALUES ('16', 'book', '20190322/38d7f55da65a9ff365b44e95b813bf45.jpg', '2019-03-22 13:38:45');
INSERT INTO `images` VALUES ('17', 'book', '20190322/38d7f55da65a9ff365b44e95b813bf45.jpg', '2019-03-22 13:40:30');

-- ----------------------------
-- Table structure for market_qrcode
-- ----------------------------
DROP TABLE IF EXISTS `market_qrcode`;
CREATE TABLE `market_qrcode` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '名字',
  `qrcode` varchar(62) NOT NULL DEFAULT '' COMMENT '二维码内容',
  `extra` varchar(2000) NOT NULL DEFAULT '' COMMENT '接口返回的信息',
  `expired_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '过期时间',
  `total_scan_count` int(11) NOT NULL DEFAULT '0' COMMENT '总扫码关注量',
  `total_reg_count` int(11) NOT NULL DEFAULT '0' COMMENT '总注册数量',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of market_qrcode
-- ----------------------------

-- ----------------------------
-- Table structure for member
-- ----------------------------
DROP TABLE IF EXISTS `member`;
CREATE TABLE `member` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `nickname` varchar(100) NOT NULL DEFAULT '' COMMENT '会员名',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '会员手机号码',
  `sex` tinyint(1) NOT NULL DEFAULT '0' COMMENT '性别 1：男 2：女',
  `avatar` varchar(200) NOT NULL DEFAULT '' COMMENT '会员头像',
  `salt` varchar(32) NOT NULL DEFAULT '' COMMENT '随机salt',
  `reg_ip` varchar(100) NOT NULL DEFAULT '' COMMENT '注册ip',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态 1：有效 0：无效',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_mobile` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='会员表';

-- ----------------------------
-- Records of member
-- ----------------------------
INSERT INTO `member` VALUES ('1', '测试66会员', '18819433871', '0', 'default_avatar', '', '', '1', '2019-03-22 08:35:33', '2019-03-22 08:35:20');
INSERT INTO `member` VALUES ('2', '15018445543', '15018445543', '0', 'default_avatar', 'U$o85Z20OZt@NCq0', '3683241836', '1', '2019-03-22 11:33:05', '2019-03-22 11:33:05');

-- ----------------------------
-- Table structure for member_address
-- ----------------------------
DROP TABLE IF EXISTS `member_address`;
CREATE TABLE `member_address` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `nickname` varchar(20) NOT NULL DEFAULT '' COMMENT '收货人姓名',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '收货人手机号码',
  `province_id` int(11) NOT NULL DEFAULT '0' COMMENT '省id',
  `city_id` int(11) NOT NULL DEFAULT '0' COMMENT '城市id',
  `area_id` int(11) NOT NULL DEFAULT '0' COMMENT '区域id',
  `address` varchar(100) NOT NULL DEFAULT '' COMMENT '详细地址',
  `is_default` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否默认地址 1：是 0：不是',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否有效 1：有效 0：无效',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_member_id_status` (`member_id`,`status`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='会员收货地址';

-- ----------------------------
-- Records of member_address
-- ----------------------------
INSERT INTO `member_address` VALUES ('1', '2', '彭先生', '18818818808', '120000', '120000', '120102', '测试地址001', '0', '1', '2019-03-22 13:44:24', '2019-03-22 13:44:24');

-- ----------------------------
-- Table structure for member_cart
-- ----------------------------
DROP TABLE IF EXISTS `member_cart`;
CREATE TABLE `member_cart` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` bigint(20) NOT NULL DEFAULT '0' COMMENT '会员id',
  `book_id` int(11) NOT NULL DEFAULT '0' COMMENT '图书id',
  `quantity` int(11) NOT NULL DEFAULT '0' COMMENT '数量',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_member_id` (`member_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='购物车';

-- ----------------------------
-- Records of member_cart
-- ----------------------------

-- ----------------------------
-- Table structure for member_comments
-- ----------------------------
DROP TABLE IF EXISTS `member_comments`;
CREATE TABLE `member_comments` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `book_id` int(11) NOT NULL DEFAULT '0' COMMENT '商品id',
  `pay_order_id` int(11) NOT NULL DEFAULT '0' COMMENT '订单id',
  `score` tinyint(4) NOT NULL DEFAULT '0' COMMENT '评分',
  `content` varchar(200) NOT NULL DEFAULT '' COMMENT '评论内容',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' ON UPDATE CURRENT_TIMESTAMP COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_member_id` (`member_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='会员评论表';

-- ----------------------------
-- Records of member_comments
-- ----------------------------

-- ----------------------------
-- Table structure for member_fav
-- ----------------------------
DROP TABLE IF EXISTS `member_fav`;
CREATE TABLE `member_fav` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `book_id` int(11) NOT NULL DEFAULT '0' COMMENT '书籍id',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='会员收藏表';

-- ----------------------------
-- Records of member_fav
-- ----------------------------
INSERT INTO `member_fav` VALUES ('1', '2', '1', '2019-03-22 13:46:28');

-- ----------------------------
-- Table structure for oauth_access_token
-- ----------------------------
DROP TABLE IF EXISTS `oauth_access_token`;
CREATE TABLE `oauth_access_token` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `access_token` varchar(600) NOT NULL DEFAULT '',
  `expired_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '过期时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_expired_time` (`expired_time`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='微信的access_token 用户调用其他接口的';

-- ----------------------------
-- Records of oauth_access_token
-- ----------------------------
INSERT INTO `oauth_access_token` VALUES ('1', '19_36rcTkEOSTzlWBHGnDn1XgtBxg7PBUYO9byS1lbvEBoDBC37S66PYbzWC8eTrkcQ_YLz2UbOl1VcSgOhPb4IZN7DX1LXqZh9BRJDFmJdA9FN39wC9XRjF9PWysmi1_CdTrzJDlMtVDPtrb5VVQAeACAEZJ', '2019-03-22 12:11:57', '2019-03-22 10:15:16');

-- ----------------------------
-- Table structure for oauth_member_bind
-- ----------------------------
DROP TABLE IF EXISTS `oauth_member_bind`;
CREATE TABLE `oauth_member_bind` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `client_type` varchar(20) NOT NULL DEFAULT '' COMMENT '客户端来源类型。qq,weibo,weixin',
  `type` tinyint(3) NOT NULL DEFAULT '0' COMMENT '类型 type 1:wechat ',
  `openid` varchar(80) NOT NULL DEFAULT '' COMMENT '第三方id',
  `unionid` varchar(100) NOT NULL DEFAULT '',
  `extra` text NOT NULL COMMENT '额外字段',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_type_openid` (`type`,`openid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='第三方登录绑定关系';

-- ----------------------------
-- Records of oauth_member_bind
-- ----------------------------

-- ----------------------------
-- Table structure for oauth_token
-- ----------------------------
DROP TABLE IF EXISTS `oauth_token`;
CREATE TABLE `oauth_token` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `client_type` varchar(20) NOT NULL DEFAULT '' COMMENT '客户端来源类型。qq,weibo,weixin',
  `token` varchar(500) NOT NULL DEFAULT '',
  `note` varchar(1000) NOT NULL DEFAULT '' COMMENT '备注',
  `valid_to` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '有效期截止日期',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `createdt_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `client_type_token` (`client_type`,`token`(255))
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='oauth token 表';

-- ----------------------------
-- Records of oauth_token
-- ----------------------------

-- ----------------------------
-- Table structure for pay_order
-- ----------------------------
DROP TABLE IF EXISTS `pay_order`;
CREATE TABLE `pay_order` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(40) NOT NULL DEFAULT '' COMMENT '随机订单号',
  `member_id` bigint(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `target_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '商品类型 1:书籍',
  `pay_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1:微信 2：支付宝 3：银行转账 4: 现金 5:其他 6:刷卡',
  `pay_source` tinyint(1) NOT NULL DEFAULT '0' COMMENT '下单来源:1:PC 2:m',
  `total_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '订单应付金额',
  `discount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '优惠金额',
  `pay_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '订单实付金额',
  `pay_in_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '扣点后的所得金额',
  `ratio` float NOT NULL DEFAULT '0' COMMENT '所扣点数',
  `pay_sn` varchar(128) NOT NULL DEFAULT '' COMMENT '第三方流水号',
  `note` text NOT NULL COMMENT '备注信息',
  `status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '1：支付完成 0 无效 -1 申请退款 -2 退款中 -9 退款成功  -8 待支付  -7 完成支付待确认',
  `express_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '快递状态，-8 待支付 -7 已付款待发货 1：确认收货 0：失败',
  `express_address_id` int(11) NOT NULL DEFAULT '0' COMMENT '快递地址id',
  `express_info` varchar(100) NOT NULL DEFAULT '' COMMENT '快递单新',
  `comment_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '评论状态',
  `pay_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '付款到账时间',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最近一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `idx_order_sn` (`order_sn`),
  KEY `idx_member_id_status` (`member_id`,`status`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='在线购买订单表';

-- ----------------------------
-- Records of pay_order
-- ----------------------------
INSERT INTO `pay_order` VALUES ('1', 'a312b911b760f5ddccd24acead9c5e37', '2', '1', '1', '2', '7.50', '0.00', '7.50', '0.00', '0', '', '购买书籍', '-8', '-8', '1', '', '0', '0000-00-00 00:00:00', '2019-03-22 13:44:37', '2019-03-22 13:44:37');

-- ----------------------------
-- Table structure for pay_order_callback_data
-- ----------------------------
DROP TABLE IF EXISTS `pay_order_callback_data`;
CREATE TABLE `pay_order_callback_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pay_order_id` int(11) NOT NULL DEFAULT '0' COMMENT '支付订单id',
  `pay_data` text NOT NULL COMMENT '支付回调信息',
  `refund_data` text NOT NULL COMMENT '退款回调信息',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `pay_order_id` (`pay_order_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of pay_order_callback_data
-- ----------------------------

-- ----------------------------
-- Table structure for pay_order_item
-- ----------------------------
DROP TABLE IF EXISTS `pay_order_item`;
CREATE TABLE `pay_order_item` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `pay_order_id` int(11) NOT NULL DEFAULT '0' COMMENT '订单id',
  `member_id` bigint(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `quantity` int(11) NOT NULL DEFAULT '1' COMMENT '购买数量 默认1份',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '商品总价格，售价 * 数量',
  `discount` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '当前折扣',
  `target_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '商品类型 1:书籍',
  `target_id` int(11) NOT NULL DEFAULT '0' COMMENT '对应不同商品表的id字段',
  `note` text NOT NULL COMMENT '备注信息',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态：1：成功 0 失败',
  `comment_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '评价状态 1：已评价，0 ：未评价',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最近一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `id_order_id` (`pay_order_id`),
  KEY `idx_target_type_id` (`target_type`,`target_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='订单详情表';

-- ----------------------------
-- Records of pay_order_item
-- ----------------------------
INSERT INTO `pay_order_item` VALUES ('1', '1', '2', '1', '7.50', '0.00', '1', '1', '', '1', '0', '2019-03-22 13:44:37', '2019-03-22 13:44:37');

-- ----------------------------
-- Table structure for qrcode_scan_history
-- ----------------------------
DROP TABLE IF EXISTS `qrcode_scan_history`;
CREATE TABLE `qrcode_scan_history` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `openid` varchar(100) NOT NULL DEFAULT '' COMMENT 'openid',
  `qrcode_id` int(11) NOT NULL DEFAULT '0' COMMENT '二维码id',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='渠道二维码扫码openid记录';

-- ----------------------------
-- Records of qrcode_scan_history
-- ----------------------------

-- ----------------------------
-- Table structure for queue_list
-- ----------------------------
DROP TABLE IF EXISTS `queue_list`;
CREATE TABLE `queue_list` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `queue_name` varchar(30) NOT NULL DEFAULT '' COMMENT '队列名字',
  `data` varchar(500) NOT NULL DEFAULT '' COMMENT '队列数据',
  `status` tinyint(1) NOT NULL DEFAULT '-1' COMMENT '状态 -1 待处理 1 已处理',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='事件队列表';

-- ----------------------------
-- Records of queue_list
-- ----------------------------

-- ----------------------------
-- Table structure for sms_captcha
-- ----------------------------
DROP TABLE IF EXISTS `sms_captcha`;
CREATE TABLE `sms_captcha` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `mobile` varchar(20) NOT NULL DEFAULT '',
  `captcha` varchar(10) NOT NULL DEFAULT '',
  `ip` varchar(20) NOT NULL DEFAULT '',
  `expires_at` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `status` tinyint(4) NOT NULL,
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`),
  KEY `mobile` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sms_captcha
-- ----------------------------
INSERT INTO `sms_captcha` VALUES ('1', '15018445543', '26410', '219.137.207.108', '2019-03-22 11:33:04', '0', '2019-03-22 11:32:54');

-- ----------------------------
-- Table structure for sms_queue
-- ----------------------------
DROP TABLE IF EXISTS `sms_queue`;
CREATE TABLE `sms_queue` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `mobile` varchar(256) NOT NULL DEFAULT '' COMMENT '手机号码',
  `sign` varchar(10) NOT NULL DEFAULT '' COMMENT '签名',
  `content` varchar(255) NOT NULL DEFAULT '' COMMENT '发送手机内容',
  `channel` varchar(30) NOT NULL DEFAULT '' COMMENT '发送渠道名称',
  `status` tinyint(4) NOT NULL DEFAULT '1' COMMENT '发送状态 1成功 0 失败 -2 等待发送 -1 发送中',
  `return_msg` varchar(255) NOT NULL DEFAULT '' COMMENT '返回信息',
  `taskid` varchar(60) NOT NULL DEFAULT '' COMMENT '任务id',
  `ip` varchar(15) NOT NULL DEFAULT '' COMMENT '客户端发送ip',
  `send_number` int(11) NOT NULL DEFAULT '1' COMMENT '发送条数，默认1',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最近一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_status_mobile` (`status`,`mobile`),
  KEY `idx_ip` (`ip`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='短信发送队列表';

-- ----------------------------
-- Records of sms_queue
-- ----------------------------
INSERT INTO `sms_queue` VALUES ('1', '15018445543', '', '您此次操作的会员绑定验证码为：26410', 'default', '-2', '', '', '219.137.207.108', '1', '2019-03-22 11:32:54', '2019-03-22 11:32:54');

-- ----------------------------
-- Table structure for stat_daily_book
-- ----------------------------
DROP TABLE IF EXISTS `stat_daily_book`;
CREATE TABLE `stat_daily_book` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL,
  `book_id` int(11) NOT NULL DEFAULT '0' COMMENT '书籍id',
  `total_count` int(11) NOT NULL DEFAULT '0' COMMENT '售卖总数量',
  `total_pay_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '总售卖金额',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `date_book_id` (`date`,`book_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='书籍售卖日统计';

-- ----------------------------
-- Records of stat_daily_book
-- ----------------------------

-- ----------------------------
-- Table structure for stat_daily_member
-- ----------------------------
DROP TABLE IF EXISTS `stat_daily_member`;
CREATE TABLE `stat_daily_member` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL COMMENT '日期',
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `total_shared_count` int(11) NOT NULL DEFAULT '0' COMMENT '当日分享总次数',
  `total_pay_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '当日付款总金额',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_date_member_id` (`date`,`member_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='会员日统计';

-- ----------------------------
-- Records of stat_daily_member
-- ----------------------------

-- ----------------------------
-- Table structure for stat_daily_site
-- ----------------------------
DROP TABLE IF EXISTS `stat_daily_site`;
CREATE TABLE `stat_daily_site` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` date NOT NULL COMMENT '日期',
  `total_pay_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '当日应收总金额',
  `total_member_count` int(11) NOT NULL COMMENT '会员总数',
  `total_new_member_count` int(11) NOT NULL COMMENT '当日新增会员数',
  `total_order_count` int(11) NOT NULL COMMENT '当日订单数',
  `total_shared_count` int(11) NOT NULL,
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  KEY `idx_date` (`date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='全站日统计';

-- ----------------------------
-- Records of stat_daily_site
-- ----------------------------

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `uid` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '用户uid',
  `nickname` varchar(100) NOT NULL DEFAULT '' COMMENT '用户名',
  `mobile` varchar(20) NOT NULL DEFAULT '' COMMENT '手机号码',
  `email` varchar(100) NOT NULL DEFAULT '' COMMENT '邮箱地址',
  `sex` tinyint(1) NOT NULL DEFAULT '0' COMMENT '1：男 2：女 0：没填写',
  `avatar` varchar(64) NOT NULL DEFAULT '' COMMENT '头像',
  `login_name` varchar(20) NOT NULL DEFAULT '' COMMENT '登录用户名',
  `login_pwd` varchar(32) NOT NULL DEFAULT '' COMMENT '登录密码',
  `login_salt` varchar(32) NOT NULL DEFAULT '' COMMENT '登录密码的随机加密秘钥',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1：有效 0：无效',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最后一次更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`uid`),
  UNIQUE KEY `login_name` (`login_name`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='用户表（管理员）';

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', '编程浪子', '11012345679', 'apanly@163.com', '1', '', 'admin', '0a9fa6470781137a102dc209cc72cc65', 'cF3JfH5FJfQ8B2Ba', '1', '2019-03-21 09:17:53', '2017-03-15 14:08:48');
INSERT INTO `user` VALUES ('2', '编程浪子2', '11012345679', 'apanly@163.com', '1', '', 'admin1', '0a9fa6470781137a102dc209cc72cc65', 'cF3JfH5FJfQ8B2Ba', '1', '2019-03-21 09:17:53', '2017-03-15 14:08:48');
INSERT INTO `user` VALUES ('3', '编程浪子3', '11012345679', 'apanly@163.com', '1', '', 'admin2', '0a9fa6470781137a102dc209cc72cc65', 'cF3JfH5FJfQ8B2Ba', '0', '2019-03-22 04:28:50', '2017-03-15 14:08:48');

-- ----------------------------
-- Table structure for user_account_change_log
-- ----------------------------
DROP TABLE IF EXISTS `user_account_change_log`;
CREATE TABLE `user_account_change_log` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `target_type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '类型 1:书籍',
  `pay_order_id` int(11) NOT NULL DEFAULT '0' COMMENT '支付id',
  `task_key` varchar(60) NOT NULL DEFAULT '',
  `money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '交易金额',
  `note` varchar(200) NOT NULL DEFAULT '' COMMENT '备注',
  `updated_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '最近更新时间',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `task_key` (`task_key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='账户历史表';

-- ----------------------------
-- Records of user_account_change_log
-- ----------------------------

-- ----------------------------
-- Table structure for wx_history
-- ----------------------------
DROP TABLE IF EXISTS `wx_history`;
CREATE TABLE `wx_history` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `from_openid` varchar(64) NOT NULL DEFAULT '' COMMENT '发送方帐号',
  `to_openid` varchar(64) NOT NULL DEFAULT '' COMMENT '开发者微信号',
  `type` varchar(20) NOT NULL DEFAULT '' COMMENT '类型',
  `content` varchar(500) NOT NULL DEFAULT '' COMMENT '正文内容',
  `text` text NOT NULL COMMENT '全部内容xml',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '插入时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='微信内容历史';

-- ----------------------------
-- Records of wx_history
-- ----------------------------

-- ----------------------------
-- Table structure for wx_share_history
-- ----------------------------
DROP TABLE IF EXISTS `wx_share_history`;
CREATE TABLE `wx_share_history` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `member_id` int(11) NOT NULL DEFAULT '0' COMMENT '会员id',
  `share_url` varchar(200) NOT NULL DEFAULT '' COMMENT '分享的页面url',
  `created_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='微信分享记录';

-- ----------------------------
-- Records of wx_share_history
-- ----------------------------
